{"MlM_gen[genders_of_persons.TreeSet.equal,types_of_things.TreeSet.child][cxt_len=3]": {"texts": ["\nDavid has a piano. Sharon has a rabbit. Barbara has bread. Barbara a kind of likes food\nJohn has a guitar. Donna has yellow. Michael has shoes. John a kind of likes musical instrument\nSandra has a rabbit. Elizabeth has bread. James has wine. James a kind of likes drink\nChristopher has blue. Donald has a mosquito. Helen has a pineapple. Donald a kind of likes insect\nChristopher has a beetle. Richard has T-shirt. Jason has a gun. Christopher a kind of likes insect\nKimberly has a mouse. Steven has a uniform. Elizabeth has blackberries. Steven a kind of likes clothing\nRuth has a beetle. George has a goat. Kevin has a peach. Ruth a kind of likes insect\nJoseph has strawberries. Mary has a guitar. Anthony has red. Mary a kind of likes musical instrument\nKenneth has beer. Deborah has a revolver. John has an iPad. Kenneth a kind of likes drink\nJames has a pineapple. Donna has a basketball. Susan has an elephant. Donna a kind of likes sport\nDeborah has a grenade. Dorothy has a basketball. Nancy has a taxi. Dorothy a kind of likes sport\nSarah has a handgun. Laura has blueberries. William has a hamburger. Laura a kind of likes fruit\nRonald has blue. Deborah has an apple. John has a basketball. John a kind of likes sport\nBetty has blackberries. Elizabeth has a sweater. Mary has a wolf. Elizabeth a kind of likes clothing\nKevin has a lemon. Karen has a guitar. Carol has sheep. Karen a kind of likes musical instrument\nNancy has jeans. Ruth has pink. Mark has a guitar. Nancy a kind of likes clothing\n", "\nElizabeth has red. Daniel has wine. Ronald has a laptop. Ronald a kind of likes electronics\nJames has a basketball. Nancy has a sweater. Daniel has a squirrel. James a kind of likes sport\nSarah has a burger. Michelle has a papaya. Lisa has a cannon. Sarah a kind of likes food\nNancy has strawberries. Thomas has cake. William has beer. Thomas a kind of likes food\nJohn has a basketball. Michael has a shotgun. Donna has a jacket. Donna a kind of likes clothing\nEdward has a baseball. Jennifer has soda. Elizabeth has a shotgun. Edward a kind of likes sport\nJason has a wolf. Mark has a shotgun. Donald has a peach. Donald a kind of likes fruit\nRichard has a kiwi. Paul has a goose. Mark has red. Mark a kind of likes color\nKenneth has a taxi. Linda has a gorilla. Elizabeth has spaghetti. Linda a kind of likes animal\nKenneth has jeans. Maria has pink. George has a car. George a kind of likes vehicle\nSusan has a steak. John has shoes. Kenneth has spaghetti. John a kind of likes clothing\nDeborah has a mouse. Steven has a mango. Sarah has a football. Sarah a kind of likes sport\nSarah has a jeep. Jennifer has sheep. Elizabeth has spaghetti. Jennifer a kind of likes animal\nKevin has an apple. Lisa has coffee. Linda has sheep. Lisa a kind of likes drink\nMichelle has a car. Elizabeth has a beetle. Mary has a donkey. Michelle a kind of likes vehicle\nDavid has a laptop. Michael has a baseball. Kimberly has a basketball. David a kind of likes electronics\n", "\nSusan has a jersey. William has a pig. Kenneth has a cocktail. Kenneth a kind of likes drink\nSteven has a squirrel. Jason has bread. Donald has a tiger. Jason a kind of likes food\nKenneth has trousers. Sarah has a phone. Betty has beer. Betty a kind of likes drink\nBrian has meat. Michelle has an apricot. Barbara has red. Brian a kind of likes food\nJeff has blueberries. Michelle has bread. Donna has a horse. Michelle a kind of likes food\nElizabeth has a motorcycle. John has cake. Edward has a gorilla. Elizabeth a kind of likes vehicle\nJennifer has a plum. Ronald has soda. David has a mosquito. David a kind of likes insect\nJason has a car. Christopher has spaghetti. Anthony has a violin. Anthony a kind of likes musical instrument\nSteven has a rifle. Helen has a wolf. Susan has a kiwi. Steven a kind of likes weapon\nSarah has pizza. Nancy has a pineapple. Ronald has a piano. Ronald a kind of likes musical instrument\nJeff has T-shirt. Charles has a beetle. Laura has a donkey. Charles a kind of likes insect\nDonald has tea. Brian has pizza. Michael has a car. Donald a kind of likes drink\nBarbara has a cow. Charles has a pineapple. Kimberly has a violin. Kimberly a kind of likes musical instrument\nWilliam has a mouse. Donna has whiskey. Jennifer has spaghetti. William a kind of likes animal\nMark has a beetle. Jeff has a pear. Sandra has a revolver. Mark a kind of likes insect\nJohn has black. Sandra has tea. Richard has a cat. John a kind of likes color\n", "\nRichard has white. Anthony has a burger. Mark has a horse. Richard a kind of likes color\nDonna has a handgun. Michelle has a steak. Ronald has coffee. Ronald a kind of likes drink\nNancy has yellow. Carol has vodka. Christopher has a mosquito. Carol a kind of likes drink\nJennifer has a pistol. Robert has red. William has a jersey. William a kind of likes clothing\nThomas has a smartphone. Lisa has strawberries. Carol has a shirt. Thomas a kind of likes electronics\nKimberly has a dog. Robert has a laptop. Anthony has grapes. Robert a kind of likes electronics\nJennifer has a piano. Lisa has white. Donna has an orange. Jennifer a kind of likes musical instrument\nPatricia has pants. Linda has a motorcycle. William has a baseball. William a kind of likes sport\nMark has a guitar. Kevin has a pistol. William has a lime. Mark a kind of likes musical instrument\nEdward has red. Kimberly has a donkey. Karen has a pineapple. Edward a kind of likes color\nSharon has green. Patricia has a baseball. Margaret has pants. Margaret a kind of likes clothing\nRuth has pink. Michael has a lion. Laura has a revolver. Michael a kind of likes animal\nLisa has an iPad. James has a football. Betty has a watermelon. James a kind of likes sport\nSusan has a cow. Margaret has a banana. Deborah has soda. Deborah a kind of likes drink\nChristopher has a cannon. William has a sweater. Karen has a bee. Christopher a kind of likes weapon\nDonald has a pear. Mark has a basketball. Daniel has a jersey. Mark a kind of likes sport\n", "\nThomas has a violin. Patricia has a burger. Jason has a guitar. Patricia a kind of likes food\nMary has a motorcycle. William has whiskey. Susan has trousers. Mary a kind of likes vehicle\nMaria has a donkey. Helen has bread. Michelle has green. Michelle a kind of likes color\nLinda has a steak. Anthony has blackberries. Edward has a bus. Linda a kind of likes food\nMichelle has green. Robert has a pear. Dorothy has a cocktail. Dorothy a kind of likes drink\nKenneth has a peach. Jennifer has a goose. Sharon has a piano. Sharon a kind of likes musical instrument\nBetty has a deer. David has a steak. James has shoes. Betty a kind of likes animal\nCharles has pizza. Laura has a durian. Richard has whiskey. Charles a kind of likes food\nMichelle has a baseball. Kevin has a cow. Elizabeth has a phone. Michelle a kind of likes sport\nGeorge has a mosquito. Linda has a watermelon. Margaret has a piano. Linda a kind of likes fruit\nKaren has a sweater. Kevin has a dog. Elizabeth has a steak. Kevin a kind of likes animal\nDorothy has a mango. Steven has a shotgun. Deborah has a bus. Steven a kind of likes weapon\nSharon has a tiger. Kimberly has a durian. Nancy has a cocktail. Kimberly a kind of likes fruit\nBarbara has shoes. Sandra has cake. Maria has a pear. Barbara a kind of likes clothing\nEdward has a uniform. Michael has a guitar. John has a squirrel. Michael a kind of likes musical instrument\nJohn has cherries. William has a pig. Michelle has beer. John a kind of likes fruit\n", "\nJohn has a pineapple. Richard has a mosquito. Brian has bread. Richard a kind of likes insect\nJeff has green. Kimberly has a durian. Susan has a pistol. Susan a kind of likes weapon\nMaria has trousers. Mark has a rifle. William has a basketball. Mark a kind of likes weapon\nJennifer has cake. Kenneth has pink. James has coffee. Kenneth a kind of likes color\nPatricia has a guitar. Mary has a pistol. Charles has a taxi. Patricia a kind of likes musical instrument\nMary has a baseball. Karen has a costume. Daniel has a lion. Mary a kind of likes sport\nRuth has blueberries. Kimberly has a basketball. Jennifer has a mango. Kimberly a kind of likes sport\nMary has a sweater. Carol has jeans. Sandra has gray. Sandra a kind of likes color\nKaren has a goose. Robert has a mosquito. Betty has a monkey. Robert a kind of likes insect\nMary has a durian. Patricia has a gun. Sandra has a wolf. Sandra a kind of likes animal\nPatricia has a steak. Thomas has a monkey. Donald has pink. Donald a kind of likes color\nChristopher has a piano. David has white. Donald has a banana. Christopher a kind of likes musical instrument\nMichelle has a baseball. Margaret has a hamburger. Mary has cake. Michelle a kind of likes sport\nSteven has a rabbit. Jeff has a piano. Dorothy has pink. Jeff a kind of likes musical instrument\nMichelle has a smartphone. Ruth has a hamburger. Joseph has a car. Michelle a kind of likes electronics\nKimberly has a lime. Dorothy has a wolf. Sarah has a football. Sarah a kind of likes sport\n", "\nDonna has pizza. Brian has a smartphone. Mary has a pear. Brian a kind of likes electronics\nCharles has a goose. Kenneth has whiskey. Maria has a laptop. Maria a kind of likes electronics\nKimberly has an apple. Jennifer has a pistol. Linda has a violin. Linda a kind of likes musical instrument\nMichael has a basketball. Christopher has a motorcycle. Linda has a violin. Christopher a kind of likes vehicle\nDeborah has a rabbit. Linda has pizza. Mark has a jacket. Mark a kind of likes clothing\nJohn has a smartphone. Joseph has cake. Michelle has a jacket. Joseph a kind of likes food\nSteven has an iPad. George has tea. Karen has a sweater. Steven a kind of likes electronics\nNancy has a shotgun. Kenneth has a phone. Deborah has a deer. Nancy a kind of likes weapon\nMichael has a beetle. Nancy has a tiger. Anthony has T-shirt. Michael a kind of likes insect\nKimberly has a piano. Michelle has a costume. Maria has a gun. Kimberly a kind of likes musical instrument\nNancy has a taxi. Steven has a revolver. Kevin has a car. Steven a kind of likes weapon\nMargaret has black. Christopher has juice. Patricia has a duck. Christopher a kind of likes drink\nMargaret has a handgun. Mark has a costume. Robert has soda. Margaret a kind of likes weapon\nDorothy has a horse. Lisa has a motorcycle. Margaret has a mango. Dorothy a kind of likes animal\nElizabeth has a rifle. Donald has a tiger. James has a piano. James a kind of likes musical instrument\nRichard has beer. William has a beetle. Jeff has a goat. Richard a kind of likes drink\n", "\nSharon has a pig. Barbara has a peach. Dorothy has a smartphone. Dorothy a kind of likes electronics\nDonald has a football. William has blackberries. Kenneth has blue. Donald a kind of likes sport\nSharon has a cocktail. Steven has spaghetti. Jennifer has an elephant. Steven a kind of likes food\nBrian has vodka. William has yellow. Donna has a smartphone. Donna a kind of likes electronics\nKaren has a monkey. James has jeans. Joseph has spaghetti. Karen a kind of likes animal\nEdward has a squirrel. John has a jacket. Richard has red. John a kind of likes clothing\nHelen has an elephant. Jason has a durian. Michael has a car. Jason a kind of likes fruit\nAnthony has a phone. Daniel has a bus. Dorothy has white. Daniel a kind of likes vehicle\nHelen has a beetle. Daniel has a goat. Dorothy has black. Helen a kind of likes insect\nGeorge has a rabbit. Nancy has whiskey. Maria has a motorcycle. Nancy a kind of likes drink\nGeorge has a cow. Christopher has a mosquito. Joseph has a banana. Christopher a kind of likes insect\nRonald has a banana. Jennifer has a costume. Mark has a horse. Jennifer a kind of likes clothing\nMichelle has a pig. William has a gun. Jason has vodka. Michelle a kind of likes animal\nHelen has a hamburger. Karen has a rabbit. Paul has grapes. Karen a kind of likes animal\nSharon has meat. Helen has a rifle. Dorothy has blue. Sharon a kind of likes food\nMichael has gray. Laura has a monkey. John has a car. John a kind of likes vehicle\n", "\nEdward has tea. Lisa has a bee. Michael has a phone. Lisa a kind of likes insect\nCarol has a jeep. Anthony has a bee. Ronald has an orange. Ronald a kind of likes fruit\nJason has a gun. Deborah has a pear. Sandra has a mouse. Deborah a kind of likes fruit\nJennifer has a burger. Brian has a lion. John has a shotgun. John a kind of likes weapon\nKenneth has a shotgun. James has a steak. Richard has wine. Richard a kind of likes drink\nRonald has black. Betty has a donkey. Michelle has a handgun. Ronald a kind of likes color\nDavid has a pear. Dorothy has vodka. Maria has a peach. Dorothy a kind of likes drink\nJason has a pig. Betty has sheep. Christopher has a sweater. Christopher a kind of likes clothing\nPaul has a violin. Margaret has a rifle. Linda has yellow. Paul a kind of likes musical instrument\nCharles has a plum. David has a taxi. Jeff has a goat. Jeff a kind of likes animal\nMichael has a smartphone. Edward has whiskey. Linda has a banana. Michael a kind of likes electronics\nDavid has yellow. Helen has an iPad. Karen has a revolver. Helen a kind of likes electronics\nSarah has coffee. John has a sweater. Michael has a duck. John a kind of likes clothing\nWilliam has trousers. Anthony has soda. David has a tiger. William a kind of likes clothing\nRobert has a banana. William has a basketball. Helen has a sweater. William a kind of likes sport\nElizabeth has a motorcycle. Helen has a smartphone. Jeff has tea. Jeff a kind of likes drink\n", "\nPaul has a phone. Carol has a violin. Sandra has white. Carol a kind of likes musical instrument\nDorothy has a lion. Donna has a banana. Ronald has underwear. Ronald a kind of likes clothing\nJeff has a hamburger. Ronald has a grenade. Christopher has pink. Christopher a kind of likes color\nPatricia has a phone. Charles has a guitar. Maria has whiskey. Maria a kind of likes drink\nKaren has a durian. George has a football. Kevin has a shirt. George a kind of likes sport\nPatricia has a pistol. Charles has a smartphone. Betty has a football. Patricia a kind of likes weapon\nPatricia has a cannon. Michelle has a laptop. Steven has a duck. Michelle a kind of likes electronics\nPatricia has a pistol. Thomas has grapes. Mark has a squirrel. Patricia a kind of likes weapon\nKimberly has meat. Betty has a pistol. Kenneth has a burger. Betty a kind of likes weapon\nLinda has an iPad. Kimberly has an apple. Thomas has pants. Thomas a kind of likes clothing\nKenneth has a football. Susan has whiskey. Helen has a plum. Kenneth a kind of likes sport\nCarol has a jacket. Edward has gray. Brian has a car. Brian a kind of likes vehicle\nJason has bread. Donna has cherries. Ruth has beer. Ruth a kind of likes drink\nJohn has a duck. Maria has spaghetti. Elizabeth has white. Elizabeth a kind of likes color\nKenneth has a rifle. Maria has a beetle. Barbara has a cocktail. Maria a kind of likes insect\nDorothy has a football. James has a bus. William has a costume. Dorothy a kind of likes sport\n", "\nDonna has tea. Michelle has pink. David has a rifle. David a kind of likes weapon\nRuth has a mosquito. Steven has trousers. Barbara has a peach. Barbara a kind of likes fruit\nElizabeth has whiskey. John has a tiger. Christopher has a bus. Elizabeth a kind of likes drink\nLisa has red. Sandra has a football. William has a duck. Sandra a kind of likes sport\nEdward has juice. Kimberly has a hamburger. Donald has a cannon. Donald a kind of likes weapon\nLinda has a motorcycle. Jason has soda. Kenneth has a baseball. Kenneth a kind of likes sport\nLinda has a peach. Susan has a shotgun. James has cake. James a kind of likes food\nPaul has a motorcycle. Sarah has a sweater. Daniel has blue. Sarah a kind of likes clothing\nHelen has underwear. Joseph has red. Paul has a uniform. Joseph a kind of likes color\nMichelle has purple. Paul has a guitar. Nancy has a squirrel. Paul a kind of likes musical instrument\nJames has red. Michael has a piano. Joseph has a laptop. James a kind of likes color\nSusan has a papaya. Donald has a baseball. Nancy has a cat. Donald a kind of likes sport\nDavid has a cow. Dorothy has an iPad. Nancy has blue. Dorothy a kind of likes electronics\nKevin has a cannon. Brian has a motorcycle. Carol has a pig. Brian a kind of likes vehicle\nKimberly has purple. Betty has a jeep. Sarah has a banana. Betty a kind of likes vehicle\nKevin has a hamburger. Ronald has an orange. Michael has a costume. Kevin a kind of likes food\n", "\nWilliam has a phone. Sharon has a handgun. Michelle has a bus. William a kind of likes electronics\nJennifer has cake. Ronald has a lime. John has a jersey. Jennifer a kind of likes food\nJeff has a dog. Mark has beer. Sharon has a deer. Mark a kind of likes drink\nRichard has a lion. Jennifer has a horse. Steven has a motorcycle. Steven a kind of likes vehicle\nJohn has a piano. Betty has a watermelon. Sarah has meat. Sarah a kind of likes food\nRuth has a durian. David has a motorcycle. Brian has blue. David a kind of likes vehicle\nKaren has pink. Sharon has a lemon. Margaret has a car. Karen a kind of likes color\nJennifer has jeans. Anthony has wine. Jason has a watermelon. Jennifer a kind of likes clothing\nSharon has an iPad. James has blue. Jason has a duck. Sharon a kind of likes electronics\nMary has pizza. Dorothy has a pistol. Robert has a cat. Mary a kind of likes food\nCharles has a bee. Ronald has a football. Jennifer has a papaya. Jennifer a kind of likes fruit\nRonald has pizza. Linda has a deer. David has a mango. David a kind of likes fruit\nNancy has soda. Kevin has black. Anthony has a cannon. Anthony a kind of likes weapon\nGeorge has pizza. John has a goose. Jennifer has juice. George a kind of likes food\nPaul has underwear. Michael has a taxi. Patricia has an apricot. Michael a kind of likes vehicle\nHelen has white. Joseph has a uniform. Patricia has a peach. Helen a kind of likes color\n", "\nMark has a motorcycle. William has a hamburger. Robert has a donkey. William a kind of likes food\nJohn has a lime. Michael has a pig. Nancy has a violin. Michael a kind of likes animal\nHelen has underwear. Michelle has whiskey. William has a violin. William a kind of likes musical instrument\nEdward has wine. Elizabeth has an iPad. Linda has yellow. Elizabeth a kind of likes electronics\nJason has a jacket. Michelle has a guitar. Ronald has a car. Ronald a kind of likes vehicle\nDeborah has spaghetti. Dorothy has a squirrel. William has a car. Deborah a kind of likes food\nLaura has a cow. Ruth has cherries. Daniel has beer. Daniel a kind of likes drink\nNancy has a basketball. Ruth has a jacket. Christopher has yellow. Christopher a kind of likes color\nGeorge has a durian. John has white. Margaret has pants. John a kind of likes color\nSteven has meat. Richard has a mosquito. Helen has underwear. Steven a kind of likes food\nHelen has a guitar. Barbara has pizza. Susan has a rabbit. Helen a kind of likes musical instrument\nNancy has gray. Ruth has tea. Robert has soda. Nancy a kind of likes color\nLaura has vodka. Carol has a uniform. Susan has blueberries. Carol a kind of likes clothing\nCarol has a plum. Edward has a kiwi. Dorothy has a gun. Dorothy a kind of likes weapon\nLinda has beer. Christopher has cake. Richard has strawberries. Linda a kind of likes drink\nKevin has a costume. Karen has a pistol. John has a jeep. John a kind of likes vehicle\n", "\nBrian has a phone. Donald has a violin. John has a plum. John a kind of likes fruit\nLinda has a squirrel. Donna has a uniform. William has a plum. Donna a kind of likes clothing\nJennifer has a motorcycle. Kevin has black. Jason has a shotgun. Kevin a kind of likes color\nElizabeth has a pistol. Kenneth has a hamburger. Mary has a jacket. Mary a kind of likes clothing\nMark has a basketball. Kimberly has vodka. Thomas has pizza. Mark a kind of likes sport\nCarol has an iPad. Jason has a steak. Robert has a donkey. Carol a kind of likes electronics\nAnthony has an iPad. Sharon has a goose. Daniel has a watermelon. Anthony a kind of likes electronics\nThomas has strawberries. Patricia has a jersey. Steven has blue. Patricia a kind of likes clothing\nJeff has pizza. Robert has black. Joseph has a horse. Jeff a kind of likes food\nDavid has a smartphone. Betty has a steak. Richard has pink. Betty a kind of likes food\nPatricia has blue. Donna has coffee. Charles has pizza. Charles a kind of likes food\nBarbara has a bus. Donald has sheep. Ruth has pants. Ruth a kind of likes clothing\nDonald has white. Jennifer has a jacket. Kevin has a violin. Kevin a kind of likes musical instrument\nThomas has a bee. Lisa has bread. Sarah has a motorcycle. Lisa a kind of likes food\nBetty has trousers. Karen has a wolf. Lisa has a kiwi. Lisa a kind of likes fruit\nSharon has wine. Jennifer has a rabbit. Jason has a deer. Sharon a kind of likes drink\n", "\nCarol has a mouse. Jennifer has blue. Jason has an iPad. Jason a kind of likes electronics\nSteven has coffee. Sandra has a violin. Karen has a basketball. Steven a kind of likes drink\nCharles has an iPad. William has a lime. Michelle has a rabbit. William a kind of likes fruit\nJohn has a football. Anthony has spaghetti. Carol has red. John a kind of likes sport\nThomas has a pig. Kimberly has wine. Paul has a bee. Paul a kind of likes insect\nGeorge has a mango. Susan has a lion. Ronald has a hamburger. George a kind of likes fruit\nElizabeth has a football. Jeff has a fox. Mary has a shotgun. Elizabeth a kind of likes sport\nRuth has a gorilla. Kenneth has a motorcycle. Anthony has an apple. Anthony a kind of likes fruit\nElizabeth has blue. Margaret has a motorcycle. Michelle has pizza. Margaret a kind of likes vehicle\nJames has bread. Sarah has a durian. Charles has a guitar. Charles a kind of likes musical instrument\nKaren has red. Daniel has a papaya. Elizabeth has a cocktail. Elizabeth a kind of likes drink\nBarbara has gray. Kimberly has a goose. Margaret has a shotgun. Barbara a kind of likes color\nEdward has strawberries. Jennifer has a guitar. Robert has sheep. Jennifer a kind of likes musical instrument\nSarah has a grenade. Betty has a car. Sharon has a deer. Betty a kind of likes vehicle\nJoseph has a uniform. Sarah has an iPad. Mark has a mosquito. Sarah a kind of likes electronics\nCharles has a squirrel. Joseph has cherries. Nancy has an iPad. Joseph a kind of likes fruit\n", "\nHelen has a horse. Barbara has a motorcycle. Betty has a phone. Betty a kind of likes electronics\nJason has a cocktail. Maria has a costume. Michelle has a bee. Michelle a kind of likes insect\nJames has a kiwi. Mary has a cannon. Michelle has a baseball. James a kind of likes fruit\nJoseph has a mango. Mark has a baseball. Betty has a costume. Mark a kind of likes sport\nJames has a rabbit. Kimberly has black. William has a mosquito. William a kind of likes insect\nChristopher has a beetle. David has a taxi. Joseph has an iPad. Joseph a kind of likes electronics\nJeff has a cannon. Elizabeth has a tiger. Daniel has underwear. Jeff a kind of likes weapon\nEdward has strawberries. Joseph has a beetle. Ronald has sheep. Joseph a kind of likes insect\nMaria has cherries. Mary has a mosquito. Barbara has shoes. Maria a kind of likes fruit\nRichard has a wolf. Ronald has a lime. Karen has a guitar. Richard a kind of likes animal\nElizabeth has a pistol. Mark has a uniform. Donald has a rifle. Mark a kind of likes clothing\nJames has coffee. Jeff has pants. Laura has a phone. Laura a kind of likes electronics\nBrian has a cocktail. John has a donkey. Patricia has a gun. Brian a kind of likes drink\nJohn has a lion. Richard has tea. Nancy has grapes. Richard a kind of likes drink\nMaria has a plum. Linda has a grenade. Laura has a cat. Laura a kind of likes animal\nKimberly has a gorilla. Margaret has a banana. Laura has a motorcycle. Margaret a kind of likes fruit\n"], "bos": [[[19, 20], [39, 40], [61, 62], [82, 83], [105, 106], [129, 130], [152, 153], [172, 173], [195, 196], [217, 218], [240, 241], [263, 264], [285, 286], [308, 309], [329, 330], [351, 352]], [[18, 19], [40, 41], [63, 64], [83, 84], [105, 106], [126, 127], [148, 149], [171, 172], [193, 194], [214, 215], [234, 235], [257, 258], [278, 279], [298, 299], [320, 321], [342, 343]], [[20, 21], [41, 42], [62, 63], [84, 85], [105, 106], [126, 127], [147, 148], [168, 169], [193, 194], [214, 215], [238, 239], [258, 259], [281, 282], [302, 303], [324, 325], [344, 345]], [[19, 20], [41, 42], [62, 63], [83, 84], [104, 105], [127, 128], [148, 149], [171, 172], [193, 194], [215, 216], [236, 237], [258, 259], [281, 282], [302, 303], [324, 325], [346, 347]], [[20, 21], [40, 41], [60, 61], [83, 84], [104, 105], [127, 128], [150, 151], [171, 172], [193, 194], [216, 217], [239, 240], [263, 264], [287, 288], [308, 309], [330, 331], [352, 353]], [[19, 20], [41, 42], [62, 63], [81, 82], [104, 105], [127, 128], [150, 151], [170, 171], [193, 194], [216, 217], [238, 239], [259, 260], [282, 283], [303, 304], [327, 328], [351, 352]], [[20, 21], [41, 42], [65, 66], [88, 89], [110, 111], [131, 132], [152, 153], [175, 176], [198, 199], [222, 223], [246, 247], [267, 268], [289, 290], [313, 314], [335, 336], [357, 358]], [[21, 22], [42, 43], [64, 65], [84, 85], [105, 106], [126, 127], [150, 151], [171, 172], [193, 194], [214, 215], [236, 237], [259, 260], [280, 281], [303, 304], [324, 325], [345, 346]], [[19, 20], [43, 44], [65, 66], [87, 88], [109, 110], [131, 132], [152, 153], [173, 174], [194, 195], [217, 218], [238, 239], [259, 260], [280, 281], [300, 301], [322, 323], [343, 344]], [[19, 20], [43, 44], [65, 66], [87, 88], [111, 112], [134, 135], [157, 158], [179, 180], [202, 203], [224, 225], [246, 247], [268, 269], [288, 289], [308, 309], [331, 332], [355, 356]], [[19, 20], [41, 42], [62, 63], [83, 84], [105, 106], [127, 128], [149, 150], [170, 171], [191, 192], [212, 213], [234, 235], [257, 258], [278, 279], [300, 301], [324, 325], [347, 348]], [[20, 21], [41, 42], [62, 63], [84, 85], [106, 107], [129, 130], [151, 152], [172, 173], [194, 195], [215, 216], [238, 239], [260, 261], [281, 282], [301, 302], [324, 325], [346, 347]], [[21, 22], [43, 44], [64, 65], [85, 86], [107, 108], [129, 130], [150, 151], [172, 173], [193, 194], [213, 214], [235, 236], [256, 257], [277, 278], [302, 303], [322, 323], [345, 346]], [[20, 21], [43, 44], [64, 65], [87, 88], [107, 108], [130, 131], [153, 154], [173, 174], [193, 194], [214, 215], [234, 235], [255, 256], [276, 277], [298, 299], [322, 323], [344, 345]], [[20, 21], [41, 42], [63, 64], [83, 84], [104, 105], [127, 128], [149, 150], [172, 173], [192, 193], [214, 215], [238, 239], [260, 261], [280, 281], [303, 304], [325, 326], [347, 348]], [[21, 22], [43, 44], [67, 68], [89, 90], [110, 111], [132, 133], [153, 154], [173, 174], [194, 195], [216, 217], [238, 239], [258, 259], [280, 281], [300, 301], [322, 323], [346, 347]]], "input_ids": [[[198, 11006, 468, 257, 19132, 13, 26918, 468, 257, 22746, 13, 16685, 468, 8509, 13, 16685, 257, 1611, 286, 7832, 2057, 198, 7554, 468, 257, 10047, 13, 29216, 468, 7872, 13, 3899, 468, 10012, 13, 1757, 257, 1611, 286, 7832, 10530, 8875, 198, 50, 15918, 468, 257, 22746, 13, 10674, 468, 8509, 13, 3700, 468, 8237, 13, 3700, 257, 1611, 286, 7832, 4144, 198, 38025, 468, 4171, 13, 3759, 468, 257, 35446, 13, 22695, 468, 257, 45540, 13, 3759, 257, 1611, 286, 7832, 12833, 198, 38025, 468, 257, 45489, 13, 6219, 468, 309, 12, 15600, 13, 8982, 468, 257, 2485, 13, 12803, 257, 1611, 286, 7832, 12833, 198, 26374, 527, 306, 468, 257, 10211, 13, 8239, 468, 257, 8187, 13, 10674, 468, 2042, 20853, 13, 8239, 257, 1611, 286, 7832, 9528, 198, 49, 1071, 468, 257, 45489, 13, 4502, 468, 257, 26917, 13, 7939, 468, 257, 47565, 13, 22132, 257, 1611, 286, 7832, 12833, 198, 29458, 468, 36973, 13, 5335, 468, 257, 10047, 13, 9953, 468, 2266, 13, 5335, 257, 1611, 286, 7832, 10530, 8875, 198, 39324, 2788, 468, 6099, 13, 36976, 468, 257, 40968, 13, 1757, 468, 281, 13133, 13, 23632, 257, 1611, 286, 7832, 4144, 198, 14731, 468, 257, 45540, 13, 29216, 468, 257, 9669, 13, 14919, 468, 281, 20950, 13, 29216, 257, 1611, 286, 7832, 6332, 198, 16587, 40844, 468, 257, 26168, 13, 40349, 468, 257, 9669, 13, 18496, 468, 257, 17536, 13, 40349, 257, 1611, 286, 7832, 6332, 198, 29284, 468, 257, 17849, 13, 16753, 468, 4171, 20853, 13, 3977, 468, 257, 41478, 32650, 13, 16753, 257, 1611, 286, 7832, 8234, 198, 23672, 1940, 468, 4171, 13, 36976, 468, 281, 17180, 13, 1757, 468, 257, 9669, 13, 1757, 257, 1611, 286, 7832, 6332, 198, 13056, 774, 468, 2042, 20853, 13, 10674, 468, 257, 35685, 13, 5335, 468, 257, 17481, 13, 10674, 257, 1611, 286, 7832, 9528, 198, 23865, 468, 257, 18873, 13, 18678, 468, 257, 10047, 13, 5074, 468, 15900, 13, 18678, 257, 1611, 286, 7832, 10530, 8875, 198, 45, 3883, 468, 21029, 13, 22132, 468, 11398, 13, 2940, 468, 257, 10047, 13, 18496, 257, 1611, 286, 7832, 9528, 198]], [[198, 43568, 468, 2266, 13, 7806, 468, 8237, 13, 14430, 468, 257, 13224, 13, 14430, 257, 1611, 286, 7832, 17075, 198, 14731, 468, 257, 9669, 13, 18496, 468, 257, 35685, 13, 7806, 468, 257, 33039, 13, 3700, 257, 1611, 286, 7832, 6332, 198, 29284, 468, 257, 26593, 13, 16738, 468, 257, 20461, 11729, 13, 15378, 468, 257, 21202, 13, 10490, 257, 1611, 286, 7832, 2057, 198, 45, 3883, 468, 36973, 13, 5658, 468, 12187, 13, 3977, 468, 6099, 13, 5658, 257, 1611, 286, 7832, 2057, 198, 7554, 468, 257, 9669, 13, 3899, 468, 257, 18607, 13, 29216, 468, 257, 15224, 13, 29216, 257, 1611, 286, 7832, 9528, 198, 43982, 468, 257, 9283, 13, 16348, 468, 20584, 13, 10674, 468, 257, 18607, 13, 10443, 257, 1611, 286, 7832, 6332, 198, 26497, 468, 257, 17481, 13, 2940, 468, 257, 18607, 13, 3759, 468, 257, 47565, 13, 3759, 257, 1611, 286, 7832, 8234, 198, 22245, 468, 257, 479, 14246, 72, 13, 3362, 468, 257, 37246, 13, 2940, 468, 2266, 13, 2940, 257, 1611, 286, 7832, 3124, 198, 39324, 2788, 468, 257, 17536, 13, 21776, 468, 257, 45314, 13, 10674, 468, 48241, 13, 21776, 257, 1611, 286, 7832, 5044, 198, 39324, 2788, 468, 21029, 13, 14200, 468, 11398, 13, 4502, 468, 257, 1097, 13, 4502, 257, 1611, 286, 7832, 4038, 198, 45842, 468, 257, 26320, 13, 1757, 468, 10012, 13, 23632, 468, 48241, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 16587, 40844, 468, 257, 10211, 13, 8239, 468, 257, 49364, 13, 10490, 468, 257, 4346, 13, 10490, 257, 1611, 286, 7832, 6332, 198, 29284, 468, 257, 11223, 538, 13, 16348, 468, 15900, 13, 10674, 468, 48241, 13, 16348, 257, 1611, 286, 7832, 5044, 198, 23865, 468, 281, 17180, 13, 15378, 468, 6891, 13, 21776, 468, 15900, 13, 15378, 257, 1611, 286, 7832, 4144, 198, 48736, 468, 257, 1097, 13, 10674, 468, 257, 45489, 13, 5335, 468, 257, 50085, 13, 16738, 257, 1611, 286, 7832, 4038, 198, 11006, 468, 257, 13224, 13, 3899, 468, 257, 9283, 13, 48685, 468, 257, 9669, 13, 3271, 257, 1611, 286, 7832, 17075, 198]], [[198, 45842, 468, 257, 22383, 13, 3977, 468, 257, 12967, 13, 23632, 468, 257, 24554, 13, 23632, 257, 1611, 286, 7832, 4144, 198, 28292, 468, 257, 33039, 13, 8982, 468, 8509, 13, 3759, 468, 257, 26241, 13, 8982, 257, 1611, 286, 7832, 2057, 198, 39324, 2788, 468, 37191, 13, 10490, 468, 257, 3072, 13, 29504, 468, 6099, 13, 29504, 257, 1611, 286, 7832, 4144, 198, 24761, 468, 6174, 13, 16738, 468, 281, 46593, 291, 313, 13, 16685, 468, 2266, 13, 8403, 257, 1611, 286, 7832, 2057, 198, 19139, 468, 4171, 20853, 13, 16738, 468, 8509, 13, 29216, 468, 257, 8223, 13, 16738, 257, 1611, 286, 7832, 2057, 198, 43568, 468, 257, 18757, 13, 1757, 468, 12187, 13, 10443, 468, 257, 45314, 13, 10674, 257, 1611, 286, 7832, 4038, 198, 43187, 468, 257, 22802, 13, 14430, 468, 20584, 13, 3271, 468, 257, 35446, 13, 3271, 257, 1611, 286, 7832, 12833, 198, 26497, 468, 257, 1097, 13, 12803, 468, 48241, 13, 9953, 468, 257, 38283, 13, 9953, 257, 1611, 286, 7832, 10530, 8875, 198, 28292, 468, 257, 11575, 13, 22695, 468, 257, 17481, 13, 14919, 468, 257, 479, 14246, 72, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 29284, 468, 14256, 13, 18496, 468, 257, 45540, 13, 14430, 468, 257, 19132, 13, 14430, 257, 1611, 286, 7832, 10530, 8875, 198, 19139, 468, 309, 12, 15600, 13, 7516, 468, 257, 45489, 13, 16753, 468, 257, 50085, 13, 7516, 257, 1611, 286, 7832, 12833, 198, 7371, 468, 8887, 13, 8403, 468, 14256, 13, 3899, 468, 257, 1097, 13, 3759, 257, 1611, 286, 7832, 4144, 198, 10374, 39389, 468, 257, 9875, 13, 7516, 468, 257, 45540, 13, 48685, 468, 257, 38283, 13, 48685, 257, 1611, 286, 7832, 10530, 8875, 198, 17121, 468, 257, 10211, 13, 29216, 468, 29219, 13, 16348, 468, 48241, 13, 3977, 257, 1611, 286, 7832, 5044, 198, 9704, 468, 257, 45489, 13, 5502, 468, 257, 25286, 13, 32464, 468, 257, 40968, 13, 2940, 257, 1611, 286, 7832, 12833, 198, 7554, 468, 2042, 13, 32464, 468, 8887, 13, 6219, 468, 257, 3797, 13, 1757, 257, 1611, 286, 7832, 3124, 198]], [[198, 22245, 468, 2330, 13, 9953, 468, 257, 26593, 13, 2940, 468, 257, 8223, 13, 6219, 257, 1611, 286, 7832, 3124, 198, 3987, 2616, 468, 257, 17849, 13, 16738, 468, 257, 26320, 13, 14430, 468, 6891, 13, 14430, 257, 1611, 286, 7832, 4144, 198, 45, 3883, 468, 7872, 13, 5074, 468, 36279, 13, 12803, 468, 257, 35446, 13, 5074, 257, 1611, 286, 7832, 4144, 198, 43187, 468, 257, 16790, 13, 5199, 468, 2266, 13, 3977, 468, 257, 22383, 13, 3977, 257, 1611, 286, 7832, 9528, 198, 22405, 468, 257, 11745, 13, 15378, 468, 36973, 13, 5074, 468, 257, 10147, 13, 5658, 257, 1611, 286, 7832, 17075, 198, 26374, 527, 306, 468, 257, 3290, 13, 5199, 468, 257, 13224, 13, 9953, 468, 36656, 13, 5199, 257, 1611, 286, 7832, 17075, 198, 43187, 468, 257, 19132, 13, 15378, 468, 2330, 13, 29216, 468, 281, 10912, 13, 16348, 257, 1611, 286, 7832, 10530, 8875, 198, 12130, 26654, 468, 12581, 13, 21776, 468, 257, 18757, 13, 3977, 468, 257, 9283, 13, 3977, 257, 1611, 286, 7832, 6332, 198, 9704, 468, 257, 10047, 13, 7939, 468, 257, 16790, 13, 3977, 468, 257, 28738, 13, 2940, 257, 1611, 286, 7832, 10530, 8875, 198, 43982, 468, 2266, 13, 48685, 468, 257, 50085, 13, 18678, 468, 257, 45540, 13, 10443, 257, 1611, 286, 7832, 3124, 198, 2484, 8045, 468, 4077, 13, 30223, 468, 257, 9283, 13, 19579, 468, 12581, 13, 19579, 257, 1611, 286, 7832, 9528, 198, 49, 1071, 468, 11398, 13, 3899, 468, 257, 18744, 13, 16753, 468, 257, 40968, 13, 3899, 257, 1611, 286, 7832, 5044, 198, 44203, 468, 281, 13133, 13, 3700, 468, 257, 4346, 13, 29504, 468, 257, 1660, 45690, 13, 3700, 257, 1611, 286, 7832, 6332, 198, 45842, 468, 257, 9875, 13, 19579, 468, 257, 25996, 13, 36976, 468, 20584, 13, 36976, 257, 1611, 286, 7832, 4144, 198, 38025, 468, 257, 21202, 13, 3977, 468, 257, 35685, 13, 18678, 468, 257, 20697, 13, 12803, 257, 1611, 286, 7832, 4282, 198, 7371, 468, 257, 25286, 13, 2940, 468, 257, 9669, 13, 7806, 468, 257, 22383, 13, 2940, 257, 1611, 286, 7832, 6332, 198]], [[198, 22405, 468, 257, 38283, 13, 30223, 468, 257, 26593, 13, 8982, 468, 257, 10047, 13, 30223, 257, 1611, 286, 7832, 2057, 198, 24119, 468, 257, 18757, 13, 3977, 468, 29219, 13, 14919, 468, 37191, 13, 5335, 257, 1611, 286, 7832, 4038, 198, 46827, 468, 257, 50085, 13, 22695, 468, 8509, 13, 16738, 468, 4077, 13, 16738, 257, 1611, 286, 7832, 3124, 198, 43, 22261, 468, 257, 26320, 13, 9953, 468, 2042, 20853, 13, 10443, 468, 257, 1323, 13, 21776, 257, 1611, 286, 7832, 2057, 198, 48736, 468, 4077, 13, 5199, 468, 257, 25286, 13, 40349, 468, 257, 24554, 13, 40349, 257, 1611, 286, 7832, 4144, 198, 39324, 2788, 468, 257, 47565, 13, 16348, 468, 257, 37246, 13, 26918, 468, 257, 19132, 13, 26918, 257, 1611, 286, 7832, 10530, 8875, 198, 13056, 774, 468, 257, 20096, 13, 3271, 468, 257, 26320, 13, 3700, 468, 10012, 13, 29504, 257, 1611, 286, 7832, 5044, 198, 28711, 468, 14256, 13, 16753, 468, 257, 22365, 666, 13, 6219, 468, 29219, 13, 7516, 257, 1611, 286, 7832, 2057, 198, 48736, 468, 257, 9283, 13, 7939, 468, 257, 9875, 13, 10674, 468, 257, 3072, 13, 16738, 257, 1611, 286, 7832, 6332, 198, 20191, 468, 257, 35446, 13, 21776, 468, 257, 1660, 45690, 13, 19579, 468, 257, 19132, 13, 21776, 257, 1611, 286, 7832, 8234, 198, 42, 5757, 468, 257, 35685, 13, 7939, 468, 257, 3290, 13, 10674, 468, 257, 26320, 13, 7939, 257, 1611, 286, 7832, 5044, 198, 35, 273, 14863, 468, 257, 49364, 13, 8239, 468, 257, 18607, 13, 36976, 468, 257, 1323, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 2484, 8045, 468, 257, 26241, 13, 48685, 468, 257, 22365, 666, 13, 18496, 468, 257, 24554, 13, 48685, 257, 1611, 286, 7832, 8234, 198, 10374, 39389, 468, 10012, 13, 32464, 468, 12187, 13, 14200, 468, 257, 25286, 13, 16685, 257, 1611, 286, 7832, 9528, 198, 43982, 468, 257, 8187, 13, 3899, 468, 257, 10047, 13, 1757, 468, 257, 33039, 13, 3899, 257, 1611, 286, 7832, 10530, 8875, 198, 7554, 468, 21382, 1678, 13, 3977, 468, 257, 12967, 13, 16738, 468, 6099, 13, 1757, 257, 1611, 286, 7832, 8234, 198]], [[198, 7554, 468, 257, 45540, 13, 6219, 468, 257, 35446, 13, 8403, 468, 8509, 13, 6219, 257, 1611, 286, 7832, 12833, 198, 19139, 468, 4077, 13, 48685, 468, 257, 22365, 666, 13, 14919, 468, 257, 16790, 13, 14919, 257, 1611, 286, 7832, 4282, 198, 46827, 468, 37191, 13, 2940, 468, 257, 11575, 13, 3977, 468, 257, 9669, 13, 2940, 257, 1611, 286, 7832, 4282, 198, 43187, 468, 12187, 13, 23632, 468, 11398, 13, 3700, 468, 6891, 13, 23632, 257, 1611, 286, 7832, 3124, 198, 12130, 26654, 468, 257, 10047, 13, 5335, 468, 257, 16790, 13, 7516, 468, 257, 17536, 13, 30223, 257, 1611, 286, 7832, 10530, 8875, 198, 24119, 468, 257, 9283, 13, 18678, 468, 257, 16569, 13, 7806, 468, 257, 18744, 13, 5335, 257, 1611, 286, 7832, 6332, 198, 49, 1071, 468, 4171, 20853, 13, 48685, 468, 257, 9669, 13, 16348, 468, 257, 49364, 13, 48685, 257, 1611, 286, 7832, 6332, 198, 24119, 468, 257, 35685, 13, 5074, 468, 21029, 13, 32464, 468, 12768, 13, 32464, 257, 1611, 286, 7832, 3124, 198, 42, 5757, 468, 257, 37246, 13, 5199, 468, 257, 35446, 13, 29504, 468, 257, 21657, 13, 5199, 257, 1611, 286, 7832, 12833, 198, 24119, 468, 257, 22365, 666, 13, 30223, 468, 257, 2485, 13, 32464, 468, 257, 17481, 13, 32464, 257, 1611, 286, 7832, 5044, 198, 12130, 26654, 468, 257, 26320, 13, 5658, 468, 257, 21657, 13, 3759, 468, 11398, 13, 3759, 257, 1611, 286, 7832, 3124, 198, 38025, 468, 257, 19132, 13, 3271, 468, 2330, 13, 3759, 468, 257, 25996, 13, 12803, 257, 1611, 286, 7832, 10530, 8875, 198, 48736, 468, 257, 9283, 13, 19579, 468, 257, 41478, 32650, 13, 5335, 468, 12187, 13, 16738, 257, 1611, 286, 7832, 6332, 198, 28292, 468, 257, 22746, 13, 5502, 468, 257, 19132, 13, 40349, 468, 11398, 13, 5502, 257, 1611, 286, 7832, 10530, 8875, 198, 48736, 468, 257, 11745, 13, 22132, 468, 257, 41478, 32650, 13, 7212, 468, 257, 1097, 13, 16738, 257, 1611, 286, 7832, 17075, 198, 26374, 527, 306, 468, 257, 28738, 13, 40349, 468, 257, 17481, 13, 10490, 468, 257, 4346, 13, 10490, 257, 1611, 286, 7832, 6332, 198]], [[198, 3987, 2616, 468, 14256, 13, 8403, 468, 257, 11745, 13, 5335, 468, 257, 25286, 13, 8403, 257, 1611, 286, 7832, 17075, 198, 28711, 468, 257, 37246, 13, 23632, 468, 29219, 13, 14200, 468, 257, 13224, 13, 14200, 257, 1611, 286, 7832, 17075, 198, 26374, 527, 306, 468, 281, 17180, 13, 16348, 468, 257, 16790, 13, 21776, 468, 257, 38283, 13, 21776, 257, 1611, 286, 7832, 10530, 8875, 198, 13256, 468, 257, 9669, 13, 12803, 468, 257, 18757, 13, 21776, 468, 257, 38283, 13, 12803, 257, 1611, 286, 7832, 4038, 198, 16587, 40844, 468, 257, 22746, 13, 21776, 468, 14256, 13, 2940, 468, 257, 15224, 13, 2940, 257, 1611, 286, 7832, 9528, 198, 7554, 468, 257, 11745, 13, 7212, 468, 12187, 13, 16738, 468, 257, 15224, 13, 7212, 257, 1611, 286, 7832, 2057, 198, 28292, 468, 281, 13133, 13, 4502, 468, 8887, 13, 18678, 468, 257, 35685, 13, 8239, 257, 1611, 286, 7832, 17075, 198, 45, 3883, 468, 257, 18607, 13, 23632, 468, 257, 3072, 13, 36976, 468, 257, 20096, 13, 18496, 257, 1611, 286, 7832, 4282, 198, 13256, 468, 257, 45489, 13, 18496, 468, 257, 26241, 13, 9953, 468, 309, 12, 15600, 13, 3899, 257, 1611, 286, 7832, 12833, 198, 26374, 527, 306, 468, 257, 19132, 13, 16738, 468, 257, 16569, 13, 14200, 468, 257, 2485, 13, 48685, 257, 1611, 286, 7832, 10530, 8875, 198, 45, 3883, 468, 257, 17536, 13, 8239, 468, 257, 40968, 13, 7939, 468, 257, 1097, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 24428, 8984, 468, 2042, 13, 12803, 468, 13135, 13, 30223, 468, 257, 22045, 13, 12803, 257, 1611, 286, 7832, 4144, 198, 24428, 8984, 468, 257, 17849, 13, 2940, 468, 257, 16569, 13, 5199, 468, 20584, 13, 19579, 257, 1611, 286, 7832, 4282, 198, 35, 273, 14863, 468, 257, 8223, 13, 15378, 468, 257, 18757, 13, 19579, 468, 257, 49364, 13, 40349, 257, 1611, 286, 7832, 5044, 198, 43568, 468, 257, 11575, 13, 3759, 468, 257, 26241, 13, 3700, 468, 257, 19132, 13, 3700, 257, 1611, 286, 7832, 10530, 8875, 198, 22245, 468, 6099, 13, 3977, 468, 257, 45489, 13, 5502, 468, 257, 26917, 13, 6219, 257, 1611, 286, 7832, 4144, 198]], [[198, 2484, 8045, 468, 257, 12967, 13, 16685, 468, 257, 47565, 13, 40349, 468, 257, 11745, 13, 40349, 257, 1611, 286, 7832, 17075, 198, 7371, 468, 257, 4346, 13, 3977, 468, 2042, 20853, 13, 23632, 468, 4171, 13, 3759, 257, 1611, 286, 7832, 6332, 198, 2484, 8045, 468, 257, 24554, 13, 8239, 468, 48241, 13, 16348, 468, 281, 20950, 13, 8239, 257, 1611, 286, 7832, 2057, 198, 24761, 468, 36279, 13, 3977, 468, 7872, 13, 29216, 468, 257, 11745, 13, 29216, 257, 1611, 286, 7832, 17075, 198, 42, 5757, 468, 257, 21657, 13, 3700, 468, 21029, 13, 7212, 468, 48241, 13, 18678, 257, 1611, 286, 7832, 5044, 198, 43982, 468, 257, 33039, 13, 1757, 468, 257, 15224, 13, 6219, 468, 2266, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 12621, 268, 468, 281, 20950, 13, 8982, 468, 257, 22365, 666, 13, 3899, 468, 257, 1097, 13, 8982, 257, 1611, 286, 7832, 8234, 198, 32697, 468, 257, 3072, 13, 7806, 468, 257, 1323, 13, 40349, 468, 2330, 13, 7806, 257, 1611, 286, 7832, 4038, 198, 12621, 268, 468, 257, 45489, 13, 7806, 468, 257, 26917, 13, 40349, 468, 2042, 13, 22695, 257, 1611, 286, 7832, 12833, 198, 20191, 468, 257, 22746, 13, 18496, 468, 29219, 13, 14200, 468, 257, 18757, 13, 18496, 257, 1611, 286, 7832, 4144, 198, 20191, 468, 257, 9875, 13, 12803, 468, 257, 35446, 13, 7212, 468, 257, 25996, 13, 12803, 257, 1611, 286, 7832, 12833, 198, 23672, 1940, 468, 257, 25996, 13, 16348, 468, 257, 16569, 13, 2940, 468, 257, 8223, 13, 16348, 257, 1611, 286, 7832, 9528, 198, 48736, 468, 257, 12967, 13, 3977, 468, 257, 2485, 13, 8982, 468, 36279, 13, 16738, 257, 1611, 286, 7832, 5044, 198, 12621, 268, 468, 257, 41478, 32650, 13, 18678, 468, 257, 22746, 13, 3362, 468, 36656, 13, 18678, 257, 1611, 286, 7832, 5044, 198, 2484, 8045, 468, 6174, 13, 22695, 468, 257, 11575, 13, 40349, 468, 4171, 13, 26918, 257, 1611, 286, 7832, 2057, 198, 13256, 468, 12768, 13, 16753, 468, 257, 21657, 13, 1757, 468, 257, 1097, 13, 1757, 257, 1611, 286, 7832, 4038, 198]], [[198, 43982, 468, 8887, 13, 15378, 468, 257, 20697, 13, 3899, 468, 257, 3072, 13, 15378, 257, 1611, 286, 7832, 12833, 198, 9914, 349, 468, 257, 11223, 538, 13, 9953, 468, 257, 20697, 13, 14430, 468, 281, 10912, 13, 14430, 257, 1611, 286, 7832, 8234, 198, 26497, 468, 257, 2485, 13, 36976, 468, 257, 25286, 13, 32464, 468, 257, 10211, 13, 36976, 257, 1611, 286, 7832, 8234, 198, 43187, 468, 257, 26593, 13, 8403, 468, 257, 18744, 13, 1757, 468, 257, 18607, 13, 1757, 257, 1611, 286, 7832, 4282, 198, 39324, 2788, 468, 257, 18607, 13, 3700, 468, 257, 26320, 13, 6219, 468, 8237, 13, 6219, 257, 1611, 286, 7832, 4144, 198, 23672, 1940, 468, 2042, 13, 29504, 468, 257, 50085, 13, 16738, 468, 257, 17849, 13, 14430, 257, 1611, 286, 7832, 3124, 198, 11006, 468, 257, 25286, 13, 40349, 468, 36279, 13, 14200, 468, 257, 47565, 13, 40349, 257, 1611, 286, 7832, 4144, 198, 26497, 468, 257, 12967, 13, 29504, 468, 15900, 13, 12803, 468, 257, 35685, 13, 12803, 257, 1611, 286, 7832, 9528, 198, 12041, 468, 257, 38283, 13, 19579, 468, 257, 11575, 13, 21776, 468, 7872, 13, 3362, 257, 1611, 286, 7832, 10530, 8875, 198, 28711, 468, 257, 22802, 13, 3271, 468, 257, 17536, 13, 5502, 468, 257, 26917, 13, 5502, 257, 1611, 286, 7832, 5044, 198, 13256, 468, 257, 11745, 13, 10443, 468, 29219, 13, 21776, 468, 257, 25996, 13, 3899, 257, 1611, 286, 7832, 17075, 198, 11006, 468, 7872, 13, 22695, 468, 281, 13133, 13, 18678, 468, 257, 40968, 13, 22695, 257, 1611, 286, 7832, 17075, 198, 29284, 468, 6891, 13, 1757, 468, 257, 35685, 13, 3899, 468, 257, 22045, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 17121, 468, 37191, 13, 9953, 468, 20584, 13, 3271, 468, 257, 26241, 13, 3977, 257, 1611, 286, 7832, 9528, 198, 19156, 468, 257, 25996, 13, 3977, 468, 257, 9669, 13, 22695, 468, 257, 35685, 13, 3977, 257, 1611, 286, 7832, 6332, 198, 43568, 468, 257, 18757, 13, 22695, 468, 257, 11745, 13, 5502, 468, 8887, 13, 5502, 257, 1611, 286, 7832, 4144, 198]], [[198, 12041, 468, 257, 3072, 13, 5074, 468, 257, 38283, 13, 32464, 468, 2330, 13, 5074, 257, 1611, 286, 7832, 10530, 8875, 198, 35, 273, 14863, 468, 257, 18744, 13, 29216, 468, 257, 25996, 13, 14430, 468, 26170, 13, 14430, 257, 1611, 286, 7832, 9528, 198, 19139, 468, 257, 41478, 32650, 13, 14430, 468, 257, 26168, 13, 12803, 468, 11398, 13, 12803, 257, 1611, 286, 7832, 3124, 198, 12130, 26654, 468, 257, 3072, 13, 7516, 468, 257, 10047, 13, 14200, 468, 29219, 13, 14200, 257, 1611, 286, 7832, 4144, 198, 42, 5757, 468, 257, 22365, 666, 13, 4502, 468, 257, 4346, 13, 7939, 468, 257, 10147, 13, 4502, 257, 1611, 286, 7832, 6332, 198, 12130, 26654, 468, 257, 16790, 13, 7516, 468, 257, 11745, 13, 29504, 468, 257, 4346, 13, 30223, 257, 1611, 286, 7832, 4282, 198, 12130, 26654, 468, 257, 21202, 13, 16738, 468, 257, 13224, 13, 8239, 468, 257, 22045, 13, 16738, 257, 1611, 286, 7832, 17075, 198, 12130, 26654, 468, 257, 16790, 13, 5658, 468, 36656, 13, 2940, 468, 257, 33039, 13, 30223, 257, 1611, 286, 7832, 4282, 198, 26374, 527, 306, 468, 6174, 13, 29504, 468, 257, 16790, 13, 23632, 468, 257, 26593, 13, 29504, 257, 1611, 286, 7832, 4282, 198, 43, 22261, 468, 281, 13133, 13, 48685, 468, 281, 17180, 13, 5658, 468, 12581, 13, 5658, 257, 1611, 286, 7832, 9528, 198, 39324, 2788, 468, 257, 4346, 13, 14919, 468, 29219, 13, 22695, 468, 257, 22802, 13, 23632, 257, 1611, 286, 7832, 6332, 198, 9914, 349, 468, 257, 15224, 13, 10443, 468, 12768, 13, 8403, 468, 257, 1097, 13, 8403, 257, 1611, 286, 7832, 4038, 198, 26497, 468, 8509, 13, 29216, 468, 21382, 1678, 13, 22132, 468, 6099, 13, 22132, 257, 1611, 286, 7832, 4144, 198, 7554, 468, 257, 22045, 13, 14200, 468, 48241, 13, 10674, 468, 2330, 13, 10674, 257, 1611, 286, 7832, 3124, 198, 39324, 2788, 468, 257, 11575, 13, 14200, 468, 257, 45489, 13, 16685, 468, 257, 24554, 13, 14200, 257, 1611, 286, 7832, 12833, 198, 35, 273, 14863, 468, 257, 4346, 13, 3700, 468, 257, 1323, 13, 3977, 468, 257, 16569, 13, 40349, 257, 1611, 286, 7832, 6332, 198]], [[198, 3987, 2616, 468, 8887, 13, 16738, 468, 11398, 13, 3271, 468, 257, 11575, 13, 3271, 257, 1611, 286, 7832, 4282, 198, 49, 1071, 468, 257, 35446, 13, 8239, 468, 37191, 13, 16685, 468, 257, 47565, 13, 16685, 257, 1611, 286, 7832, 8234, 198, 43568, 468, 29219, 13, 1757, 468, 257, 26241, 13, 12803, 468, 257, 1323, 13, 10674, 257, 1611, 286, 7832, 4144, 198, 44203, 468, 2266, 13, 32464, 468, 257, 4346, 13, 3977, 468, 257, 22045, 13, 32464, 257, 1611, 286, 7832, 6332, 198, 43982, 468, 13135, 13, 48685, 468, 257, 41478, 32650, 13, 3759, 468, 257, 21202, 13, 3759, 257, 1611, 286, 7832, 4282, 198, 43, 22261, 468, 257, 18757, 13, 8982, 468, 20584, 13, 23632, 468, 257, 9283, 13, 23632, 257, 1611, 286, 7832, 6332, 198, 43, 22261, 468, 257, 47565, 13, 14919, 468, 257, 18607, 13, 3700, 468, 12187, 13, 3700, 257, 1611, 286, 7832, 2057, 198, 12041, 468, 257, 18757, 13, 10490, 468, 257, 35685, 13, 7806, 468, 4171, 13, 10490, 257, 1611, 286, 7832, 9528, 198, 12621, 268, 468, 26170, 13, 7212, 468, 2266, 13, 3362, 468, 257, 8187, 13, 7212, 257, 1611, 286, 7832, 3124, 198, 48736, 468, 14032, 13, 3362, 468, 257, 10047, 13, 18496, 468, 257, 33039, 13, 3362, 257, 1611, 286, 7832, 10530, 8875, 198, 14731, 468, 2266, 13, 3899, 468, 257, 19132, 13, 7212, 468, 257, 13224, 13, 3700, 257, 1611, 286, 7832, 3124, 198, 45842, 468, 257, 20461, 11729, 13, 3759, 468, 257, 9283, 13, 18496, 468, 257, 3797, 13, 3759, 257, 1611, 286, 7832, 6332, 198, 11006, 468, 257, 9875, 13, 40349, 468, 281, 13133, 13, 18496, 468, 4171, 13, 40349, 257, 1611, 286, 7832, 17075, 198, 23865, 468, 257, 21202, 13, 8403, 468, 257, 18757, 13, 5074, 468, 257, 12967, 13, 8403, 257, 1611, 286, 7832, 4038, 198, 26374, 527, 306, 468, 14032, 13, 29504, 468, 257, 11223, 538, 13, 10490, 468, 257, 25996, 13, 29504, 257, 1611, 286, 7832, 4038, 198, 23865, 468, 257, 41478, 32650, 13, 14430, 468, 281, 10912, 13, 3899, 468, 257, 16569, 13, 7939, 257, 1611, 286, 7832, 2057, 198]], [[198, 17121, 468, 257, 3072, 13, 26918, 468, 257, 17849, 13, 16738, 468, 257, 1323, 13, 3977, 257, 1611, 286, 7832, 17075, 198, 43187, 468, 12187, 13, 14430, 468, 257, 28738, 13, 1757, 468, 257, 22383, 13, 16348, 257, 1611, 286, 7832, 2057, 198, 19139, 468, 257, 3290, 13, 2940, 468, 6099, 13, 26918, 468, 257, 20096, 13, 2940, 257, 1611, 286, 7832, 4144, 198, 22245, 468, 257, 18744, 13, 16348, 468, 257, 8223, 13, 8239, 468, 257, 18757, 13, 8239, 257, 1611, 286, 7832, 4038, 198, 7554, 468, 257, 19132, 13, 29504, 468, 257, 1660, 45690, 13, 10490, 468, 6174, 13, 10490, 257, 1611, 286, 7832, 2057, 198, 49, 1071, 468, 257, 22365, 666, 13, 3271, 468, 257, 18757, 13, 8403, 468, 4171, 13, 3271, 257, 1611, 286, 7832, 4038, 198, 42, 5757, 468, 11398, 13, 26918, 468, 257, 18873, 13, 19579, 468, 257, 1097, 13, 18678, 257, 1611, 286, 7832, 3124, 198, 43187, 468, 21029, 13, 9953, 468, 8237, 13, 8982, 468, 257, 1660, 45690, 13, 16348, 257, 1611, 286, 7832, 9528, 198, 2484, 8045, 468, 281, 13133, 13, 3700, 468, 4171, 13, 8982, 468, 257, 22045, 13, 26918, 257, 1611, 286, 7832, 17075, 198, 24119, 468, 14256, 13, 40349, 468, 257, 16790, 13, 5199, 468, 257, 3797, 13, 5335, 257, 1611, 286, 7832, 2057, 198, 28711, 468, 257, 20697, 13, 14430, 468, 257, 4346, 13, 16348, 468, 257, 20461, 11729, 13, 16348, 257, 1611, 286, 7832, 8234, 198, 23672, 1940, 468, 14256, 13, 21776, 468, 257, 20096, 13, 3271, 468, 257, 49364, 13, 3271, 257, 1611, 286, 7832, 8234, 198, 45, 3883, 468, 20584, 13, 7939, 468, 2042, 13, 9953, 468, 257, 21202, 13, 9953, 257, 1611, 286, 7832, 4282, 198, 20191, 468, 14256, 13, 1757, 468, 257, 37246, 13, 16348, 468, 13135, 13, 4502, 257, 1611, 286, 7832, 2057, 198, 12041, 468, 26170, 13, 3899, 468, 257, 17536, 13, 30223, 468, 281, 46593, 291, 313, 13, 3899, 257, 1611, 286, 7832, 4038, 198, 12621, 268, 468, 2330, 13, 7212, 468, 257, 8187, 13, 30223, 468, 257, 47565, 13, 22695, 257, 1611, 286, 7832, 3124, 198]], [[198, 9704, 468, 257, 18757, 13, 3977, 468, 257, 41478, 32650, 13, 5199, 468, 257, 50085, 13, 3977, 257, 1611, 286, 7832, 2057, 198, 7554, 468, 257, 28738, 13, 3899, 468, 257, 12967, 13, 18496, 468, 257, 38283, 13, 3899, 257, 1611, 286, 7832, 5044, 198, 12621, 268, 468, 26170, 13, 16738, 468, 29219, 13, 3977, 468, 257, 38283, 13, 3977, 257, 1611, 286, 7832, 10530, 8875, 198, 43982, 468, 8237, 13, 10674, 468, 281, 13133, 13, 21776, 468, 7872, 13, 10674, 257, 1611, 286, 7832, 17075, 198, 26497, 468, 257, 15224, 13, 16738, 468, 257, 10047, 13, 14430, 468, 257, 1097, 13, 14430, 257, 1611, 286, 7832, 4038, 198, 16587, 40844, 468, 48241, 13, 40349, 468, 257, 33039, 13, 3977, 468, 257, 1097, 13, 36976, 257, 1611, 286, 7832, 2057, 198, 43687, 468, 257, 9875, 13, 22132, 468, 21382, 1678, 13, 7806, 468, 6099, 13, 7806, 257, 1611, 286, 7832, 4144, 198, 45, 3883, 468, 257, 9669, 13, 22132, 468, 257, 15224, 13, 12803, 468, 7872, 13, 12803, 257, 1611, 286, 7832, 3124, 198, 20191, 468, 257, 22365, 666, 13, 1757, 468, 2330, 13, 19579, 468, 12581, 13, 1757, 257, 1611, 286, 7832, 3124, 198, 28292, 468, 6174, 13, 6219, 468, 257, 35446, 13, 22695, 468, 26170, 13, 8239, 257, 1611, 286, 7832, 2057, 198, 12621, 268, 468, 257, 10047, 13, 16685, 468, 14256, 13, 14919, 468, 257, 22746, 13, 22695, 257, 1611, 286, 7832, 10530, 8875, 198, 45, 3883, 468, 12768, 13, 22132, 468, 8887, 13, 5199, 468, 20584, 13, 18496, 257, 1611, 286, 7832, 3124, 198, 43687, 468, 36279, 13, 5074, 468, 257, 8187, 13, 14919, 468, 4171, 20853, 13, 5074, 257, 1611, 286, 7832, 9528, 198, 9914, 349, 468, 257, 22802, 13, 10443, 468, 257, 479, 14246, 72, 13, 40349, 468, 257, 2485, 13, 40349, 257, 1611, 286, 7832, 4282, 198, 43, 22261, 468, 6099, 13, 12803, 468, 12187, 13, 6219, 468, 36973, 13, 21776, 257, 1611, 286, 7832, 4144, 198, 23865, 468, 257, 16569, 13, 18678, 468, 257, 16790, 13, 1757, 468, 257, 11223, 538, 13, 1757, 257, 1611, 286, 7832, 4038, 198]], [[198, 24761, 468, 257, 3072, 13, 3759, 468, 257, 38283, 13, 1757, 468, 257, 22802, 13, 1757, 257, 1611, 286, 7832, 8234, 198, 43, 22261, 468, 257, 33039, 13, 29216, 468, 257, 8187, 13, 3977, 468, 257, 22802, 13, 29216, 257, 1611, 286, 7832, 9528, 198, 43187, 468, 257, 18757, 13, 7939, 468, 2042, 13, 8982, 468, 257, 18607, 13, 7939, 257, 1611, 286, 7832, 3124, 198, 43568, 468, 257, 16790, 13, 23632, 468, 257, 41478, 32650, 13, 5335, 468, 257, 15224, 13, 5335, 257, 1611, 286, 7832, 9528, 198, 9704, 468, 257, 9669, 13, 48685, 468, 36279, 13, 5658, 468, 14256, 13, 2940, 257, 1611, 286, 7832, 6332, 198, 9914, 349, 468, 281, 13133, 13, 8982, 468, 257, 26320, 13, 5199, 468, 257, 50085, 13, 5074, 257, 1611, 286, 7832, 17075, 198, 32697, 468, 281, 13133, 13, 26918, 468, 257, 37246, 13, 7806, 468, 257, 1660, 45690, 13, 9953, 257, 1611, 286, 7832, 17075, 198, 22405, 468, 36973, 13, 30223, 468, 257, 22383, 13, 8239, 468, 4171, 13, 30223, 257, 1611, 286, 7832, 9528, 198, 19139, 468, 14256, 13, 5199, 468, 2042, 13, 7212, 468, 257, 8223, 13, 5502, 257, 1611, 286, 7832, 2057, 198, 11006, 468, 257, 11745, 13, 29504, 468, 257, 26320, 13, 6219, 468, 11398, 13, 29504, 257, 1611, 286, 7832, 2057, 198, 12130, 26654, 468, 4171, 13, 29216, 468, 6891, 13, 7516, 468, 14256, 13, 7516, 257, 1611, 286, 7832, 2057, 198, 10374, 39389, 468, 257, 1323, 13, 3759, 468, 15900, 13, 22132, 468, 12581, 13, 22132, 257, 1611, 286, 7832, 9528, 198, 7371, 468, 2330, 13, 16348, 468, 257, 15224, 13, 7939, 468, 257, 38283, 13, 7939, 257, 1611, 286, 7832, 10530, 8875, 198, 22405, 468, 257, 20697, 13, 15378, 468, 8509, 13, 10490, 468, 257, 18757, 13, 15378, 257, 1611, 286, 7832, 2057, 198, 13056, 774, 468, 37191, 13, 18678, 468, 257, 17481, 13, 15378, 468, 257, 479, 14246, 72, 13, 15378, 257, 1611, 286, 7832, 8234, 198, 2484, 8045, 468, 8237, 13, 16348, 468, 257, 22746, 13, 8982, 468, 257, 20096, 13, 26918, 257, 1611, 286, 7832, 4144, 198]], [[198, 9914, 349, 468, 257, 10211, 13, 16348, 468, 4171, 13, 8982, 468, 281, 13133, 13, 8982, 257, 1611, 286, 7832, 17075, 198, 28292, 468, 6891, 13, 32464, 468, 257, 38283, 13, 18678, 468, 257, 9669, 13, 8239, 257, 1611, 286, 7832, 4144, 198, 28711, 468, 281, 13133, 13, 3977, 468, 257, 28738, 13, 16738, 468, 257, 22746, 13, 3977, 257, 1611, 286, 7832, 8234, 198, 7554, 468, 257, 4346, 13, 9953, 468, 48241, 13, 5074, 468, 2266, 13, 1757, 257, 1611, 286, 7832, 6332, 198, 22405, 468, 257, 12967, 13, 48685, 468, 8237, 13, 3362, 468, 257, 20697, 13, 3362, 257, 1611, 286, 7832, 12833, 198, 20191, 468, 257, 49364, 13, 14919, 468, 257, 18744, 13, 14430, 468, 257, 41478, 32650, 13, 4502, 257, 1611, 286, 7832, 8234, 198, 43568, 468, 257, 4346, 13, 5502, 468, 257, 21831, 13, 5335, 468, 257, 18607, 13, 10674, 257, 1611, 286, 7832, 6332, 198, 49, 1071, 468, 257, 45314, 13, 23632, 468, 257, 18757, 13, 9953, 468, 281, 17180, 13, 9953, 257, 1611, 286, 7832, 8234, 198, 43568, 468, 4171, 13, 19579, 468, 257, 18757, 13, 16738, 468, 14256, 13, 19579, 257, 1611, 286, 7832, 4038, 198, 14731, 468, 8509, 13, 10490, 468, 257, 22365, 666, 13, 7516, 468, 257, 10047, 13, 7516, 257, 1611, 286, 7832, 10530, 8875, 198, 42, 5757, 468, 2266, 13, 7806, 468, 257, 20461, 11729, 13, 10674, 468, 257, 24554, 13, 10674, 257, 1611, 286, 7832, 4144, 198, 10374, 39389, 468, 12768, 13, 48685, 468, 257, 37246, 13, 19579, 468, 257, 18607, 13, 16685, 257, 1611, 286, 7832, 3124, 198, 43982, 468, 36973, 13, 16348, 468, 257, 10047, 13, 5199, 468, 15900, 13, 16348, 257, 1611, 286, 7832, 10530, 8875, 198, 29284, 468, 257, 26168, 13, 29504, 468, 257, 1097, 13, 26918, 468, 257, 20096, 13, 29504, 257, 1611, 286, 7832, 4038, 198, 29458, 468, 257, 8187, 13, 10490, 468, 281, 13133, 13, 2940, 468, 257, 35446, 13, 10490, 257, 1611, 286, 7832, 17075, 198, 28711, 468, 257, 33039, 13, 7212, 468, 21382, 1678, 13, 18496, 468, 281, 13133, 13, 7212, 257, 1611, 286, 7832, 8234, 198]], [[198, 12621, 268, 468, 257, 8223, 13, 16685, 468, 257, 18757, 13, 29504, 468, 257, 3072, 13, 29504, 257, 1611, 286, 7832, 17075, 198, 26497, 468, 257, 24554, 13, 14200, 468, 257, 16569, 13, 16738, 468, 257, 20697, 13, 16738, 257, 1611, 286, 7832, 12833, 198, 14731, 468, 257, 479, 14246, 72, 13, 5335, 468, 257, 21202, 13, 16738, 468, 257, 9283, 13, 3700, 257, 1611, 286, 7832, 8234, 198, 29458, 468, 257, 49364, 13, 2940, 468, 257, 9283, 13, 29504, 468, 257, 16569, 13, 2940, 257, 1611, 286, 7832, 6332, 198, 14731, 468, 257, 22746, 13, 48685, 468, 2042, 13, 3977, 468, 257, 35446, 13, 3977, 257, 1611, 286, 7832, 12833, 198, 38025, 468, 257, 45489, 13, 3271, 468, 257, 17536, 13, 7212, 468, 281, 13133, 13, 7212, 257, 1611, 286, 7832, 17075, 198, 19139, 468, 257, 21202, 13, 10674, 468, 257, 26241, 13, 7806, 468, 26170, 13, 5502, 257, 1611, 286, 7832, 4282, 198, 43982, 468, 36973, 13, 7212, 468, 257, 45489, 13, 14430, 468, 15900, 13, 7212, 257, 1611, 286, 7832, 12833, 198, 46827, 468, 21382, 1678, 13, 5335, 468, 257, 35446, 13, 16685, 468, 10012, 13, 14200, 257, 1611, 286, 7832, 8234, 198, 22245, 468, 257, 17481, 13, 14430, 468, 257, 28738, 13, 18678, 468, 257, 10047, 13, 6219, 257, 1611, 286, 7832, 5044, 198, 43568, 468, 257, 16790, 13, 2940, 468, 257, 8187, 13, 3759, 468, 257, 11575, 13, 2940, 257, 1611, 286, 7832, 9528, 198, 14731, 468, 6891, 13, 5502, 468, 12581, 13, 16753, 468, 257, 3072, 13, 16753, 257, 1611, 286, 7832, 17075, 198, 24761, 468, 257, 24554, 13, 1757, 468, 257, 50085, 13, 30223, 468, 257, 2485, 13, 8403, 257, 1611, 286, 7832, 4144, 198, 7554, 468, 257, 18744, 13, 6219, 468, 8887, 13, 18496, 468, 36656, 13, 6219, 257, 1611, 286, 7832, 4144, 198, 46827, 468, 257, 22802, 13, 21776, 468, 257, 26168, 13, 16753, 468, 257, 3797, 13, 16753, 257, 1611, 286, 7832, 5044, 198, 26374, 527, 306, 468, 257, 45314, 13, 19579, 468, 257, 25996, 13, 16753, 468, 257, 18757, 13, 19579, 257, 1611, 286, 7832, 8234, 198]]]}, "g2c[MlM_gen][genders_of_persons.TreeSet.equal,types_of_things.TreeSet.child][cxt_len=3]": {"texts": ["\nDeborah has a peach. John has a rifle. Laura has a beetle. Laura a kind of likes insect? True\nJeff has wine. Patricia has a pineapple. Edward has a peach. Jeff a kind of likes drink? True\nDonna has a goat. Karen has T-shirt. Nancy has a pear. Karen a kind of likes animal? False\nKaren has a rifle. John has a football. Barbara has a costume. Karen a kind of likes weapon? True\nMargaret has a motorcycle. Michelle has purple. William has a monkey. Margaret a kind of likes vehicle? True\nMichael has a laptop. Donald has a motorcycle. Jeff has a kiwi. Donald a kind of likes electronics? False\nJoseph has a rifle. Richard has a football. Sharon has beer. Joseph a kind of likes weapon? True\nGeorge has a cat. Margaret has a pineapple. Sandra has a piano. George a kind of likes musical instrument? False\nLinda has gray. Ronald has cake. Daniel has a gorilla. Linda a kind of likes food? False\nMichael has a squirrel. Kimberly has a jeep. Donald has shoes. Donald a kind of likes clothing? True\nBetty has a cow. Jennifer has spaghetti. Helen has coffee. Helen a kind of likes drink? True\nKevin has blue. David has a goat. Ruth has a papaya. Kevin a kind of likes animal? False\nCarol has wine. Joseph has a smartphone. Mark has a costume. Joseph a kind of likes electronics? True\nChristopher has a guitar. Susan has a jersey. Joseph has a football. Susan a kind of likes sport? False\nDaniel has a burger. Ruth has tea. Sarah has a basketball. Sarah a kind of likes drink? False\nRuth has a shirt. Sarah has a kiwi. Susan has a watermelon. Ruth a kind of likes clothing? True\n", "\nDonna has a pig. Maria has a guitar. Sandra has a revolver. Sandra a kind of likes weapon? True\nBarbara has grapes. Christopher has a bee. Maria has pink. Christopher a kind of likes insect? True\nRichard has a horse. Kimberly has a cocktail. Deborah has red. Kimberly a kind of likes color? False\nSharon has juice. Sarah has white. Dorothy has strawberries. Sharon a kind of likes fruit? False\nEdward has a cat. Dorothy has a car. Sandra has green. Sandra a kind of likes animal? False\nDonald has blue. Ronald has a horse. Lisa has gray. Ronald a kind of likes color? False\nSharon has pizza. Laura has blue. Jennifer has a revolver. Sharon a kind of likes weapon? False\nKenneth has a basketball. Carol has a handgun. Jennifer has a fox. Kenneth a kind of likes sport? True\nDeborah has a shotgun. Michelle has a beetle. Thomas has a cat. Michelle a kind of likes weapon? False\nSharon has bread. Paul has a costume. Michael has red. Sharon a kind of likes clothing? False\nRobert has a hamburger. Carol has a grenade. Jason has a football. Carol a kind of likes weapon? True\nDeborah has gray. Ruth has pizza. Carol has a costume. Deborah a kind of likes color? True\nJennifer has a piano. Sandra has a banana. Richard has cake. Jennifer a kind of likes food? False\nMark has a sweater. John has a shirt. William has a motorcycle. William a kind of likes clothing? False\nJoseph has a goose. Donald has green. Maria has a phone. Maria a kind of likes electronics? True\nSharon has a dog. Patricia has a cocktail. Kimberly has a gun. Sharon a kind of likes animal? True\n", "\nLisa has a durian. Sharon has an apricot. Donna has a violin. Donna a kind of likes musical instrument? True\nSteven has black. Paul has a phone. Helen has a guitar. Helen a kind of likes musical instrument? True\nJames has a jersey. Dorothy has a gun. Charles has a goose. Charles a kind of likes weapon? False\nThomas has a goat. Patricia has a car. Charles has a burger. Patricia a kind of likes vehicle? True\nSusan has an iPad. Michael has white. John has a violin. Susan a kind of likes musical instrument? False\nBarbara has strawberries. Sharon has T-shirt. Jason has a football. Jason a kind of likes fruit? False\nElizabeth has a jeep. James has sheep. Michelle has spaghetti. James a kind of likes animal? True\nAnthony has a handgun. Betty has tea. Laura has a banana. Laura a kind of likes drink? False\nMichelle has a bee. John has blueberries. Mark has a violin. Mark a kind of likes fruit? False\nSusan has a shotgun. Charles has cake. Deborah has a motorcycle. Susan a kind of likes weapon? True\nWilliam has a grenade. Donald has a cow. Robert has a car. William a kind of likes weapon? True\nNancy has pants. James has black. Deborah has a horse. Deborah a kind of likes animal? True\nMichelle has a smartphone. Kenneth has a mouse. Elizabeth has a burger. Kenneth a kind of likes electronics? False\nKevin has a violin. Daniel has a sweater. Patricia has a cannon. Kevin a kind of likes musical instrument? True\nLinda has a grenade. Paul has purple. Jeff has beer. Linda a kind of likes drink? False\nLinda has juice. Anthony has a jersey. Maria has a gun. Anthony a kind of likes drink? False\n", "\nChristopher has a guitar. William has a jacket. Deborah has a bee. Deborah a kind of likes clothing? False\nRichard has a piano. Laura has a shirt. Daniel has bread. Richard a kind of likes musical instrument? True\nKimberly has pink. Margaret has a car. John has a cow. Kimberly a kind of likes vehicle? False\nLisa has whiskey. Margaret has a donkey. Deborah has a lion. Lisa a kind of likes drink? True\nLaura has pants. Anthony has coffee. Lisa has spaghetti. Anthony a kind of likes drink? True\nBarbara has a shotgun. Michelle has a tiger. Joseph has a steak. Barbara a kind of likes food? False\nMaria has pink. Mary has whiskey. Jason has a bee. Jason a kind of likes insect? True\nSarah has a plum. Susan has cake. Sharon has shoes. Susan a kind of likes fruit? False\nCarol has pink. Christopher has a rifle. Jason has a mango. Jason a kind of likes weapon? False\nRobert has a car. Maria has a gorilla. Jason has a baseball. Robert a kind of likes vehicle? True\nJoseph has a shirt. Mary has blue. Linda has juice. Mary a kind of likes color? True\nBarbara has a shirt. Kevin has bread. Sarah has a violin. Sarah a kind of likes musical instrument? True\nMichael has a basketball. Maria has a bus. Richard has a sweater. Maria a kind of likes clothing? False\nJeff has a monkey. Elizabeth has vodka. Mark has a jeep. Mark a kind of likes vehicle? True\nJohn has bread. Daniel has a cat. Ruth has a pineapple. Daniel a kind of likes food? False\nSarah has blueberries. James has a banana. Thomas has a cocktail. Thomas a kind of likes drink? True\n", "\nMichael has soda. Charles has an elephant. David has a beetle. Michael a kind of likes animal? False\nBarbara has sheep. Sandra has a football. Christopher has a rifle. Sandra a kind of likes sport? True\nSandra has whiskey. John has trousers. William has a sweater. Sandra a kind of likes drink? True\nCarol has a beetle. Elizabeth has bread. Richard has a lemon. Carol a kind of likes fruit? False\nJoseph has a pig. Lisa has a basketball. Ruth has a goat. Lisa a kind of likes animal? False\nKenneth has a beetle. Susan has a football. Carol has trousers. Kenneth a kind of likes insect? True\nAnthony has a jersey. Susan has blueberries. Ruth has black. Susan a kind of likes clothing? False\nDavid has a duck. Charles has a pear. Carol has green. Carol a kind of likes animal? False\nMary has an apricot. Lisa has a baseball. John has vodka. John a kind of likes drink? True\nJohn has a bee. Sarah has a basketball. Kimberly has a pistol. Sarah a kind of likes insect? False\nEdward has a phone. Daniel has green. Donald has sheep. Donald a kind of likes electronics? False\nSharon has a taxi. Edward has a banana. William has a deer. Sharon a kind of likes vehicle? True\nDavid has a burger. Lisa has a motorcycle. Helen has purple. Helen a kind of likes color? True\nWilliam has a mosquito. Patricia has cake. Barbara has blackberries. William a kind of likes food? False\nRonald has a piano. Donna has a jersey. Thomas has green. Thomas a kind of likes color? True\nCharles has a basketball. Deborah has a handgun. Betty has an iPad. Charles a kind of likes sport? True\n", "\nBarbara has a rifle. Ronald has cherries. Kenneth has a donkey. Barbara a kind of likes animal? False\nJoseph has white. Betty has coffee. Deborah has underwear. Joseph a kind of likes clothing? False\nCharles has a cat. Jeff has pants. Nancy has pizza. Jeff a kind of likes food? False\nRichard has a motorcycle. Ruth has pizza. Thomas has an iPad. Richard a kind of likes vehicle? True\nMargaret has vodka. Mark has a burger. Donald has a baseball. Donald a kind of likes sport? True\nRonald has a laptop. Jeff has a squirrel. Betty has a bee. Ronald a kind of likes animal? False\nDonna has an apple. William has a shirt. Mary has beer. Donna a kind of likes clothing? False\nSarah has coffee. Elizabeth has white. Maria has a banana. Sarah a kind of likes color? False\nRobert has cherries. Linda has a jacket. Jason has a wolf. Linda a kind of likes clothing? True\nMichelle has blue. Susan has a mango. Linda has a taxi. Susan a kind of likes fruit? True\nMichelle has a mosquito. William has a costume. Patricia has a pear. William a kind of likes insect? False\nThomas has blueberries. Robert has a cat. Jason has pants. Jason a kind of likes fruit? False\nCarol has a lion. Nancy has a laptop. Anthony has a cat. Nancy a kind of likes animal? False\nMaria has underwear. Margaret has a burger. Sarah has a jeep. Sarah a kind of likes vehicle? True\nSteven has wine. Jennifer has green. Patricia has a piano. Jennifer a kind of likes color? True\nSandra has yellow. Mark has spaghetti. Michelle has a banana. Michelle a kind of likes food? False\n", "\nMichelle has strawberries. Deborah has a jersey. Jeff has a gun. Jeff a kind of likes weapon? True\nDonna has a car. Kimberly has soda. Robert has a basketball. Robert a kind of likes sport? True\nJennifer has a mosquito. Helen has a burger. Kimberly has a cannon. Helen a kind of likes food? True\nLaura has an elephant. Karen has a steak. Linda has gray. Linda a kind of likes food? False\nPatricia has underwear. Karen has a dog. Kenneth has a basketball. Kenneth a kind of likes clothing? False\nLisa has a car. Elizabeth has a watermelon. Ronald has bread. Lisa a kind of likes vehicle? True\nMary has trousers. John has blue. Jeff has an orange. Jeff a kind of likes color? False\nJeff has a papaya. Laura has a squirrel. Ruth has a bus. Ruth a kind of likes fruit? False\nRichard has a uniform. Michael has a laptop. Ronald has blackberries. Michael a kind of likes clothing? False\nKenneth has pizza. Helen has underwear. Michael has a gorilla. Kenneth a kind of likes food? True\nKimberly has yellow. Karen has a pig. Margaret has a violin. Karen a kind of likes animal? True\nMichael has bread. Charles has a car. Joseph has green. Charles a kind of likes vehicle? True\nMichelle has yellow. Jeff has a smartphone. Thomas has a goat. Thomas a kind of likes animal? True\nSteven has shoes. James has blackberries. Thomas has a violin. Thomas a kind of likes fruit? False\nMichelle has a car. Joseph has a shotgun. Jason has a phone. Michelle a kind of likes vehicle? True\nSharon has gray. Anthony has a guitar. Susan has underwear. Susan a kind of likes clothing? True\n", "\nSusan has an apple. Nancy has a gun. Jeff has a taxi. Jeff a kind of likes vehicle? True\nDonna has a kiwi. Laura has a rabbit. Christopher has a baseball. Laura a kind of likes animal? True\nGeorge has a jersey. Brian has shoes. Nancy has a duck. Nancy a kind of likes clothing? False\nDavid has meat. Daniel has a mosquito. Paul has pants. David a kind of likes food? True\nMary has a football. Michael has a phone. Karen has a shirt. Mary a kind of likes sport? True\nMargaret has pants. James has coffee. Patricia has a taxi. Patricia a kind of likes drink? False\nKimberly has an orange. Ronald has a dog. Mark has vodka. Mark a kind of likes drink? True\nKimberly has a baseball. Linda has trousers. Michael has a piano. Michael a kind of likes musical instrument? True\nRonald has a mouse. Barbara has a car. Sarah has cake. Ronald a kind of likes animal? True\nJohn has a cat. Ruth has a piano. Sarah has a durian. Ruth a kind of likes fruit? False\nBrian has blue. James has a deer. John has a rabbit. Brian a kind of likes animal? False\nJohn has a pineapple. Richard has a mosquito. Brian has bread. Richard a kind of likes fruit? False\nRuth has a cannon. Kenneth has a goat. Robert has a gorilla. Ruth a kind of likes weapon? True\nRonald has a car. Joseph has a kiwi. Mark has a fox. Ronald a kind of likes animal? False\nSandra has yellow. Betty has a lime. Lisa has a rifle. Sandra a kind of likes weapon? False\nSusan has black. William has a taxi. Jeff has cherries. Susan a kind of likes vehicle? False\n", "\nMargaret has a gun. Sandra has a violin. John has a pistol. Sandra a kind of likes weapon? False\nLaura has a durian. Barbara has a mosquito. Ronald has a revolver. Barbara a kind of likes weapon? False\nChristopher has a beetle. Richard has a car. Thomas has an orange. Thomas a kind of likes vehicle? False\nRobert has blueberries. John has a violin. Betty has tea. Robert a kind of likes musical instrument? False\nDorothy has a deer. Richard has a mosquito. Lisa has a car. Lisa a kind of likes animal? False\nRonald has a shotgun. Maria has a rabbit. Lisa has grapes. Lisa a kind of likes weapon? False\nMargaret has a bus. Ronald has a phone. Donna has a peach. Margaret a kind of likes electronics? False\nDeborah has a guitar. Richard has a beetle. Kenneth has a fox. Richard a kind of likes insect? True\nElizabeth has a cannon. Carol has underwear. David has grapes. Carol a kind of likes weapon? False\nMaria has a shirt. Daniel has vodka. Michael has a lime. Maria a kind of likes clothing? True\nPatricia has strawberries. Deborah has a goose. Ruth has a laptop. Ruth a kind of likes animal? False\nLisa has a mango. John has a cat. Margaret has jeans. Lisa a kind of likes fruit? True\nJason has blueberries. Barbara has sheep. Elizabeth has a beetle. Barbara a kind of likes animal? True\nJames has a mosquito. Helen has juice. Daniel has meat. Helen a kind of likes food? False\nDorothy has T-shirt. Thomas has a violin. David has strawberries. Dorothy a kind of likes clothing? True\nBrian has a lemon. Robert has a uniform. Susan has a laptop. Susan a kind of likes electronics? True\n", "\nCharles has a rifle. Anthony has blackberries. Brian has cake. Brian a kind of likes food? True\nRuth has a papaya. Charles has a steak. Kevin has a handgun. Ruth a kind of likes fruit? True\nWilliam has a piano. Karen has cherries. Paul has pink. Paul a kind of likes color? True\nLaura has a monkey. Elizabeth has a durian. Margaret has a shotgun. Laura a kind of likes fruit? False\nJohn has a gun. Elizabeth has a violin. Christopher has a laptop. Elizabeth a kind of likes electronics? False\nRonald has a pistol. Ruth has a hamburger. Sandra has a lime. Ronald a kind of likes weapon? True\nPaul has juice. Carol has red. Richard has a lime. Paul a kind of likes color? False\nJoseph has a smartphone. Sandra has whiskey. Patricia has a football. Sandra a kind of likes drink? True\nDonna has a burger. Jennifer has a lion. Michael has a shotgun. Michael a kind of likes weapon? True\nJames has soda. George has a laptop. Kenneth has a steak. Kenneth a kind of likes drink? False\nJohn has coffee. Margaret has an elephant. Kenneth has a peach. Margaret a kind of likes animal? True\nLisa has a cannon. Steven has a cow. Donald has a squirrel. Lisa a kind of likes animal? False\nGeorge has meat. Edward has trousers. Mary has a bee. George a kind of likes food? True\nDonna has a lime. Maria has a shotgun. Karen has a lion. Maria a kind of likes animal? False\nDonna has meat. Carol has a durian. Kevin has a beetle. Donna a kind of likes food? True\nJoseph has a sweater. Charles has a laptop. Carol has shoes. Charles a kind of likes clothing? False\n", "\nMaria has a cocktail. Charles has a smartphone. Laura has sheep. Laura a kind of likes drink? False\nPaul has an apricot. Dorothy has an iPad. Kenneth has a cow. Kenneth a kind of likes electronics? False\nKaren has soda. Thomas has a sweater. Jason has green. Karen a kind of likes drink? True\nJason has a motorcycle. Jeff has a smartphone. Karen has tea. Karen a kind of likes vehicle? False\nAnthony has an apple. Barbara has cake. Maria has a lime. Barbara a kind of likes food? True\nMichael has a monkey. Mark has gray. Brian has a bee. Michael a kind of likes animal? True\nKaren has a pineapple. Jeff has a car. Maria has a cow. Jeff a kind of likes vehicle? True\nRobert has pink. Charles has a football. Helen has a lion. Robert a kind of likes color? True\nRichard has a basketball. Steven has a mango. Kevin has a kiwi. Richard a kind of likes sport? True\nJohn has an orange. Sandra has a lion. Brian has a burger. Brian a kind of likes animal? False\nRuth has a pear. Mary has a baseball. Nancy has a cocktail. Mary a kind of likes sport? True\nJoseph has a laptop. Patricia has a squirrel. Mark has a basketball. Joseph a kind of likes sport? False\nGeorge has pink. Sharon has a costume. Linda has a shotgun. Sharon a kind of likes clothing? True\nSusan has a peach. Nancy has an apple. Elizabeth has a jeep. Elizabeth a kind of likes vehicle? True\nRuth has black. Barbara has a cocktail. Paul has a pig. Ruth a kind of likes drink? False\nKimberly has a laptop. Daniel has a rabbit. Jennifer has purple. Kimberly a kind of likes color? False\n", "\nJeff has whiskey. Sarah has a gorilla. Karen has a shotgun. Jeff a kind of likes animal? False\nBrian has blue. Mark has a papaya. Helen has a pistol. Helen a kind of likes fruit? False\nMark has a peach. Dorothy has a shotgun. Deborah has spaghetti. Deborah a kind of likes food? True\nDonna has blackberries. Kenneth has sheep. Elizabeth has meat. Elizabeth a kind of likes animal? False\nBrian has cake. Jennifer has T-shirt. Donna has blue. Brian a kind of likes food? True\nJoseph has wine. David has a jersey. Jason has a plum. Joseph a kind of likes clothing? False\nPatricia has a pistol. Charles has a smartphone. Betty has a football. Patricia a kind of likes weapon? True\nWilliam has red. Steven has a deer. Kimberly has underwear. Steven a kind of likes animal? True\nMargaret has a shirt. Thomas has a baseball. William has a kiwi. Thomas a kind of likes fruit? False\nKimberly has meat. Betty has a pistol. Kenneth has a burger. Betty a kind of likes weapon? True\nLaura has an iPad. Ruth has an apple. Elizabeth has pants. Elizabeth a kind of likes clothing? True\nJoseph has yellow. Donald has an apricot. Kimberly has a guitar. Joseph a kind of likes musical instrument? False\nGeorge has a laptop. Margaret has juice. Daniel has a burger. Daniel a kind of likes food? True\nKaren has a pistol. Paul has red. Lisa has a cat. Paul a kind of likes color? True\nMark has cherries. Robert has a mosquito. Deborah has a smartphone. Mark a kind of likes fruit? True\nJeff has a smartphone. Helen has a dog. Christopher has a jacket. Christopher a kind of likes clothing? True\n", "\nCarol has spaghetti. Richard has a banana. Donna has a gun. Richard a kind of likes fruit? True\nDeborah has a cocktail. Maria has sheep. Paul has a pineapple. Maria a kind of likes animal? True\nJeff has T-shirt. Elizabeth has a laptop. Barbara has a rabbit. Elizabeth a kind of likes electronics? True\nSusan has a kiwi. Jeff has a hamburger. Joseph has a rifle. Jeff a kind of likes food? True\nRichard has meat. Jason has strawberries. Kenneth has gray. Richard a kind of likes food? True\nChristopher has a hamburger. Kevin has a goose. Elizabeth has a costume. Christopher a kind of likes food? True\nHelen has strawberries. Daniel has a handgun. John has a bus. John a kind of likes weapon? False\nRuth has a duck. Sharon has a violin. Lisa has a kiwi. Ruth a kind of likes fruit? False\nThomas has a durian. Dorothy has a beetle. Brian has a gun. Dorothy a kind of likes insect? True\nRobert has a pear. Kimberly has a smartphone. Richard has a car. Kimberly a kind of likes fruit? False\nPatricia has a lemon. Daniel has a violin. Jennifer has a shotgun. Patricia a kind of likes musical instrument? False\nDonald has a goose. Lisa has underwear. Maria has a horse. Lisa a kind of likes clothing? True\nMichael has blue. Thomas has a motorcycle. Maria has a jacket. Maria a kind of likes clothing? True\nMaria has a dog. Susan has a watermelon. John has a violin. Susan a kind of likes animal? False\nJohn has green. Donna has a horse. Susan has a plum. John a kind of likes fruit? False\nDaniel has a sweater. Richard has a pineapple. Elizabeth has green. Elizabeth a kind of likes color? True\n", "\nEdward has juice. Kimberly has a hamburger. Donald has a cannon. Donald a kind of likes weapon? True\nAnthony has an apricot. Margaret has underwear. Mary has a fox. Mary a kind of likes fruit? False\nHelen has a gorilla. Sharon has a cannon. Jason has a bee. Jason a kind of likes insect? True\nCharles has a handgun. Susan has a monkey. Deborah has blueberries. Charles a kind of likes weapon? True\nMargaret has pink. Richard has spaghetti. Edward has coffee. Margaret a kind of likes drink? False\nRobert has a revolver. Joseph has a uniform. Thomas has a fox. Robert a kind of likes weapon? True\nSusan has a beetle. Jason has a shotgun. Richard has cherries. Jason a kind of likes insect? False\nSteven has a laptop. Karen has a jersey. Carol has a shotgun. Karen a kind of likes weapon? False\nJohn has a mango. Kenneth has a shirt. Donna has an iPad. Kenneth a kind of likes clothing? True\nHelen has a hamburger. Susan has sheep. Sharon has a shirt. Susan a kind of likes animal? True\nMary has a pistol. Steven has a mouse. Maria has a durian. Steven a kind of likes animal? True\nJeff has a mosquito. Betty has a burger. Carol has white. Jeff a kind of likes food? False\nRobert has a peach. Sandra has a papaya. Nancy has a costume. Nancy a kind of likes fruit? False\nJennifer has a rifle. Thomas has an orange. Betty has a basketball. Betty a kind of likes sport? True\nSusan has a donkey. Kenneth has pizza. Margaret has wine. Susan a kind of likes food? False\nRobert has a piano. Maria has gray. Sandra has an iPad. Sandra a kind of likes musical instrument? False\n", "\nKenneth has jeans. Kevin has a steak. Mary has a squirrel. Kevin a kind of likes clothing? False\nJohn has shoes. Anthony has a donkey. Ruth has soda. John a kind of likes clothing? True\nLisa has a watermelon. Kenneth has T-shirt. Helen has a burger. Helen a kind of likes fruit? False\nSusan has a violin. James has vodka. Donna has bread. Susan a kind of likes musical instrument? True\nLaura has a steak. Brian has a jeep. Karen has a car. Laura a kind of likes food? True\nJennifer has a basketball. Dorothy has spaghetti. Jason has a piano. Jason a kind of likes sport? False\nJames has a pig. Margaret has cake. Robert has a motorcycle. Robert a kind of likes vehicle? True\nJennifer has a cannon. Barbara has a goose. Christopher has juice. Christopher a kind of likes weapon? False\nSarah has a football. Christopher has a pig. Kimberly has a mouse. Sarah a kind of likes sport? True\nDorothy has green. Paul has pants. Sharon has a guitar. Paul a kind of likes color? False\nJames has green. Michelle has a bee. Karen has a rabbit. Michelle a kind of likes animal? False\nSandra has a laptop. Laura has cake. Elizabeth has white. Laura a kind of likes food? True\nElizabeth has red. Kimberly has white. Jeff has a beetle. Jeff a kind of likes insect? True\nRonald has a peach. Ruth has green. Linda has a motorcycle. Ruth a kind of likes color? True\nSharon has blackberries. Joseph has pants. Paul has meat. Paul a kind of likes clothing? False\nLaura has a motorcycle. Deborah has a revolver. Sarah has green. Sarah a kind of likes color? True\n", "\nDonna has wine. Sharon has a shirt. George has a grenade. Sharon a kind of likes weapon? False\nWilliam has a laptop. James has tea. Kimberly has vodka. William a kind of likes electronics? True\nPatricia has a steak. Charles has a guitar. Brian has a phone. Patricia a kind of likes food? True\nKaren has a mango. Kimberly has green. Susan has a violin. Susan a kind of likes fruit? False\nPatricia has a baseball. Jennifer has underwear. Charles has red. Patricia a kind of likes clothing? False\nMary has a cannon. Robert has a monkey. Elizabeth has trousers. Mary a kind of likes weapon? True\nLinda has yellow. David has underwear. Donald has a motorcycle. Linda a kind of likes vehicle? False\nDeborah has a football. John has an apple. Jeff has a taxi. Deborah a kind of likes fruit? False\nJohn has a basketball. Michael has a durian. Donald has a sweater. John a kind of likes clothing? False\nDavid has shoes. Charles has a laptop. Jennifer has a basketball. Jennifer a kind of likes sport? True\nRonald has T-shirt. Susan has a rabbit. George has strawberries. Ronald a kind of likes clothing? True\nMichael has jeans. Margaret has a cow. Michelle has a lion. Michael a kind of likes animal? False\nLinda has a baseball. Elizabeth has purple. Kenneth has a taxi. Linda a kind of likes color? False\nSandra has a gun. Jennifer has gray. Brian has a duck. Sandra a kind of likes animal? False\nSharon has an iPad. James has blue. Jason has a duck. Sharon a kind of likes electronics? True\nRobert has a bee. Mary has a mango. Michael has white. Robert a kind of likes insect? True\n"], "bos": [[[23, 24], [46, 47], [72, 73], [97, 98], [121, 122], [147, 148], [170, 171], [195, 196], [218, 219], [242, 243], [265, 266], [289, 290], [313, 314], [337, 338], [360, 361], [388, 389]], [[23, 24], [46, 47], [69, 70], [91, 92], [114, 115], [136, 137], [159, 160], [184, 185], [209, 210], [232, 233], [257, 258], [280, 281], [303, 304], [327, 328], [350, 351], [375, 376]], [[26, 27], [50, 51], [74, 75], [98, 99], [122, 123], [147, 148], [170, 171], [193, 194], [217, 218], [240, 241], [264, 265], [287, 288], [311, 312], [336, 337], [359, 360], [383, 384]], [[22, 23], [46, 47], [71, 72], [94, 95], [115, 116], [140, 141], [162, 163], [184, 185], [208, 209], [232, 233], [254, 255], [279, 280], [303, 304], [327, 328], [350, 351], [374, 375]], [[21, 22], [45, 46], [68, 69], [92, 93], [116, 117], [140, 141], [163, 164], [186, 187], [211, 212], [235, 236], [257, 258], [282, 283], [305, 306], [328, 329], [352, 353], [376, 377]], [[23, 24], [44, 45], [66, 67], [89, 90], [113, 114], [138, 139], [162, 163], [184, 185], [208, 209], [231, 232], [255, 256], [278, 279], [303, 304], [327, 328], [349, 350], [372, 373]], [[21, 22], [45, 46], [69, 70], [92, 93], [116, 117], [140, 141], [162, 163], [187, 188], [211, 212], [234, 235], [259, 260], [281, 282], [304, 305], [327, 328], [351, 352], [374, 375]], [[22, 23], [49, 50], [72, 73], [94, 95], [118, 119], [141, 142], [166, 167], [192, 193], [216, 217], [241, 242], [264, 265], [287, 288], [312, 313], [339, 340], [363, 364], [386, 387]], [[23, 24], [48, 49], [72, 73], [96, 97], [122, 123], [146, 147], [171, 172], [196, 197], [218, 219], [241, 242], [265, 266], [288, 289], [311, 312], [333, 334], [359, 360], [383, 384]], [[21, 22], [47, 48], [70, 71], [95, 96], [119, 120], [145, 146], [167, 168], [190, 191], [215, 216], [238, 239], [261, 262], [285, 286], [307, 308], [332, 333], [357, 358], [380, 381]], [[21, 22], [47, 48], [70, 71], [93, 94], [116, 117], [139, 140], [164, 165], [187, 188], [213, 214], [237, 238], [262, 263], [286, 287], [309, 310], [334, 335], [358, 359], [383, 384]], [[21, 22], [45, 46], [68, 69], [91, 92], [114, 115], [137, 138], [162, 163], [184, 185], [211, 212], [236, 237], [259, 260], [285, 286], [308, 309], [332, 333], [356, 357], [380, 381]], [[22, 23], [46, 47], [71, 72], [98, 99], [119, 120], [144, 145], [168, 169], [195, 196], [220, 221], [244, 245], [270, 271], [293, 294], [316, 317], [341, 342], [364, 365], [387, 388]], [[22, 23], [47, 48], [72, 73], [96, 97], [118, 119], [142, 143], [166, 167], [190, 191], [214, 215], [239, 240], [264, 265], [287, 288], [312, 313], [336, 337], [358, 359], [382, 383]], [[22, 23], [44, 45], [70, 71], [93, 94], [118, 119], [141, 142], [164, 165], [187, 188], [211, 212], [235, 236], [258, 259], [281, 282], [303, 304], [327, 328], [350, 351], [373, 374]], [[22, 23], [44, 45], [69, 70], [93, 94], [116, 117], [139, 140], [162, 163], [187, 188], [212, 213], [235, 236], [260, 261], [283, 284], [307, 308], [331, 332], [355, 356], [378, 379]]], "input_ids": [[[198, 16587, 40844, 468, 257, 47565, 13, 1757, 468, 257, 11575, 13, 16753, 468, 257, 45489, 13, 16753, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 19139, 468, 8237, 13, 30223, 468, 257, 45540, 13, 10443, 468, 257, 47565, 13, 5502, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 3987, 2616, 468, 257, 26917, 13, 18678, 468, 309, 12, 15600, 13, 18496, 468, 257, 25286, 13, 18678, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 42, 5757, 468, 257, 11575, 13, 1757, 468, 257, 4346, 13, 16685, 468, 257, 16569, 13, 18678, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 24428, 8984, 468, 257, 18757, 13, 16738, 468, 14032, 13, 3977, 468, 257, 21657, 13, 19579, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 13256, 468, 257, 13224, 13, 3759, 468, 257, 18757, 13, 5502, 468, 257, 479, 14246, 72, 13, 3759, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 29458, 468, 257, 11575, 13, 6219, 468, 257, 4346, 13, 26918, 468, 6099, 13, 7212, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 20191, 468, 257, 3797, 13, 19579, 468, 257, 45540, 13, 32464, 468, 257, 19132, 13, 4502, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 43, 22261, 468, 12768, 13, 14430, 468, 12187, 13, 7806, 468, 257, 45314, 13, 21776, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 13256, 468, 257, 33039, 13, 48685, 468, 257, 11223, 538, 13, 3759, 468, 10012, 13, 3759, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 13056, 774, 468, 257, 9875, 13, 16348, 468, 48241, 13, 22695, 468, 6891, 13, 22695, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 23865, 468, 4171, 13, 3271, 468, 257, 26917, 13, 22132, 468, 257, 20461, 11729, 13, 7939, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 9914, 349, 468, 8237, 13, 7212, 468, 257, 11745, 13, 2940, 468, 257, 16569, 13, 7212, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 38025, 468, 257, 10047, 13, 14919, 468, 257, 22383, 13, 7212, 468, 257, 4346, 13, 14919, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 19962, 468, 257, 26593, 13, 22132, 468, 8887, 13, 10490, 468, 257, 9669, 13, 10490, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 49, 1071, 468, 257, 10147, 13, 10490, 468, 257, 479, 14246, 72, 13, 14919, 468, 257, 1660, 45690, 13, 22132, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 3987, 2616, 468, 257, 12967, 13, 14200, 468, 257, 10047, 13, 32464, 468, 257, 40968, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 10374, 39389, 468, 36656, 13, 12803, 468, 257, 20697, 13, 14200, 468, 11398, 13, 12803, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 22245, 468, 257, 8223, 13, 48685, 468, 257, 24554, 13, 36976, 468, 2266, 13, 48685, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 2484, 8045, 468, 13135, 13, 10490, 468, 2330, 13, 40349, 468, 36973, 13, 26918, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 43982, 468, 257, 3797, 13, 40349, 468, 257, 1097, 13, 32464, 468, 4077, 13, 32464, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 7371, 468, 4171, 13, 14430, 468, 257, 8223, 13, 15378, 468, 12768, 13, 14430, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 2484, 8045, 468, 14256, 13, 16753, 468, 4171, 13, 16348, 468, 257, 40968, 13, 26918, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 39324, 2788, 468, 257, 9669, 13, 5074, 468, 257, 17849, 13, 16348, 468, 257, 21831, 13, 23632, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 16587, 40844, 468, 257, 18607, 13, 16738, 468, 257, 45489, 13, 5658, 468, 257, 3797, 13, 16738, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 2484, 8045, 468, 8509, 13, 3362, 468, 257, 16569, 13, 3899, 468, 2266, 13, 26918, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 19156, 468, 257, 41478, 32650, 13, 5074, 468, 257, 26168, 13, 8982, 468, 257, 4346, 13, 5074, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 16587, 40844, 468, 12768, 13, 22132, 468, 14256, 13, 5074, 468, 257, 16569, 13, 36976, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 43187, 468, 257, 19132, 13, 32464, 468, 257, 25996, 13, 6219, 468, 12187, 13, 16348, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 9704, 468, 257, 35685, 13, 1757, 468, 257, 10147, 13, 3977, 468, 257, 18757, 13, 3977, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 29458, 468, 257, 37246, 13, 3759, 468, 4077, 13, 14200, 468, 257, 3072, 13, 14200, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 2484, 8045, 468, 257, 3290, 13, 30223, 468, 257, 24554, 13, 48685, 468, 257, 2485, 13, 26918, 257, 1611, 286, 7832, 5044, 30, 6407, 198]], [[198, 44203, 468, 257, 22365, 666, 13, 26918, 468, 281, 46593, 291, 313, 13, 29216, 468, 257, 38283, 13, 29216, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 28292, 468, 2042, 13, 3362, 468, 257, 3072, 13, 22695, 468, 257, 10047, 13, 22695, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 14731, 468, 257, 22383, 13, 40349, 468, 257, 2485, 13, 7516, 468, 257, 37246, 13, 7516, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 22405, 468, 257, 26917, 13, 30223, 468, 257, 1097, 13, 7516, 468, 257, 26593, 13, 30223, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 45842, 468, 281, 13133, 13, 3899, 468, 2330, 13, 1757, 468, 257, 38283, 13, 14919, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 10374, 39389, 468, 36973, 13, 26918, 468, 309, 12, 15600, 13, 8982, 468, 257, 4346, 13, 8982, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 43568, 468, 257, 11223, 538, 13, 3700, 468, 15900, 13, 16738, 468, 48241, 13, 3700, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 32697, 468, 257, 17849, 13, 29504, 468, 8887, 13, 16753, 468, 257, 25996, 13, 16753, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 48736, 468, 257, 20697, 13, 1757, 468, 4171, 20853, 13, 2940, 468, 257, 38283, 13, 2940, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 45842, 468, 257, 18607, 13, 7516, 468, 12187, 13, 36976, 468, 257, 18757, 13, 14919, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 17121, 468, 257, 26168, 13, 3759, 468, 257, 9875, 13, 5199, 468, 257, 1097, 13, 3977, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 45, 3883, 468, 12581, 13, 3700, 468, 2042, 13, 36976, 468, 257, 8223, 13, 36976, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 48736, 468, 257, 11745, 13, 23632, 468, 257, 10211, 13, 10674, 468, 257, 26593, 13, 23632, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 23865, 468, 257, 38283, 13, 7806, 468, 257, 35685, 13, 30223, 468, 257, 21202, 13, 7939, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 43, 22261, 468, 257, 26168, 13, 3362, 468, 14032, 13, 5502, 468, 6099, 13, 21776, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 43, 22261, 468, 13135, 13, 9953, 468, 257, 22383, 13, 14200, 468, 257, 2485, 13, 9953, 257, 1611, 286, 7832, 4144, 30, 10352, 198]], [[198, 38025, 468, 257, 10047, 13, 3977, 468, 257, 15224, 13, 36976, 468, 257, 20697, 13, 36976, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 22245, 468, 257, 19132, 13, 16753, 468, 257, 10147, 13, 7806, 468, 8509, 13, 6219, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 26374, 527, 306, 468, 11398, 13, 19579, 468, 257, 1097, 13, 1757, 468, 257, 9875, 13, 48685, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 44203, 468, 29219, 13, 19579, 468, 257, 50085, 13, 36976, 468, 257, 18744, 13, 15378, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 43687, 468, 12581, 13, 9953, 468, 6891, 13, 15378, 468, 48241, 13, 9953, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 10374, 39389, 468, 257, 18607, 13, 16738, 468, 257, 26241, 13, 7212, 468, 257, 26320, 13, 16685, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 46827, 468, 11398, 13, 5335, 468, 29219, 13, 8982, 468, 257, 20697, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 29284, 468, 257, 22802, 13, 14919, 468, 12187, 13, 26918, 468, 10012, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 9914, 349, 468, 11398, 13, 12803, 468, 257, 11575, 13, 8982, 468, 257, 49364, 13, 8982, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 19156, 468, 257, 1097, 13, 14200, 468, 257, 45314, 13, 8982, 468, 257, 9283, 13, 5199, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 29458, 468, 257, 10147, 13, 5335, 468, 4171, 13, 21776, 468, 13135, 13, 5335, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 10374, 39389, 468, 257, 10147, 13, 7939, 468, 8509, 13, 10490, 468, 257, 38283, 13, 10490, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 13256, 468, 257, 9669, 13, 14200, 468, 257, 1323, 13, 6219, 468, 257, 35685, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 19139, 468, 257, 21657, 13, 10674, 468, 36279, 13, 2940, 468, 257, 11223, 538, 13, 2940, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 7554, 468, 8509, 13, 7806, 468, 257, 3797, 13, 22132, 468, 257, 45540, 13, 7806, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 29284, 468, 4171, 20853, 13, 3700, 468, 257, 25996, 13, 5658, 468, 257, 24554, 13, 5658, 257, 1611, 286, 7832, 4144, 30, 6407, 198]], [[198, 13256, 468, 20584, 13, 7516, 468, 281, 20950, 13, 3271, 468, 257, 45489, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 10374, 39389, 468, 15900, 13, 32464, 468, 257, 4346, 13, 12803, 468, 257, 11575, 13, 32464, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 50, 15918, 468, 29219, 13, 1757, 468, 37191, 13, 3977, 468, 257, 35685, 13, 32464, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 9914, 349, 468, 257, 45489, 13, 10674, 468, 8509, 13, 6219, 468, 257, 18873, 13, 5074, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 29458, 468, 257, 12967, 13, 15378, 468, 257, 9669, 13, 22132, 468, 257, 26917, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 39324, 2788, 468, 257, 45489, 13, 14919, 468, 257, 4346, 13, 5074, 468, 37191, 13, 23632, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 32697, 468, 257, 22383, 13, 14919, 468, 4171, 20853, 13, 22132, 468, 2042, 13, 14919, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 11006, 468, 257, 22045, 13, 7516, 468, 257, 25286, 13, 5074, 468, 4077, 13, 5074, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 24119, 468, 281, 46593, 291, 313, 13, 15378, 468, 257, 9283, 13, 1757, 468, 36279, 13, 1757, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 7554, 468, 257, 20697, 13, 10490, 468, 257, 9669, 13, 48685, 468, 257, 16790, 13, 10490, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 43982, 468, 257, 3072, 13, 7806, 468, 4077, 13, 3759, 468, 15900, 13, 3759, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 2484, 8045, 468, 257, 17536, 13, 10443, 468, 257, 25996, 13, 3977, 468, 257, 20096, 13, 26918, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 11006, 468, 257, 26593, 13, 15378, 468, 257, 18757, 13, 22695, 468, 14032, 13, 22695, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 17121, 468, 257, 35446, 13, 30223, 468, 12187, 13, 16685, 468, 2042, 20853, 13, 3977, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 23672, 1940, 468, 257, 19132, 13, 29216, 468, 257, 22383, 13, 5658, 468, 4077, 13, 5658, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 28711, 468, 257, 9669, 13, 36976, 468, 257, 17849, 13, 29504, 468, 281, 13133, 13, 7516, 257, 1611, 286, 7832, 6332, 30, 6407, 198]], [[198, 10374, 39389, 468, 257, 11575, 13, 14430, 468, 21382, 1678, 13, 23632, 468, 257, 50085, 13, 16685, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 29458, 468, 2330, 13, 29504, 468, 6891, 13, 36976, 468, 26170, 13, 7212, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 28711, 468, 257, 3797, 13, 5502, 468, 12581, 13, 18496, 468, 14256, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 22245, 468, 257, 18757, 13, 22132, 468, 14256, 13, 5658, 468, 281, 13133, 13, 6219, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 24428, 8984, 468, 36279, 13, 2940, 468, 257, 26593, 13, 3759, 468, 257, 9283, 13, 3759, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 23672, 1940, 468, 257, 13224, 13, 5502, 468, 257, 33039, 13, 29504, 468, 257, 20697, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 3987, 2616, 468, 281, 17180, 13, 3977, 468, 257, 10147, 13, 5335, 468, 6099, 13, 29216, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 29284, 468, 6891, 13, 10674, 468, 2330, 13, 14200, 468, 257, 25996, 13, 10490, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 19156, 468, 21382, 1678, 13, 21776, 468, 257, 15224, 13, 8982, 468, 257, 17481, 13, 21776, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 48736, 468, 4171, 13, 14919, 468, 257, 49364, 13, 21776, 468, 257, 17536, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 48736, 468, 257, 35446, 13, 3977, 468, 257, 16569, 13, 30223, 468, 257, 25286, 13, 3977, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 22405, 468, 4171, 20853, 13, 5199, 468, 257, 3797, 13, 8982, 468, 12581, 13, 8982, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 9914, 349, 468, 257, 18744, 13, 18496, 468, 257, 13224, 13, 9953, 468, 257, 3797, 13, 18496, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 46827, 468, 26170, 13, 19579, 468, 257, 26593, 13, 10490, 468, 257, 11223, 538, 13, 10490, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 28292, 468, 8237, 13, 16348, 468, 4077, 13, 30223, 468, 257, 19132, 13, 16348, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 50, 15918, 468, 7872, 13, 2940, 468, 48241, 13, 16738, 468, 257, 25996, 13, 16738, 257, 1611, 286, 7832, 2057, 30, 10352, 198]], [[198, 48736, 468, 36973, 13, 36976, 468, 257, 22383, 13, 5502, 468, 257, 2485, 13, 5502, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 3987, 2616, 468, 257, 1097, 13, 48685, 468, 20584, 13, 5199, 468, 257, 9669, 13, 5199, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 43187, 468, 257, 35446, 13, 22695, 468, 257, 26593, 13, 48685, 468, 257, 21202, 13, 22695, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 43687, 468, 281, 20950, 13, 18678, 468, 257, 26320, 13, 21776, 468, 12768, 13, 21776, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 12130, 26654, 468, 26170, 13, 18678, 468, 257, 3290, 13, 23632, 468, 257, 9669, 13, 23632, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 44203, 468, 257, 1097, 13, 10674, 468, 257, 1660, 45690, 13, 14430, 468, 8509, 13, 15378, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 24119, 468, 37191, 13, 1757, 468, 4171, 13, 5502, 468, 281, 10912, 13, 5502, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 19139, 468, 257, 20461, 11729, 13, 16753, 468, 257, 33039, 13, 22132, 468, 257, 1323, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 22245, 468, 257, 8187, 13, 3899, 468, 257, 13224, 13, 14430, 468, 2042, 20853, 13, 3899, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 39324, 2788, 468, 14256, 13, 22695, 468, 26170, 13, 3899, 468, 257, 45314, 13, 23632, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 26374, 527, 306, 468, 7872, 13, 18678, 468, 257, 12967, 13, 19579, 468, 257, 38283, 13, 18678, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 13256, 468, 8509, 13, 7516, 468, 257, 1097, 13, 7212, 468, 4077, 13, 7516, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 48736, 468, 7872, 13, 5502, 468, 257, 11745, 13, 5658, 468, 257, 26917, 13, 5658, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 28292, 468, 10012, 13, 3700, 468, 2042, 20853, 13, 5658, 468, 257, 38283, 13, 5658, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 48736, 468, 257, 1097, 13, 7212, 468, 257, 18607, 13, 8982, 468, 257, 3072, 13, 16738, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 2484, 8045, 468, 12768, 13, 9953, 468, 257, 10047, 13, 14919, 468, 26170, 13, 14919, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 45842, 468, 281, 17180, 13, 18496, 468, 257, 2485, 13, 5502, 468, 257, 17536, 13, 5502, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 3987, 2616, 468, 257, 479, 14246, 72, 13, 16753, 468, 257, 22746, 13, 12803, 468, 257, 9283, 13, 16753, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 20191, 468, 257, 22383, 13, 8403, 468, 10012, 13, 18496, 468, 257, 22045, 13, 18496, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 11006, 468, 6174, 13, 7806, 468, 257, 35446, 13, 3362, 468, 12581, 13, 3271, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 24119, 468, 257, 4346, 13, 3899, 468, 257, 3072, 13, 18678, 468, 257, 10147, 13, 5335, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 24428, 8984, 468, 12581, 13, 3700, 468, 6891, 13, 30223, 468, 257, 17536, 13, 30223, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 26374, 527, 306, 468, 281, 10912, 13, 14430, 468, 257, 3290, 13, 2940, 468, 36279, 13, 2940, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 26374, 527, 306, 468, 257, 9283, 13, 21776, 468, 37191, 13, 3899, 468, 257, 19132, 13, 3899, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 23672, 1940, 468, 257, 10211, 13, 16685, 468, 257, 1097, 13, 10490, 468, 12187, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 7554, 468, 257, 3797, 13, 22132, 468, 257, 19132, 13, 10490, 468, 257, 22365, 666, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 24761, 468, 4171, 13, 3700, 468, 257, 20096, 13, 1757, 468, 257, 22746, 13, 8403, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 7554, 468, 257, 45540, 13, 6219, 468, 257, 35446, 13, 8403, 468, 8509, 13, 6219, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 49, 1071, 468, 257, 21202, 13, 23632, 468, 257, 26917, 13, 5199, 468, 257, 45314, 13, 22132, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 23672, 1940, 468, 257, 1097, 13, 7212, 468, 257, 479, 14246, 72, 13, 2940, 468, 257, 21831, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 50, 15918, 468, 7872, 13, 29504, 468, 257, 28738, 13, 15378, 468, 257, 11575, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 45842, 468, 2042, 13, 3977, 468, 257, 17536, 13, 5502, 468, 21382, 1678, 13, 14919, 257, 1611, 286, 7832, 4038, 30, 10352, 198]], [[198, 24428, 8984, 468, 257, 2485, 13, 32464, 468, 257, 38283, 13, 1757, 468, 257, 16790, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 43687, 468, 257, 22365, 666, 13, 16685, 468, 257, 35446, 13, 14430, 468, 257, 40968, 13, 16685, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 38025, 468, 257, 45489, 13, 6219, 468, 257, 1097, 13, 5658, 468, 281, 10912, 13, 5658, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 19156, 468, 4171, 20853, 13, 1757, 468, 257, 38283, 13, 29504, 468, 8887, 13, 5199, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 35, 273, 14863, 468, 257, 20096, 13, 6219, 468, 257, 35446, 13, 15378, 468, 257, 1097, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 23672, 1940, 468, 257, 18607, 13, 14200, 468, 257, 22746, 13, 15378, 468, 36656, 13, 15378, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 24428, 8984, 468, 257, 1323, 13, 14430, 468, 257, 3072, 13, 29216, 468, 257, 47565, 13, 19579, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 16587, 40844, 468, 257, 10047, 13, 6219, 468, 257, 45489, 13, 23632, 468, 257, 21831, 13, 6219, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 43568, 468, 257, 21202, 13, 5074, 468, 26170, 13, 3271, 468, 36656, 13, 5074, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 46827, 468, 257, 10147, 13, 7806, 468, 36279, 13, 3899, 468, 257, 28738, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 12130, 26654, 468, 36973, 13, 36976, 468, 257, 37246, 13, 22132, 468, 257, 13224, 13, 22132, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 44203, 468, 257, 49364, 13, 1757, 468, 257, 3797, 13, 19579, 468, 21029, 13, 15378, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 26497, 468, 4171, 20853, 13, 16685, 468, 15900, 13, 10674, 468, 257, 45489, 13, 16685, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 14731, 468, 257, 35446, 13, 22695, 468, 13135, 13, 7806, 468, 6174, 13, 22695, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 35, 273, 14863, 468, 309, 12, 15600, 13, 5658, 468, 257, 38283, 13, 3271, 468, 36973, 13, 40349, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 24761, 468, 257, 18873, 13, 5199, 468, 257, 8187, 13, 14919, 468, 257, 13224, 13, 14919, 257, 1611, 286, 7832, 17075, 30, 6407, 198]], [[198, 28711, 468, 257, 11575, 13, 9953, 468, 2042, 20853, 13, 8403, 468, 12187, 13, 8403, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 49, 1071, 468, 257, 20461, 11729, 13, 7516, 468, 257, 26320, 13, 7939, 468, 257, 17849, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 17121, 468, 257, 19132, 13, 18678, 468, 21382, 1678, 13, 3362, 468, 11398, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 43687, 468, 257, 21657, 13, 10674, 468, 257, 22365, 666, 13, 19579, 468, 257, 18607, 13, 16753, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 7554, 468, 257, 2485, 13, 10674, 468, 257, 38283, 13, 12803, 468, 257, 13224, 13, 10674, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 23672, 1940, 468, 257, 16790, 13, 22132, 468, 257, 41478, 32650, 13, 32464, 468, 257, 28738, 13, 14430, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 12041, 468, 13135, 13, 5074, 468, 2266, 13, 6219, 468, 257, 28738, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 29458, 468, 257, 11745, 13, 32464, 468, 29219, 13, 30223, 468, 257, 4346, 13, 32464, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 3987, 2616, 468, 257, 26593, 13, 16348, 468, 257, 18744, 13, 3899, 468, 257, 18607, 13, 3899, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 14731, 468, 20584, 13, 4502, 468, 257, 13224, 13, 23632, 468, 257, 26320, 13, 23632, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 7554, 468, 6891, 13, 19579, 468, 281, 20950, 13, 23632, 468, 257, 47565, 13, 19579, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 44203, 468, 257, 21202, 13, 8239, 468, 257, 9875, 13, 3759, 468, 257, 33039, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 20191, 468, 6174, 13, 10443, 468, 37191, 13, 5335, 468, 257, 20697, 13, 4502, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 3987, 2616, 468, 257, 28738, 13, 14200, 468, 257, 18607, 13, 18678, 468, 257, 18744, 13, 14200, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 3987, 2616, 468, 6174, 13, 5074, 468, 257, 22365, 666, 13, 7939, 468, 257, 45489, 13, 29216, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 29458, 468, 257, 35685, 13, 7516, 468, 257, 13224, 13, 5074, 468, 10012, 13, 7516, 257, 1611, 286, 7832, 9528, 30, 10352, 198]], [[198, 46827, 468, 257, 24554, 13, 7516, 468, 257, 11745, 13, 16753, 468, 15900, 13, 16753, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 12041, 468, 281, 46593, 291, 313, 13, 40349, 468, 281, 13133, 13, 23632, 468, 257, 9875, 13, 23632, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 42, 5757, 468, 20584, 13, 5658, 468, 257, 35685, 13, 8982, 468, 4077, 13, 18678, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 26497, 468, 257, 18757, 13, 5502, 468, 257, 11745, 13, 18678, 468, 8887, 13, 18678, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 32697, 468, 281, 17180, 13, 16685, 468, 12187, 13, 14200, 468, 257, 28738, 13, 16685, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 13256, 468, 257, 21657, 13, 2940, 468, 12768, 13, 8403, 468, 257, 20697, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 42, 5757, 468, 257, 45540, 13, 5502, 468, 257, 1097, 13, 14200, 468, 257, 9875, 13, 5502, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 19156, 468, 11398, 13, 7516, 468, 257, 4346, 13, 22695, 468, 257, 18744, 13, 5199, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 22245, 468, 257, 9669, 13, 8239, 468, 257, 49364, 13, 7939, 468, 257, 479, 14246, 72, 13, 6219, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 7554, 468, 281, 10912, 13, 32464, 468, 257, 18744, 13, 8403, 468, 257, 26593, 13, 8403, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 49, 1071, 468, 257, 25286, 13, 5335, 468, 257, 9283, 13, 18496, 468, 257, 24554, 13, 5335, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 29458, 468, 257, 13224, 13, 30223, 468, 257, 33039, 13, 2940, 468, 257, 9669, 13, 7212, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 20191, 468, 11398, 13, 26918, 468, 257, 16569, 13, 21776, 468, 257, 18607, 13, 26918, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 45842, 468, 257, 47565, 13, 18496, 468, 281, 17180, 13, 10674, 468, 257, 11223, 538, 13, 10674, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 49, 1071, 468, 2042, 13, 16685, 468, 257, 24554, 13, 3362, 468, 257, 12967, 13, 22132, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 26374, 527, 306, 468, 257, 13224, 13, 7806, 468, 257, 22746, 13, 16348, 468, 14032, 13, 48685, 257, 1611, 286, 7832, 3124, 30, 10352, 198]], [[198, 19139, 468, 29219, 13, 10490, 468, 257, 45314, 13, 18678, 468, 257, 18607, 13, 5502, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 24761, 468, 4171, 13, 2940, 468, 257, 20461, 11729, 13, 22695, 468, 257, 16790, 13, 22695, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 9704, 468, 257, 47565, 13, 40349, 468, 257, 18607, 13, 36976, 468, 48241, 13, 36976, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 3987, 2616, 468, 2042, 20853, 13, 23632, 468, 15900, 13, 10674, 468, 6174, 13, 10674, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 24761, 468, 12187, 13, 16348, 468, 309, 12, 15600, 13, 29216, 468, 4171, 13, 8403, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 29458, 468, 8237, 13, 3271, 468, 257, 22383, 13, 8982, 468, 257, 22802, 13, 7212, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 12130, 26654, 468, 257, 16790, 13, 7516, 468, 257, 11745, 13, 29504, 468, 257, 4346, 13, 30223, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 17121, 468, 2266, 13, 8239, 468, 257, 20096, 13, 48685, 468, 26170, 13, 8239, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 24428, 8984, 468, 257, 10147, 13, 5658, 468, 257, 9283, 13, 3977, 468, 257, 479, 14246, 72, 13, 5658, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 26374, 527, 306, 468, 6174, 13, 29504, 468, 257, 16790, 13, 23632, 468, 257, 26593, 13, 29504, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 43687, 468, 281, 13133, 13, 22132, 468, 281, 17180, 13, 10674, 468, 12581, 13, 10674, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 29458, 468, 7872, 13, 3759, 468, 281, 46593, 291, 313, 13, 48685, 468, 257, 10047, 13, 7212, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 20191, 468, 257, 13224, 13, 19579, 468, 13135, 13, 7806, 468, 257, 26593, 13, 7806, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 42, 5757, 468, 257, 16790, 13, 3362, 468, 2266, 13, 15378, 468, 257, 3797, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 9704, 468, 21382, 1678, 13, 5199, 468, 257, 35446, 13, 36976, 468, 257, 11745, 13, 2940, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 19139, 468, 257, 11745, 13, 22695, 468, 257, 3290, 13, 12803, 468, 257, 15224, 13, 12803, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 9914, 349, 468, 48241, 13, 6219, 468, 257, 25996, 13, 29216, 468, 257, 2485, 13, 6219, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 16587, 40844, 468, 257, 24554, 13, 14200, 468, 15900, 13, 3362, 468, 257, 45540, 13, 14200, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 19139, 468, 309, 12, 15600, 13, 10674, 468, 257, 13224, 13, 16685, 468, 257, 22746, 13, 10674, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 45842, 468, 257, 479, 14246, 72, 13, 5502, 468, 257, 41478, 32650, 13, 7212, 468, 257, 11575, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 22245, 468, 6174, 13, 8982, 468, 36973, 13, 23632, 468, 12768, 13, 6219, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 38025, 468, 257, 41478, 32650, 13, 7939, 468, 257, 37246, 13, 10674, 468, 257, 16569, 13, 12803, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 12621, 268, 468, 36973, 13, 7806, 468, 257, 17849, 13, 1757, 468, 257, 1323, 13, 1757, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 49, 1071, 468, 257, 22045, 13, 26918, 468, 257, 38283, 13, 15378, 468, 257, 479, 14246, 72, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 22405, 468, 257, 22365, 666, 13, 40349, 468, 257, 45489, 13, 8403, 468, 257, 2485, 13, 40349, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 19156, 468, 257, 25286, 13, 48685, 468, 257, 11745, 13, 6219, 468, 257, 1097, 13, 48685, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 12130, 26654, 468, 257, 18873, 13, 7806, 468, 257, 38283, 13, 16348, 468, 257, 18607, 13, 30223, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 7371, 468, 257, 37246, 13, 15378, 468, 26170, 13, 14200, 468, 257, 8223, 13, 15378, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 13256, 468, 4171, 13, 5658, 468, 257, 18757, 13, 14200, 468, 257, 15224, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 46827, 468, 257, 3290, 13, 14919, 468, 257, 1660, 45690, 13, 1757, 468, 257, 38283, 13, 14919, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 7554, 468, 4077, 13, 29216, 468, 257, 8223, 13, 14919, 468, 257, 22802, 13, 1757, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 19962, 468, 257, 35685, 13, 6219, 468, 257, 45540, 13, 10674, 468, 4077, 13, 10674, 257, 1611, 286, 7832, 3124, 30, 6407, 198]], [[198, 43982, 468, 13135, 13, 48685, 468, 257, 41478, 32650, 13, 3759, 468, 257, 21202, 13, 3759, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 32697, 468, 281, 46593, 291, 313, 13, 19579, 468, 26170, 13, 5335, 468, 257, 21831, 13, 5335, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 12621, 268, 468, 257, 45314, 13, 26918, 468, 257, 21202, 13, 8982, 468, 257, 20697, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 28711, 468, 257, 17849, 13, 14919, 468, 257, 21657, 13, 36976, 468, 4171, 20853, 13, 7516, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 24428, 8984, 468, 11398, 13, 6219, 468, 48241, 13, 10443, 468, 6891, 13, 19579, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 19156, 468, 257, 40968, 13, 7212, 468, 257, 8187, 13, 5658, 468, 257, 21831, 13, 5199, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 45842, 468, 257, 45489, 13, 8982, 468, 257, 18607, 13, 6219, 468, 21382, 1678, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 28292, 468, 257, 13224, 13, 18678, 468, 257, 22383, 13, 5074, 468, 257, 18607, 13, 18678, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 7554, 468, 257, 49364, 13, 23632, 468, 257, 10147, 13, 29216, 468, 281, 13133, 13, 23632, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 12621, 268, 468, 257, 41478, 32650, 13, 14919, 468, 15900, 13, 26918, 468, 257, 10147, 13, 14919, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 24119, 468, 257, 16790, 13, 8239, 468, 257, 10211, 13, 14200, 468, 257, 22365, 666, 13, 8239, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 19139, 468, 257, 35446, 13, 29504, 468, 257, 26593, 13, 5074, 468, 2330, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 19156, 468, 257, 47565, 13, 32464, 468, 257, 20461, 11729, 13, 18496, 468, 257, 16569, 13, 18496, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 43187, 468, 257, 11575, 13, 5658, 468, 281, 10912, 13, 29504, 468, 257, 9669, 13, 29504, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 45842, 468, 257, 50085, 13, 23632, 468, 14256, 13, 19579, 468, 8237, 13, 14919, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 19156, 468, 257, 19132, 13, 14200, 468, 12768, 13, 32464, 468, 281, 13133, 13, 32464, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198]], [[198, 39324, 2788, 468, 21029, 13, 7939, 468, 257, 26320, 13, 5335, 468, 257, 33039, 13, 7939, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 7554, 468, 10012, 13, 9953, 468, 257, 50085, 13, 22132, 468, 20584, 13, 1757, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 44203, 468, 257, 1660, 45690, 13, 23632, 468, 309, 12, 15600, 13, 22695, 468, 257, 26593, 13, 22695, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 45842, 468, 257, 38283, 13, 3700, 468, 36279, 13, 29216, 468, 8509, 13, 14919, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 43687, 468, 257, 26320, 13, 8403, 468, 257, 11223, 538, 13, 18678, 468, 257, 1097, 13, 16753, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 43187, 468, 257, 9669, 13, 40349, 468, 48241, 13, 8982, 468, 257, 19132, 13, 8982, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 14731, 468, 257, 12967, 13, 19579, 468, 12187, 13, 5199, 468, 257, 18757, 13, 5199, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 43187, 468, 257, 21202, 13, 16685, 468, 257, 37246, 13, 12803, 468, 13135, 13, 12803, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 29284, 468, 257, 4346, 13, 12803, 468, 257, 12967, 13, 48685, 468, 257, 10211, 13, 10490, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 35, 273, 14863, 468, 4077, 13, 3362, 468, 12581, 13, 26918, 468, 257, 10047, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 14731, 468, 4077, 13, 16738, 468, 257, 20697, 13, 18678, 468, 257, 22746, 13, 16738, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 50, 15918, 468, 257, 13224, 13, 16753, 468, 12187, 13, 10674, 468, 2330, 13, 16753, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 43568, 468, 2266, 13, 48685, 468, 2330, 13, 5502, 468, 257, 45489, 13, 5502, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 23672, 1940, 468, 257, 47565, 13, 22132, 468, 4077, 13, 21776, 468, 257, 18757, 13, 22132, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 2484, 8045, 468, 2042, 20853, 13, 7212, 468, 12581, 13, 3362, 468, 6174, 13, 3362, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 43687, 468, 257, 18757, 13, 36976, 468, 257, 40968, 13, 10490, 468, 4077, 13, 10490, 257, 1611, 286, 7832, 3124, 30, 6407, 198]], [[198, 3987, 2616, 468, 8237, 13, 26918, 468, 257, 10147, 13, 4502, 468, 257, 26168, 13, 26918, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 17121, 468, 257, 13224, 13, 3700, 468, 8887, 13, 48685, 468, 36279, 13, 3977, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 12130, 26654, 468, 257, 26320, 13, 7516, 468, 257, 10047, 13, 8403, 468, 257, 3072, 13, 30223, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 42, 5757, 468, 257, 49364, 13, 48685, 468, 4077, 13, 14919, 468, 257, 38283, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 12130, 26654, 468, 257, 9283, 13, 16348, 468, 26170, 13, 7516, 468, 2266, 13, 30223, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 24119, 468, 257, 21202, 13, 5199, 468, 257, 21657, 13, 10674, 468, 37191, 13, 5335, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 43, 22261, 468, 7872, 13, 3271, 468, 26170, 13, 3759, 468, 257, 18757, 13, 21776, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 16587, 40844, 468, 257, 4346, 13, 1757, 468, 281, 17180, 13, 5502, 468, 257, 17536, 13, 36976, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 7554, 468, 257, 9669, 13, 3899, 468, 257, 22365, 666, 13, 3759, 468, 257, 35685, 13, 1757, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 11006, 468, 10012, 13, 7516, 468, 257, 13224, 13, 16348, 468, 257, 9669, 13, 16348, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 23672, 1940, 468, 309, 12, 15600, 13, 14919, 468, 257, 22746, 13, 4502, 468, 36973, 13, 14430, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 13256, 468, 21029, 13, 19579, 468, 257, 9875, 13, 16738, 468, 257, 18744, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 43, 22261, 468, 257, 9283, 13, 10674, 468, 14032, 13, 23632, 468, 257, 17536, 13, 21776, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 50, 15918, 468, 257, 2485, 13, 16348, 468, 12768, 13, 8403, 468, 257, 22045, 13, 32464, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 2484, 8045, 468, 281, 13133, 13, 3700, 468, 4171, 13, 8982, 468, 257, 22045, 13, 26918, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 19156, 468, 257, 20697, 13, 5335, 468, 257, 49364, 13, 3899, 468, 2330, 13, 5199, 257, 1611, 286, 7832, 12833, 30, 6407, 198]]]}, "MlM_gen[genders_of_persons.TreeSet.equal,types_of_things.TreeSet.child][cxt_len=3,rev_item2str]": {"texts": ["\nThe piano is David's. The rabbit is Sharon's. The bread is Barbara's. Barbara a kind of likes food\nThe guitar is John's. The yellow is Donna's. The shoes is Michael's. John a kind of likes musical instrument\nThe rabbit is Sandra's. The bread is Elizabeth's. The wine is James's. James a kind of likes drink\nThe blue is Christopher's. The mosquito is Donald's. The pineapple is Helen's. Donald a kind of likes insect\nThe beetle is Christopher's. The T-shirt is Richard's. The gun is Jason's. Christopher a kind of likes insect\nThe mouse is Kimberly's. The uniform is Steven's. The blackberries is Elizabeth's. Steven a kind of likes clothing\nThe beetle is Ruth's. The goat is George's. The peach is Kevin's. Ruth a kind of likes insect\nThe strawberries is Joseph's. The guitar is Mary's. The red is Anthony's. Mary a kind of likes musical instrument\nThe beer is Kenneth's. The revolver is Deborah's. The iPad is John's. Kenneth a kind of likes drink\nThe pineapple is James's. The basketball is Donna's. The elephant is Susan's. Donna a kind of likes sport\nThe grenade is Deborah's. The basketball is Dorothy's. The taxi is Nancy's. Dorothy a kind of likes sport\nThe handgun is Sarah's. The blueberries is Laura's. The hamburger is William's. Laura a kind of likes fruit\nThe blue is Ronald's. The apple is Deborah's. The basketball is John's. John a kind of likes sport\nThe blackberries is Betty's. The sweater is Elizabeth's. The wolf is Mary's. Elizabeth a kind of likes clothing\nThe lemon is Kevin's. The guitar is Karen's. The sheep is Carol's. Karen a kind of likes musical instrument\nThe jeans is Nancy's. The pink is Ruth's. The guitar is Mark's. Nancy a kind of likes clothing\n", "\nThe red is Elizabeth's. The wine is Daniel's. The laptop is Ronald's. Ronald a kind of likes electronics\nThe basketball is James's. The sweater is Nancy's. The squirrel is Daniel's. James a kind of likes sport\nThe burger is Sarah's. The papaya is Michelle's. The cannon is Lisa's. Sarah a kind of likes food\nThe strawberries is Nancy's. The cake is Thomas's. The beer is William's. Thomas a kind of likes food\nThe basketball is John's. The shotgun is Michael's. The jacket is Donna's. Donna a kind of likes clothing\nThe baseball is Edward's. The soda is Jennifer's. The shotgun is Elizabeth's. Edward a kind of likes sport\nThe wolf is Jason's. The shotgun is Mark's. The peach is Donald's. Donald a kind of likes fruit\nThe kiwi is Richard's. The goose is Paul's. The red is Mark's. Mark a kind of likes color\nThe taxi is Kenneth's. The gorilla is Linda's. The spaghetti is Elizabeth's. Linda a kind of likes animal\nThe jeans is Kenneth's. The pink is Maria's. The car is George's. George a kind of likes vehicle\nThe steak is Susan's. The shoes is John's. The spaghetti is Kenneth's. John a kind of likes clothing\nThe mouse is Deborah's. The mango is Steven's. The football is Sarah's. Sarah a kind of likes sport\nThe jeep is Sarah's. The sheep is Jennifer's. The spaghetti is Elizabeth's. Jennifer a kind of likes animal\nThe apple is Kevin's. The coffee is Lisa's. The sheep is Linda's. Lisa a kind of likes drink\nThe car is Michelle's. The beetle is Elizabeth's. The donkey is Mary's. Michelle a kind of likes vehicle\nThe laptop is David's. The baseball is Michael's. The basketball is Kimberly's. David a kind of likes electronics\n", "\nThe jersey is Susan's. The pig is William's. The cocktail is Kenneth's. Kenneth a kind of likes drink\nThe squirrel is Steven's. The bread is Jason's. The tiger is Donald's. Jason a kind of likes food\nThe trousers is Kenneth's. The phone is Sarah's. The beer is Betty's. Betty a kind of likes drink\nThe meat is Brian's. The apricot is Michelle's. The red is Barbara's. Brian a kind of likes food\nThe blueberries is Jeff's. The bread is Michelle's. The horse is Donna's. Michelle a kind of likes food\nThe motorcycle is Elizabeth's. The cake is John's. The gorilla is Edward's. Elizabeth a kind of likes vehicle\nThe plum is Jennifer's. The soda is Ronald's. The mosquito is David's. David a kind of likes insect\nThe car is Jason's. The spaghetti is Christopher's. The violin is Anthony's. Anthony a kind of likes musical instrument\nThe rifle is Steven's. The wolf is Helen's. The kiwi is Susan's. Steven a kind of likes weapon\nThe pizza is Sarah's. The pineapple is Nancy's. The piano is Ronald's. Ronald a kind of likes musical instrument\nThe T-shirt is Jeff's. The beetle is Charles's. The donkey is Laura's. Charles a kind of likes insect\nThe tea is Donald's. The pizza is Brian's. The car is Michael's. Donald a kind of likes drink\nThe cow is Barbara's. The pineapple is Charles's. The violin is Kimberly's. Kimberly a kind of likes musical instrument\nThe mouse is William's. The whiskey is Donna's. The spaghetti is Jennifer's. William a kind of likes animal\nThe beetle is Mark's. The pear is Jeff's. The revolver is Sandra's. Mark a kind of likes insect\nThe black is John's. The tea is Sandra's. The cat is Richard's. John a kind of likes color\n", "\nThe white is Richard's. The burger is Anthony's. The horse is Mark's. Richard a kind of likes color\nThe handgun is Donna's. The steak is Michelle's. The coffee is Ronald's. Ronald a kind of likes drink\nThe yellow is Nancy's. The vodka is Carol's. The mosquito is Christopher's. Carol a kind of likes drink\nThe pistol is Jennifer's. The red is Robert's. The jersey is William's. William a kind of likes clothing\nThe smartphone is Thomas's. The strawberries is Lisa's. The shirt is Carol's. Thomas a kind of likes electronics\nThe dog is Kimberly's. The laptop is Robert's. The grapes is Anthony's. Robert a kind of likes electronics\nThe piano is Jennifer's. The white is Lisa's. The orange is Donna's. Jennifer a kind of likes musical instrument\nThe pants is Patricia's. The motorcycle is Linda's. The baseball is William's. William a kind of likes sport\nThe guitar is Mark's. The pistol is Kevin's. The lime is William's. Mark a kind of likes musical instrument\nThe red is Edward's. The donkey is Kimberly's. The pineapple is Karen's. Edward a kind of likes color\nThe green is Sharon's. The baseball is Patricia's. The pants is Margaret's. Margaret a kind of likes clothing\nThe pink is Ruth's. The lion is Michael's. The revolver is Laura's. Michael a kind of likes animal\nThe iPad is Lisa's. The football is James's. The watermelon is Betty's. James a kind of likes sport\nThe cow is Susan's. The banana is Margaret's. The soda is Deborah's. Deborah a kind of likes drink\nThe cannon is Christopher's. The sweater is William's. The bee is Karen's. Christopher a kind of likes weapon\nThe pear is Donald's. The basketball is Mark's. The jersey is Daniel's. Mark a kind of likes sport\n", "\nThe violin is Thomas's. The burger is Patricia's. The guitar is Jason's. Patricia a kind of likes food\nThe motorcycle is Mary's. The whiskey is William's. The trousers is Susan's. Mary a kind of likes vehicle\nThe donkey is Maria's. The bread is Helen's. The green is Michelle's. Michelle a kind of likes color\nThe steak is Linda's. The blackberries is Anthony's. The bus is Edward's. Linda a kind of likes food\nThe green is Michelle's. The pear is Robert's. The cocktail is Dorothy's. Dorothy a kind of likes drink\nThe peach is Kenneth's. The goose is Jennifer's. The piano is Sharon's. Sharon a kind of likes musical instrument\nThe deer is Betty's. The steak is David's. The shoes is James's. Betty a kind of likes animal\nThe pizza is Charles's. The durian is Laura's. The whiskey is Richard's. Charles a kind of likes food\nThe baseball is Michelle's. The cow is Kevin's. The phone is Elizabeth's. Michelle a kind of likes sport\nThe mosquito is George's. The watermelon is Linda's. The piano is Margaret's. Linda a kind of likes fruit\nThe sweater is Karen's. The dog is Kevin's. The steak is Elizabeth's. Kevin a kind of likes animal\nThe mango is Dorothy's. The shotgun is Steven's. The bus is Deborah's. Steven a kind of likes weapon\nThe tiger is Sharon's. The durian is Kimberly's. The cocktail is Nancy's. Kimberly a kind of likes fruit\nThe shoes is Barbara's. The cake is Sandra's. The pear is Maria's. Barbara a kind of likes clothing\nThe uniform is Edward's. The guitar is Michael's. The squirrel is John's. Michael a kind of likes musical instrument\nThe cherries is John's. The pig is William's. The beer is Michelle's. John a kind of likes fruit\n", "\nThe pineapple is John's. The mosquito is Richard's. The bread is Brian's. Richard a kind of likes insect\nThe green is Jeff's. The durian is Kimberly's. The pistol is Susan's. Susan a kind of likes weapon\nThe trousers is Maria's. The rifle is Mark's. The basketball is William's. Mark a kind of likes weapon\nThe cake is Jennifer's. The pink is Kenneth's. The coffee is James's. Kenneth a kind of likes color\nThe guitar is Patricia's. The pistol is Mary's. The taxi is Charles's. Patricia a kind of likes musical instrument\nThe baseball is Mary's. The costume is Karen's. The lion is Daniel's. Mary a kind of likes sport\nThe blueberries is Ruth's. The basketball is Kimberly's. The mango is Jennifer's. Kimberly a kind of likes sport\nThe sweater is Mary's. The jeans is Carol's. The gray is Sandra's. Sandra a kind of likes color\nThe goose is Karen's. The mosquito is Robert's. The monkey is Betty's. Robert a kind of likes insect\nThe durian is Mary's. The gun is Patricia's. The wolf is Sandra's. Sandra a kind of likes animal\nThe steak is Patricia's. The monkey is Thomas's. The pink is Donald's. Donald a kind of likes color\nThe piano is Christopher's. The white is David's. The banana is Donald's. Christopher a kind of likes musical instrument\nThe baseball is Michelle's. The hamburger is Margaret's. The cake is Mary's. Michelle a kind of likes sport\nThe rabbit is Steven's. The piano is Jeff's. The pink is Dorothy's. Jeff a kind of likes musical instrument\nThe smartphone is Michelle's. The hamburger is Ruth's. The car is Joseph's. Michelle a kind of likes electronics\nThe lime is Kimberly's. The wolf is Dorothy's. The football is Sarah's. Sarah a kind of likes sport\n", "\nThe pizza is Donna's. The smartphone is Brian's. The pear is Mary's. Brian a kind of likes electronics\nThe goose is Charles's. The whiskey is Kenneth's. The laptop is Maria's. Maria a kind of likes electronics\nThe apple is Kimberly's. The pistol is Jennifer's. The violin is Linda's. Linda a kind of likes musical instrument\nThe basketball is Michael's. The motorcycle is Christopher's. The violin is Linda's. Christopher a kind of likes vehicle\nThe rabbit is Deborah's. The pizza is Linda's. The jacket is Mark's. Mark a kind of likes clothing\nThe smartphone is John's. The cake is Joseph's. The jacket is Michelle's. Joseph a kind of likes food\nThe iPad is Steven's. The tea is George's. The sweater is Karen's. Steven a kind of likes electronics\nThe shotgun is Nancy's. The phone is Kenneth's. The deer is Deborah's. Nancy a kind of likes weapon\nThe beetle is Michael's. The tiger is Nancy's. The T-shirt is Anthony's. Michael a kind of likes insect\nThe piano is Kimberly's. The costume is Michelle's. The gun is Maria's. Kimberly a kind of likes musical instrument\nThe taxi is Nancy's. The revolver is Steven's. The car is Kevin's. Steven a kind of likes weapon\nThe black is Margaret's. The juice is Christopher's. The duck is Patricia's. Christopher a kind of likes drink\nThe handgun is Margaret's. The costume is Mark's. The soda is Robert's. Margaret a kind of likes weapon\nThe horse is Dorothy's. The motorcycle is Lisa's. The mango is Margaret's. Dorothy a kind of likes animal\nThe rifle is Elizabeth's. The tiger is Donald's. The piano is James's. James a kind of likes musical instrument\nThe beer is Richard's. The beetle is William's. The goat is Jeff's. Richard a kind of likes drink\n", "\nThe pig is Sharon's. The peach is Barbara's. The smartphone is Dorothy's. Dorothy a kind of likes electronics\nThe football is Donald's. The blackberries is William's. The blue is Kenneth's. Donald a kind of likes sport\nThe cocktail is Sharon's. The spaghetti is Steven's. The elephant is Jennifer's. Steven a kind of likes food\nThe vodka is Brian's. The yellow is William's. The smartphone is Donna's. Donna a kind of likes electronics\nThe monkey is Karen's. The jeans is James's. The spaghetti is Joseph's. Karen a kind of likes animal\nThe squirrel is Edward's. The jacket is John's. The red is Richard's. John a kind of likes clothing\nThe elephant is Helen's. The durian is Jason's. The car is Michael's. Jason a kind of likes fruit\nThe phone is Anthony's. The bus is Daniel's. The white is Dorothy's. Daniel a kind of likes vehicle\nThe beetle is Helen's. The goat is Daniel's. The black is Dorothy's. Helen a kind of likes insect\nThe rabbit is George's. The whiskey is Nancy's. The motorcycle is Maria's. Nancy a kind of likes drink\nThe cow is George's. The mosquito is Christopher's. The banana is Joseph's. Christopher a kind of likes insect\nThe banana is Ronald's. The costume is Jennifer's. The horse is Mark's. Jennifer a kind of likes clothing\nThe pig is Michelle's. The gun is William's. The vodka is Jason's. Michelle a kind of likes animal\nThe hamburger is Helen's. The rabbit is Karen's. The grapes is Paul's. Karen a kind of likes animal\nThe meat is Sharon's. The rifle is Helen's. The blue is Dorothy's. Sharon a kind of likes food\nThe gray is Michael's. The monkey is Laura's. The car is John's. John a kind of likes vehicle\n", "\nThe tea is Edward's. The bee is Lisa's. The phone is Michael's. Lisa a kind of likes insect\nThe jeep is Carol's. The bee is Anthony's. The orange is Ronald's. Ronald a kind of likes fruit\nThe gun is Jason's. The pear is Deborah's. The mouse is Sandra's. Deborah a kind of likes fruit\nThe burger is Jennifer's. The lion is Brian's. The shotgun is John's. John a kind of likes weapon\nThe shotgun is Kenneth's. The steak is James's. The wine is Richard's. Richard a kind of likes drink\nThe black is Ronald's. The donkey is Betty's. The handgun is Michelle's. Ronald a kind of likes color\nThe pear is David's. The vodka is Dorothy's. The peach is Maria's. Dorothy a kind of likes drink\nThe pig is Jason's. The sheep is Betty's. The sweater is Christopher's. Christopher a kind of likes clothing\nThe violin is Paul's. The rifle is Margaret's. The yellow is Linda's. Paul a kind of likes musical instrument\nThe plum is Charles's. The taxi is David's. The goat is Jeff's. Jeff a kind of likes animal\nThe smartphone is Michael's. The whiskey is Edward's. The banana is Linda's. Michael a kind of likes electronics\nThe yellow is David's. The iPad is Helen's. The revolver is Karen's. Helen a kind of likes electronics\nThe coffee is Sarah's. The sweater is John's. The duck is Michael's. John a kind of likes clothing\nThe trousers is William's. The soda is Anthony's. The tiger is David's. William a kind of likes clothing\nThe banana is Robert's. The basketball is William's. The sweater is Helen's. William a kind of likes sport\nThe motorcycle is Elizabeth's. The smartphone is Helen's. The tea is Jeff's. Jeff a kind of likes drink\n", "\nThe phone is Paul's. The violin is Carol's. The white is Sandra's. Carol a kind of likes musical instrument\nThe lion is Dorothy's. The banana is Donna's. The underwear is Ronald's. Ronald a kind of likes clothing\nThe hamburger is Jeff's. The grenade is Ronald's. The pink is Christopher's. Christopher a kind of likes color\nThe phone is Patricia's. The guitar is Charles's. The whiskey is Maria's. Maria a kind of likes drink\nThe durian is Karen's. The football is George's. The shirt is Kevin's. George a kind of likes sport\nThe pistol is Patricia's. The smartphone is Charles's. The football is Betty's. Patricia a kind of likes weapon\nThe cannon is Patricia's. The laptop is Michelle's. The duck is Steven's. Michelle a kind of likes electronics\nThe pistol is Patricia's. The grapes is Thomas's. The squirrel is Mark's. Patricia a kind of likes weapon\nThe meat is Kimberly's. The pistol is Betty's. The burger is Kenneth's. Betty a kind of likes weapon\nThe iPad is Linda's. The apple is Kimberly's. The pants is Thomas's. Thomas a kind of likes clothing\nThe football is Kenneth's. The whiskey is Susan's. The plum is Helen's. Kenneth a kind of likes sport\nThe jacket is Carol's. The gray is Edward's. The car is Brian's. Brian a kind of likes vehicle\nThe bread is Jason's. The cherries is Donna's. The beer is Ruth's. Ruth a kind of likes drink\nThe duck is John's. The spaghetti is Maria's. The white is Elizabeth's. Elizabeth a kind of likes color\nThe rifle is Kenneth's. The beetle is Maria's. The cocktail is Barbara's. Maria a kind of likes insect\nThe football is Dorothy's. The bus is James's. The costume is William's. Dorothy a kind of likes sport\n", "\nThe tea is Donna's. The pink is Michelle's. The rifle is David's. David a kind of likes weapon\nThe mosquito is Ruth's. The trousers is Steven's. The peach is Barbara's. Barbara a kind of likes fruit\nThe whiskey is Elizabeth's. The tiger is John's. The bus is Christopher's. Elizabeth a kind of likes drink\nThe red is Lisa's. The football is Sandra's. The duck is William's. Sandra a kind of likes sport\nThe juice is Edward's. The hamburger is Kimberly's. The cannon is Donald's. Donald a kind of likes weapon\nThe motorcycle is Linda's. The soda is Jason's. The baseball is Kenneth's. Kenneth a kind of likes sport\nThe peach is Linda's. The shotgun is Susan's. The cake is James's. James a kind of likes food\nThe motorcycle is Paul's. The sweater is Sarah's. The blue is Daniel's. Sarah a kind of likes clothing\nThe underwear is Helen's. The red is Joseph's. The uniform is Paul's. Joseph a kind of likes color\nThe purple is Michelle's. The guitar is Paul's. The squirrel is Nancy's. Paul a kind of likes musical instrument\nThe red is James's. The piano is Michael's. The laptop is Joseph's. James a kind of likes color\nThe papaya is Susan's. The baseball is Donald's. The cat is Nancy's. Donald a kind of likes sport\nThe cow is David's. The iPad is Dorothy's. The blue is Nancy's. Dorothy a kind of likes electronics\nThe cannon is Kevin's. The motorcycle is Brian's. The pig is Carol's. Brian a kind of likes vehicle\nThe purple is Kimberly's. The jeep is Betty's. The banana is Sarah's. Betty a kind of likes vehicle\nThe hamburger is Kevin's. The orange is Ronald's. The costume is Michael's. Kevin a kind of likes food\n", "\nThe phone is William's. The handgun is Sharon's. The bus is Michelle's. William a kind of likes electronics\nThe cake is Jennifer's. The lime is Ronald's. The jersey is John's. Jennifer a kind of likes food\nThe dog is Jeff's. The beer is Mark's. The deer is Sharon's. Mark a kind of likes drink\nThe lion is Richard's. The horse is Jennifer's. The motorcycle is Steven's. Steven a kind of likes vehicle\nThe piano is John's. The watermelon is Betty's. The meat is Sarah's. Sarah a kind of likes food\nThe durian is Ruth's. The motorcycle is David's. The blue is Brian's. David a kind of likes vehicle\nThe pink is Karen's. The lemon is Sharon's. The car is Margaret's. Karen a kind of likes color\nThe jeans is Jennifer's. The wine is Anthony's. The watermelon is Jason's. Jennifer a kind of likes clothing\nThe iPad is Sharon's. The blue is James's. The duck is Jason's. Sharon a kind of likes electronics\nThe pizza is Mary's. The pistol is Dorothy's. The cat is Robert's. Mary a kind of likes food\nThe bee is Charles's. The football is Ronald's. The papaya is Jennifer's. Jennifer a kind of likes fruit\nThe pizza is Ronald's. The deer is Linda's. The mango is David's. David a kind of likes fruit\nThe soda is Nancy's. The black is Kevin's. The cannon is Anthony's. Anthony a kind of likes weapon\nThe pizza is George's. The goose is John's. The juice is Jennifer's. George a kind of likes food\nThe underwear is Paul's. The taxi is Michael's. The apricot is Patricia's. Michael a kind of likes vehicle\nThe white is Helen's. The uniform is Joseph's. The peach is Patricia's. Helen a kind of likes color\n", "\nThe motorcycle is Mark's. The hamburger is William's. The donkey is Robert's. William a kind of likes food\nThe lime is John's. The pig is Michael's. The violin is Nancy's. Michael a kind of likes animal\nThe underwear is Helen's. The whiskey is Michelle's. The violin is William's. William a kind of likes musical instrument\nThe wine is Edward's. The iPad is Elizabeth's. The yellow is Linda's. Elizabeth a kind of likes electronics\nThe jacket is Jason's. The guitar is Michelle's. The car is Ronald's. Ronald a kind of likes vehicle\nThe spaghetti is Deborah's. The squirrel is Dorothy's. The car is William's. Deborah a kind of likes food\nThe cow is Laura's. The cherries is Ruth's. The beer is Daniel's. Daniel a kind of likes drink\nThe basketball is Nancy's. The jacket is Ruth's. The yellow is Christopher's. Christopher a kind of likes color\nThe durian is George's. The white is John's. The pants is Margaret's. John a kind of likes color\nThe meat is Steven's. The mosquito is Richard's. The underwear is Helen's. Steven a kind of likes food\nThe guitar is Helen's. The pizza is Barbara's. The rabbit is Susan's. Helen a kind of likes musical instrument\nThe gray is Nancy's. The tea is Ruth's. The soda is Robert's. Nancy a kind of likes color\nThe vodka is Laura's. The uniform is Carol's. The blueberries is Susan's. Carol a kind of likes clothing\nThe plum is Carol's. The kiwi is Edward's. The gun is Dorothy's. Dorothy a kind of likes weapon\nThe beer is Linda's. The cake is Christopher's. The strawberries is Richard's. Linda a kind of likes drink\nThe costume is Kevin's. The pistol is Karen's. The jeep is John's. John a kind of likes vehicle\n", "\nThe phone is Brian's. The violin is Donald's. The plum is John's. John a kind of likes fruit\nThe squirrel is Linda's. The uniform is Donna's. The plum is William's. Donna a kind of likes clothing\nThe motorcycle is Jennifer's. The black is Kevin's. The shotgun is Jason's. Kevin a kind of likes color\nThe pistol is Elizabeth's. The hamburger is Kenneth's. The jacket is Mary's. Mary a kind of likes clothing\nThe basketball is Mark's. The vodka is Kimberly's. The pizza is Thomas's. Mark a kind of likes sport\nThe iPad is Carol's. The steak is Jason's. The donkey is Robert's. Carol a kind of likes electronics\nThe iPad is Anthony's. The goose is Sharon's. The watermelon is Daniel's. Anthony a kind of likes electronics\nThe strawberries is Thomas's. The jersey is Patricia's. The blue is Steven's. Patricia a kind of likes clothing\nThe pizza is Jeff's. The black is Robert's. The horse is Joseph's. Jeff a kind of likes food\nThe smartphone is David's. The steak is Betty's. The pink is Richard's. Betty a kind of likes food\nThe blue is Patricia's. The coffee is Donna's. The pizza is Charles's. Charles a kind of likes food\nThe bus is Barbara's. The sheep is Donald's. The pants is Ruth's. Ruth a kind of likes clothing\nThe white is Donald's. The jacket is Jennifer's. The violin is Kevin's. Kevin a kind of likes musical instrument\nThe bee is Thomas's. The bread is Lisa's. The motorcycle is Sarah's. Lisa a kind of likes food\nThe trousers is Betty's. The wolf is Karen's. The kiwi is Lisa's. Lisa a kind of likes fruit\nThe wine is Sharon's. The rabbit is Jennifer's. The deer is Jason's. Sharon a kind of likes drink\n", "\nThe mouse is Carol's. The blue is Jennifer's. The iPad is Jason's. Jason a kind of likes electronics\nThe coffee is Steven's. The violin is Sandra's. The basketball is Karen's. Steven a kind of likes drink\nThe iPad is Charles's. The lime is William's. The rabbit is Michelle's. William a kind of likes fruit\nThe football is John's. The spaghetti is Anthony's. The red is Carol's. John a kind of likes sport\nThe pig is Thomas's. The wine is Kimberly's. The bee is Paul's. Paul a kind of likes insect\nThe mango is George's. The lion is Susan's. The hamburger is Ronald's. George a kind of likes fruit\nThe football is Elizabeth's. The fox is Jeff's. The shotgun is Mary's. Elizabeth a kind of likes sport\nThe gorilla is Ruth's. The motorcycle is Kenneth's. The apple is Anthony's. Anthony a kind of likes fruit\nThe blue is Elizabeth's. The motorcycle is Margaret's. The pizza is Michelle's. Margaret a kind of likes vehicle\nThe bread is James's. The durian is Sarah's. The guitar is Charles's. Charles a kind of likes musical instrument\nThe red is Karen's. The papaya is Daniel's. The cocktail is Elizabeth's. Elizabeth a kind of likes drink\nThe gray is Barbara's. The goose is Kimberly's. The shotgun is Margaret's. Barbara a kind of likes color\nThe strawberries is Edward's. The guitar is Jennifer's. The sheep is Robert's. Jennifer a kind of likes musical instrument\nThe grenade is Sarah's. The car is Betty's. The deer is Sharon's. Betty a kind of likes vehicle\nThe uniform is Joseph's. The iPad is Sarah's. The mosquito is Mark's. Sarah a kind of likes electronics\nThe squirrel is Charles's. The cherries is Joseph's. The iPad is Nancy's. Joseph a kind of likes fruit\n", "\nThe horse is Helen's. The motorcycle is Barbara's. The phone is Betty's. Betty a kind of likes electronics\nThe cocktail is Jason's. The costume is Maria's. The bee is Michelle's. Michelle a kind of likes insect\nThe kiwi is James's. The cannon is Mary's. The baseball is Michelle's. James a kind of likes fruit\nThe mango is Joseph's. The baseball is Mark's. The costume is Betty's. Mark a kind of likes sport\nThe rabbit is James's. The black is Kimberly's. The mosquito is William's. William a kind of likes insect\nThe beetle is Christopher's. The taxi is David's. The iPad is Joseph's. Joseph a kind of likes electronics\nThe cannon is Jeff's. The tiger is Elizabeth's. The underwear is Daniel's. Jeff a kind of likes weapon\nThe strawberries is Edward's. The beetle is Joseph's. The sheep is Ronald's. Joseph a kind of likes insect\nThe cherries is Maria's. The mosquito is Mary's. The shoes is Barbara's. Maria a kind of likes fruit\nThe wolf is Richard's. The lime is Ronald's. The guitar is Karen's. Richard a kind of likes animal\nThe pistol is Elizabeth's. The uniform is Mark's. The rifle is Donald's. Mark a kind of likes clothing\nThe coffee is James's. The pants is Jeff's. The phone is Laura's. Laura a kind of likes electronics\nThe cocktail is Brian's. The donkey is John's. The gun is Patricia's. Brian a kind of likes drink\nThe lion is John's. The tea is Richard's. The grapes is Nancy's. Richard a kind of likes drink\nThe plum is Maria's. The grenade is Linda's. The cat is Laura's. Laura a kind of likes animal\nThe gorilla is Kimberly's. The banana is Margaret's. The motorcycle is Laura's. Margaret a kind of likes fruit\n"], "bos": [[[23, 24], [48, 49], [74, 75], [99, 100], [126, 127], [152, 153], [177, 178], [202, 203], [228, 229], [253, 254], [278, 279], [305, 306], [330, 331], [356, 357], [381, 382], [407, 408]], [[23, 24], [48, 49], [74, 75], [99, 100], [124, 125], [149, 150], [174, 175], [201, 202], [226, 227], [251, 252], [276, 277], [301, 302], [327, 328], [352, 353], [377, 378], [402, 403]], [[23, 24], [48, 49], [73, 74], [100, 101], [126, 127], [151, 152], [176, 177], [201, 202], [229, 230], [254, 255], [282, 283], [307, 308], [332, 333], [358, 359], [383, 384], [408, 409]], [[23, 24], [48, 49], [73, 74], [98, 99], [123, 124], [148, 149], [173, 174], [199, 200], [224, 225], [250, 251], [275, 276], [300, 301], [326, 327], [351, 352], [376, 377], [401, 402]], [[23, 24], [48, 49], [73, 74], [99, 100], [124, 125], [149, 150], [175, 176], [201, 202], [226, 227], [252, 253], [277, 278], [302, 303], [328, 329], [353, 354], [378, 379], [405, 406]], [[23, 24], [49, 50], [74, 75], [99, 100], [124, 125], [150, 151], [176, 177], [201, 202], [226, 227], [252, 253], [277, 278], [302, 303], [329, 330], [354, 355], [381, 382], [406, 407]], [[23, 24], [48, 49], [73, 74], [99, 100], [124, 125], [149, 150], [174, 175], [199, 200], [226, 227], [251, 252], [277, 278], [302, 303], [327, 328], [352, 353], [377, 378], [403, 404]], [[23, 24], [49, 50], [74, 75], [99, 100], [124, 125], [149, 150], [175, 176], [200, 201], [225, 226], [250, 251], [275, 276], [300, 301], [325, 326], [351, 352], [376, 377], [401, 402]], [[23, 24], [49, 50], [74, 75], [99, 100], [124, 125], [149, 150], [174, 175], [199, 200], [224, 225], [250, 251], [275, 276], [300, 301], [325, 326], [350, 351], [375, 376], [400, 401]], [[23, 24], [49, 50], [75, 76], [100, 101], [126, 127], [151, 152], [176, 177], [201, 202], [226, 227], [251, 252], [276, 277], [301, 302], [327, 328], [352, 353], [377, 378], [402, 403]], [[23, 24], [48, 49], [73, 74], [98, 99], [124, 125], [149, 150], [174, 175], [199, 200], [224, 225], [249, 250], [275, 276], [301, 302], [326, 327], [351, 352], [377, 378], [403, 404]], [[23, 24], [48, 49], [73, 74], [98, 99], [124, 125], [150, 151], [175, 176], [201, 202], [226, 227], [251, 252], [277, 278], [302, 303], [327, 328], [352, 353], [379, 380], [404, 405]], [[24, 25], [49, 50], [74, 75], [100, 101], [125, 126], [150, 151], [176, 177], [201, 202], [227, 228], [252, 253], [277, 278], [303, 304], [329, 330], [356, 357], [381, 382], [407, 408]], [[23, 24], [48, 49], [73, 74], [99, 100], [124, 125], [149, 150], [175, 176], [200, 201], [225, 226], [250, 251], [275, 276], [300, 301], [325, 326], [351, 352], [378, 379], [403, 404]], [[23, 24], [48, 49], [73, 74], [98, 99], [123, 124], [149, 150], [174, 175], [199, 200], [224, 225], [250, 251], [277, 278], [302, 303], [327, 328], [353, 354], [378, 379], [404, 405]], [[23, 24], [48, 49], [75, 76], [100, 101], [125, 126], [150, 151], [175, 176], [200, 201], [226, 227], [251, 252], [276, 277], [301, 302], [326, 327], [351, 352], [376, 377], [401, 402]]], "input_ids": [[[198, 464, 19132, 318, 3271, 338, 13, 383, 22746, 318, 26918, 338, 13, 383, 8509, 318, 16685, 338, 13, 16685, 257, 1611, 286, 7832, 2057, 198, 464, 10047, 318, 1757, 338, 13, 383, 7872, 318, 29216, 338, 13, 383, 10012, 318, 3899, 338, 13, 1757, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 22746, 318, 32464, 338, 13, 383, 8509, 318, 10674, 338, 13, 383, 8237, 318, 3700, 338, 13, 3700, 257, 1611, 286, 7832, 4144, 198, 464, 4171, 318, 12803, 338, 13, 383, 35446, 318, 3759, 338, 13, 383, 45540, 318, 22695, 338, 13, 3759, 257, 1611, 286, 7832, 12833, 198, 464, 45489, 318, 12803, 338, 13, 383, 309, 12, 15600, 318, 6219, 338, 13, 383, 2485, 318, 8982, 338, 13, 12803, 257, 1611, 286, 7832, 12833, 198, 464, 10211, 318, 48685, 338, 13, 383, 8187, 318, 8239, 338, 13, 383, 2042, 20853, 318, 10674, 338, 13, 8239, 257, 1611, 286, 7832, 9528, 198, 464, 45489, 318, 22132, 338, 13, 383, 26917, 318, 4502, 338, 13, 383, 47565, 318, 7939, 338, 13, 22132, 257, 1611, 286, 7832, 12833, 198, 464, 36973, 318, 7212, 338, 13, 383, 10047, 318, 5335, 338, 13, 383, 2266, 318, 9953, 338, 13, 5335, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 6099, 318, 23632, 338, 13, 383, 40968, 318, 36976, 338, 13, 383, 13133, 318, 1757, 338, 13, 23632, 257, 1611, 286, 7832, 4144, 198, 464, 45540, 318, 3700, 338, 13, 383, 9669, 318, 29216, 338, 13, 383, 20950, 318, 14919, 338, 13, 29216, 257, 1611, 286, 7832, 6332, 198, 464, 26168, 318, 36976, 338, 13, 383, 9669, 318, 40349, 338, 13, 383, 17536, 318, 18496, 338, 13, 40349, 257, 1611, 286, 7832, 6332, 198, 464, 17849, 318, 10490, 338, 13, 383, 4171, 20853, 318, 16753, 338, 13, 383, 41478, 32650, 318, 3977, 338, 13, 16753, 257, 1611, 286, 7832, 8234, 198, 464, 4171, 318, 14430, 338, 13, 383, 17180, 318, 36976, 338, 13, 383, 9669, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 6332, 198, 464, 2042, 20853, 318, 29504, 338, 13, 383, 35685, 318, 10674, 338, 13, 383, 17481, 318, 5335, 338, 13, 10674, 257, 1611, 286, 7832, 9528, 198, 464, 18873, 318, 7939, 338, 13, 383, 10047, 318, 18678, 338, 13, 383, 15900, 318, 5074, 338, 13, 18678, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 21029, 318, 18496, 338, 13, 383, 11398, 318, 22132, 338, 13, 383, 10047, 318, 2940, 338, 13, 18496, 257, 1611, 286, 7832, 9528, 198]], [[198, 464, 2266, 318, 10674, 338, 13, 383, 8237, 318, 7806, 338, 13, 383, 13224, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 17075, 198, 464, 9669, 318, 3700, 338, 13, 383, 35685, 318, 18496, 338, 13, 383, 33039, 318, 7806, 338, 13, 3700, 257, 1611, 286, 7832, 6332, 198, 464, 26593, 318, 10490, 338, 13, 383, 20461, 11729, 318, 16738, 338, 13, 383, 21202, 318, 15378, 338, 13, 10490, 257, 1611, 286, 7832, 2057, 198, 464, 36973, 318, 18496, 338, 13, 383, 12187, 318, 5658, 338, 13, 383, 6099, 318, 3977, 338, 13, 5658, 257, 1611, 286, 7832, 2057, 198, 464, 9669, 318, 1757, 338, 13, 383, 18607, 318, 3899, 338, 13, 383, 15224, 318, 29216, 338, 13, 29216, 257, 1611, 286, 7832, 9528, 198, 464, 9283, 318, 10443, 338, 13, 383, 20584, 318, 16348, 338, 13, 383, 18607, 318, 10674, 338, 13, 10443, 257, 1611, 286, 7832, 6332, 198, 464, 17481, 318, 8982, 338, 13, 383, 18607, 318, 2940, 338, 13, 383, 47565, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 8234, 198, 464, 479, 14246, 72, 318, 6219, 338, 13, 383, 37246, 318, 3362, 338, 13, 383, 2266, 318, 2940, 338, 13, 2940, 257, 1611, 286, 7832, 3124, 198, 464, 17536, 318, 23632, 338, 13, 383, 45314, 318, 21776, 338, 13, 383, 48241, 318, 10674, 338, 13, 21776, 257, 1611, 286, 7832, 5044, 198, 464, 21029, 318, 23632, 338, 13, 383, 11398, 318, 14200, 338, 13, 383, 1097, 318, 4502, 338, 13, 4502, 257, 1611, 286, 7832, 4038, 198, 464, 26320, 318, 14919, 338, 13, 383, 10012, 318, 1757, 338, 13, 383, 48241, 318, 23632, 338, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 464, 10211, 318, 36976, 338, 13, 383, 49364, 318, 8239, 338, 13, 383, 4346, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 6332, 198, 464, 11223, 538, 318, 10490, 338, 13, 383, 15900, 318, 16348, 338, 13, 383, 48241, 318, 10674, 338, 13, 16348, 257, 1611, 286, 7832, 5044, 198, 464, 17180, 318, 7939, 338, 13, 383, 6891, 318, 15378, 338, 13, 383, 15900, 318, 21776, 338, 13, 15378, 257, 1611, 286, 7832, 4144, 198, 464, 1097, 318, 16738, 338, 13, 383, 45489, 318, 10674, 338, 13, 383, 50085, 318, 5335, 338, 13, 16738, 257, 1611, 286, 7832, 4038, 198, 464, 13224, 318, 3271, 338, 13, 383, 9283, 318, 3899, 338, 13, 383, 9669, 318, 48685, 338, 13, 3271, 257, 1611, 286, 7832, 17075, 198]], [[198, 464, 22383, 318, 14919, 338, 13, 383, 12967, 318, 3977, 338, 13, 383, 24554, 318, 23632, 338, 13, 23632, 257, 1611, 286, 7832, 4144, 198, 464, 33039, 318, 8239, 338, 13, 383, 8509, 318, 8982, 338, 13, 383, 26241, 318, 3759, 338, 13, 8982, 257, 1611, 286, 7832, 2057, 198, 464, 37191, 318, 23632, 338, 13, 383, 3072, 318, 10490, 338, 13, 383, 6099, 318, 29504, 338, 13, 29504, 257, 1611, 286, 7832, 4144, 198, 464, 6174, 318, 8403, 338, 13, 383, 46593, 291, 313, 318, 16738, 338, 13, 383, 2266, 318, 16685, 338, 13, 8403, 257, 1611, 286, 7832, 2057, 198, 464, 4171, 20853, 318, 5502, 338, 13, 383, 8509, 318, 16738, 338, 13, 383, 8223, 318, 29216, 338, 13, 16738, 257, 1611, 286, 7832, 2057, 198, 464, 18757, 318, 10674, 338, 13, 383, 12187, 318, 1757, 338, 13, 383, 45314, 318, 10443, 338, 13, 10674, 257, 1611, 286, 7832, 4038, 198, 464, 22802, 318, 16348, 338, 13, 383, 20584, 318, 14430, 338, 13, 383, 35446, 318, 3271, 338, 13, 3271, 257, 1611, 286, 7832, 12833, 198, 464, 1097, 318, 8982, 338, 13, 383, 48241, 318, 12803, 338, 13, 383, 38283, 318, 9953, 338, 13, 9953, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 11575, 318, 8239, 338, 13, 383, 17481, 318, 22695, 338, 13, 383, 479, 14246, 72, 318, 14919, 338, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 464, 14256, 318, 10490, 338, 13, 383, 45540, 318, 18496, 338, 13, 383, 19132, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 309, 12, 15600, 318, 5502, 338, 13, 383, 45489, 318, 7516, 338, 13, 383, 50085, 318, 16753, 338, 13, 7516, 257, 1611, 286, 7832, 12833, 198, 464, 8887, 318, 3759, 338, 13, 383, 14256, 318, 8403, 338, 13, 383, 1097, 318, 3899, 338, 13, 3759, 257, 1611, 286, 7832, 4144, 198, 464, 9875, 318, 16685, 338, 13, 383, 45540, 318, 7516, 338, 13, 383, 38283, 318, 48685, 338, 13, 48685, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 10211, 318, 3977, 338, 13, 383, 29219, 318, 29216, 338, 13, 383, 48241, 318, 16348, 338, 13, 3977, 257, 1611, 286, 7832, 5044, 198, 464, 45489, 318, 2940, 338, 13, 383, 25286, 318, 5502, 338, 13, 383, 40968, 318, 32464, 338, 13, 2940, 257, 1611, 286, 7832, 12833, 198, 464, 2042, 318, 1757, 338, 13, 383, 8887, 318, 32464, 338, 13, 383, 3797, 318, 6219, 338, 13, 1757, 257, 1611, 286, 7832, 3124, 198]], [[198, 464, 2330, 318, 6219, 338, 13, 383, 26593, 318, 9953, 338, 13, 383, 8223, 318, 2940, 338, 13, 6219, 257, 1611, 286, 7832, 3124, 198, 464, 17849, 318, 29216, 338, 13, 383, 26320, 318, 16738, 338, 13, 383, 6891, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 4144, 198, 464, 7872, 318, 18496, 338, 13, 383, 36279, 318, 5074, 338, 13, 383, 35446, 318, 12803, 338, 13, 5074, 257, 1611, 286, 7832, 4144, 198, 464, 16790, 318, 16348, 338, 13, 383, 2266, 318, 5199, 338, 13, 383, 22383, 318, 3977, 338, 13, 3977, 257, 1611, 286, 7832, 9528, 198, 464, 11745, 318, 5658, 338, 13, 383, 36973, 318, 15378, 338, 13, 383, 10147, 318, 5074, 338, 13, 5658, 257, 1611, 286, 7832, 17075, 198, 464, 3290, 318, 48685, 338, 13, 383, 13224, 318, 5199, 338, 13, 383, 36656, 318, 9953, 338, 13, 5199, 257, 1611, 286, 7832, 17075, 198, 464, 19132, 318, 16348, 338, 13, 383, 2330, 318, 15378, 338, 13, 383, 10912, 318, 29216, 338, 13, 16348, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 12581, 318, 30223, 338, 13, 383, 18757, 318, 21776, 338, 13, 383, 9283, 318, 3977, 338, 13, 3977, 257, 1611, 286, 7832, 6332, 198, 464, 10047, 318, 2940, 338, 13, 383, 16790, 318, 7939, 338, 13, 383, 28738, 318, 3977, 338, 13, 2940, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 2266, 318, 10443, 338, 13, 383, 50085, 318, 48685, 338, 13, 383, 45540, 318, 18678, 338, 13, 10443, 257, 1611, 286, 7832, 3124, 198, 464, 4077, 318, 26918, 338, 13, 383, 9283, 318, 30223, 338, 13, 383, 12581, 318, 19579, 338, 13, 19579, 257, 1611, 286, 7832, 9528, 198, 464, 11398, 318, 22132, 338, 13, 383, 18744, 318, 3899, 338, 13, 383, 40968, 318, 16753, 338, 13, 3899, 257, 1611, 286, 7832, 5044, 198, 464, 13133, 318, 15378, 338, 13, 383, 4346, 318, 3700, 338, 13, 383, 1660, 45690, 318, 29504, 338, 13, 3700, 257, 1611, 286, 7832, 6332, 198, 464, 9875, 318, 14919, 338, 13, 383, 25996, 318, 19579, 338, 13, 383, 20584, 318, 36976, 338, 13, 36976, 257, 1611, 286, 7832, 4144, 198, 464, 21202, 318, 12803, 338, 13, 383, 35685, 318, 3977, 338, 13, 383, 20697, 318, 18678, 338, 13, 12803, 257, 1611, 286, 7832, 4282, 198, 464, 25286, 318, 3759, 338, 13, 383, 9669, 318, 2940, 338, 13, 383, 22383, 318, 7806, 338, 13, 2940, 257, 1611, 286, 7832, 6332, 198]], [[198, 464, 38283, 318, 5658, 338, 13, 383, 26593, 318, 30223, 338, 13, 383, 10047, 318, 8982, 338, 13, 30223, 257, 1611, 286, 7832, 2057, 198, 464, 18757, 318, 5335, 338, 13, 383, 29219, 318, 3977, 338, 13, 383, 37191, 318, 14919, 338, 13, 5335, 257, 1611, 286, 7832, 4038, 198, 464, 50085, 318, 14200, 338, 13, 383, 8509, 318, 22695, 338, 13, 383, 4077, 318, 16738, 338, 13, 16738, 257, 1611, 286, 7832, 3124, 198, 464, 26320, 318, 21776, 338, 13, 383, 2042, 20853, 318, 9953, 338, 13, 383, 1323, 318, 10443, 338, 13, 21776, 257, 1611, 286, 7832, 2057, 198, 464, 4077, 318, 16738, 338, 13, 383, 25286, 318, 5199, 338, 13, 383, 24554, 318, 40349, 338, 13, 40349, 257, 1611, 286, 7832, 4144, 198, 464, 47565, 318, 23632, 338, 13, 383, 37246, 318, 16348, 338, 13, 383, 19132, 318, 26918, 338, 13, 26918, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 20096, 318, 29504, 338, 13, 383, 26320, 318, 3271, 338, 13, 383, 10012, 318, 3700, 338, 13, 29504, 257, 1611, 286, 7832, 5044, 198, 464, 14256, 318, 7516, 338, 13, 383, 22365, 666, 318, 16753, 338, 13, 383, 29219, 318, 6219, 338, 13, 7516, 257, 1611, 286, 7832, 2057, 198, 464, 9283, 318, 16738, 338, 13, 383, 9875, 318, 7939, 338, 13, 383, 3072, 318, 10674, 338, 13, 16738, 257, 1611, 286, 7832, 6332, 198, 464, 35446, 318, 4502, 338, 13, 383, 1660, 45690, 318, 21776, 338, 13, 383, 19132, 318, 19579, 338, 13, 21776, 257, 1611, 286, 7832, 8234, 198, 464, 35685, 318, 18678, 338, 13, 383, 3290, 318, 7939, 338, 13, 383, 26320, 318, 10674, 338, 13, 7939, 257, 1611, 286, 7832, 5044, 198, 464, 49364, 318, 40349, 338, 13, 383, 18607, 318, 8239, 338, 13, 383, 1323, 318, 36976, 338, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 464, 26241, 318, 26918, 338, 13, 383, 22365, 666, 318, 48685, 338, 13, 383, 24554, 318, 18496, 338, 13, 48685, 257, 1611, 286, 7832, 8234, 198, 464, 10012, 318, 16685, 338, 13, 383, 12187, 318, 32464, 338, 13, 383, 25286, 318, 14200, 338, 13, 16685, 257, 1611, 286, 7832, 9528, 198, 464, 8187, 318, 10443, 338, 13, 383, 10047, 318, 3899, 338, 13, 383, 33039, 318, 1757, 338, 13, 3899, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 21382, 1678, 318, 1757, 338, 13, 383, 12967, 318, 3977, 338, 13, 383, 6099, 318, 16738, 338, 13, 1757, 257, 1611, 286, 7832, 8234, 198]], [[198, 464, 45540, 318, 1757, 338, 13, 383, 35446, 318, 6219, 338, 13, 383, 8509, 318, 8403, 338, 13, 6219, 257, 1611, 286, 7832, 12833, 198, 464, 4077, 318, 5502, 338, 13, 383, 22365, 666, 318, 48685, 338, 13, 383, 16790, 318, 14919, 338, 13, 14919, 257, 1611, 286, 7832, 4282, 198, 464, 37191, 318, 14200, 338, 13, 383, 11575, 318, 2940, 338, 13, 383, 9669, 318, 3977, 338, 13, 2940, 257, 1611, 286, 7832, 4282, 198, 464, 12187, 318, 16348, 338, 13, 383, 11398, 318, 23632, 338, 13, 383, 6891, 318, 3700, 338, 13, 23632, 257, 1611, 286, 7832, 3124, 198, 464, 10047, 318, 30223, 338, 13, 383, 16790, 318, 5335, 338, 13, 383, 17536, 318, 7516, 338, 13, 30223, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 9283, 318, 5335, 338, 13, 383, 16569, 318, 18678, 338, 13, 383, 18744, 318, 7806, 338, 13, 5335, 257, 1611, 286, 7832, 6332, 198, 464, 4171, 20853, 318, 22132, 338, 13, 383, 9669, 318, 48685, 338, 13, 383, 49364, 318, 16348, 338, 13, 48685, 257, 1611, 286, 7832, 6332, 198, 464, 35685, 318, 5335, 338, 13, 383, 21029, 318, 5074, 338, 13, 383, 12768, 318, 32464, 338, 13, 32464, 257, 1611, 286, 7832, 3124, 198, 464, 37246, 318, 18678, 338, 13, 383, 35446, 318, 5199, 338, 13, 383, 21657, 318, 29504, 338, 13, 5199, 257, 1611, 286, 7832, 12833, 198, 464, 22365, 666, 318, 5335, 338, 13, 383, 2485, 318, 30223, 338, 13, 383, 17481, 318, 32464, 338, 13, 32464, 257, 1611, 286, 7832, 5044, 198, 464, 26320, 318, 30223, 338, 13, 383, 21657, 318, 5658, 338, 13, 383, 11398, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 3124, 198, 464, 19132, 318, 12803, 338, 13, 383, 2330, 318, 3271, 338, 13, 383, 25996, 318, 3759, 338, 13, 12803, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 9283, 318, 16738, 338, 13, 383, 41478, 32650, 318, 19579, 338, 13, 383, 12187, 318, 5335, 338, 13, 16738, 257, 1611, 286, 7832, 6332, 198, 464, 22746, 318, 8239, 338, 13, 383, 19132, 318, 5502, 338, 13, 383, 11398, 318, 40349, 338, 13, 5502, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 11745, 318, 16738, 338, 13, 383, 41478, 32650, 318, 22132, 338, 13, 383, 1097, 318, 7212, 338, 13, 16738, 257, 1611, 286, 7832, 17075, 198, 464, 28738, 318, 48685, 338, 13, 383, 17481, 318, 40349, 338, 13, 383, 4346, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 6332, 198]], [[198, 464, 14256, 318, 29216, 338, 13, 383, 11745, 318, 8403, 338, 13, 383, 25286, 318, 5335, 338, 13, 8403, 257, 1611, 286, 7832, 17075, 198, 464, 37246, 318, 7516, 338, 13, 383, 29219, 318, 23632, 338, 13, 383, 13224, 318, 14200, 338, 13, 14200, 257, 1611, 286, 7832, 17075, 198, 464, 17180, 318, 48685, 338, 13, 383, 16790, 318, 16348, 338, 13, 383, 38283, 318, 21776, 338, 13, 21776, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 9669, 318, 3899, 338, 13, 383, 18757, 318, 12803, 338, 13, 383, 38283, 318, 21776, 338, 13, 12803, 257, 1611, 286, 7832, 4038, 198, 464, 22746, 318, 36976, 338, 13, 383, 14256, 318, 21776, 338, 13, 383, 15224, 318, 2940, 338, 13, 2940, 257, 1611, 286, 7832, 9528, 198, 464, 11745, 318, 1757, 338, 13, 383, 12187, 318, 7212, 338, 13, 383, 15224, 318, 16738, 338, 13, 7212, 257, 1611, 286, 7832, 2057, 198, 464, 13133, 318, 8239, 338, 13, 383, 8887, 318, 4502, 338, 13, 383, 35685, 318, 18678, 338, 13, 8239, 257, 1611, 286, 7832, 17075, 198, 464, 18607, 318, 18496, 338, 13, 383, 3072, 318, 23632, 338, 13, 383, 20096, 318, 36976, 338, 13, 18496, 257, 1611, 286, 7832, 4282, 198, 464, 45489, 318, 3899, 338, 13, 383, 26241, 318, 18496, 338, 13, 383, 309, 12, 15600, 318, 9953, 338, 13, 3899, 257, 1611, 286, 7832, 12833, 198, 464, 19132, 318, 48685, 338, 13, 383, 16569, 318, 16738, 338, 13, 383, 2485, 318, 14200, 338, 13, 48685, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 17536, 318, 18496, 338, 13, 383, 40968, 318, 8239, 338, 13, 383, 1097, 318, 7939, 338, 13, 8239, 257, 1611, 286, 7832, 4282, 198, 464, 2042, 318, 19579, 338, 13, 383, 13135, 318, 12803, 338, 13, 383, 22045, 318, 30223, 338, 13, 12803, 257, 1611, 286, 7832, 4144, 198, 464, 17849, 318, 19579, 338, 13, 383, 16569, 318, 2940, 338, 13, 383, 20584, 318, 5199, 338, 13, 19579, 257, 1611, 286, 7832, 4282, 198, 464, 8223, 318, 40349, 338, 13, 383, 18757, 318, 15378, 338, 13, 383, 49364, 318, 19579, 338, 13, 40349, 257, 1611, 286, 7832, 5044, 198, 464, 11575, 318, 10674, 338, 13, 383, 26241, 318, 3759, 338, 13, 383, 19132, 318, 3700, 338, 13, 3700, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 6099, 318, 6219, 338, 13, 383, 45489, 318, 3977, 338, 13, 383, 26917, 318, 5502, 338, 13, 6219, 257, 1611, 286, 7832, 4144, 198]], [[198, 464, 12967, 318, 26918, 338, 13, 383, 47565, 318, 16685, 338, 13, 383, 11745, 318, 40349, 338, 13, 40349, 257, 1611, 286, 7832, 17075, 198, 464, 4346, 318, 3759, 338, 13, 383, 2042, 20853, 318, 3977, 338, 13, 383, 4171, 318, 23632, 338, 13, 3759, 257, 1611, 286, 7832, 6332, 198, 464, 24554, 318, 26918, 338, 13, 383, 48241, 318, 8239, 338, 13, 383, 20950, 318, 16348, 338, 13, 8239, 257, 1611, 286, 7832, 2057, 198, 464, 36279, 318, 8403, 338, 13, 383, 7872, 318, 3977, 338, 13, 383, 11745, 318, 29216, 338, 13, 29216, 257, 1611, 286, 7832, 17075, 198, 464, 21657, 318, 18678, 338, 13, 383, 21029, 318, 3700, 338, 13, 383, 48241, 318, 7212, 338, 13, 18678, 257, 1611, 286, 7832, 5044, 198, 464, 33039, 318, 10443, 338, 13, 383, 15224, 318, 1757, 338, 13, 383, 2266, 318, 6219, 338, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 464, 20950, 318, 22695, 338, 13, 383, 22365, 666, 318, 8982, 338, 13, 383, 1097, 318, 3899, 338, 13, 8982, 257, 1611, 286, 7832, 8234, 198, 464, 3072, 318, 9953, 338, 13, 383, 1323, 318, 7806, 338, 13, 383, 2330, 318, 40349, 338, 13, 7806, 257, 1611, 286, 7832, 4038, 198, 464, 45489, 318, 22695, 338, 13, 383, 26917, 318, 7806, 338, 13, 383, 2042, 318, 40349, 338, 13, 22695, 257, 1611, 286, 7832, 12833, 198, 464, 22746, 318, 4502, 338, 13, 383, 29219, 318, 18496, 338, 13, 383, 18757, 318, 14200, 338, 13, 18496, 257, 1611, 286, 7832, 4144, 198, 464, 9875, 318, 4502, 338, 13, 383, 35446, 318, 12803, 338, 13, 383, 25996, 318, 7212, 338, 13, 12803, 257, 1611, 286, 7832, 12833, 198, 464, 25996, 318, 14430, 338, 13, 383, 16569, 318, 16348, 338, 13, 383, 8223, 318, 2940, 338, 13, 16348, 257, 1611, 286, 7832, 9528, 198, 464, 12967, 318, 16738, 338, 13, 383, 2485, 318, 3977, 338, 13, 383, 36279, 318, 8982, 338, 13, 16738, 257, 1611, 286, 7832, 5044, 198, 464, 41478, 32650, 318, 22695, 338, 13, 383, 22746, 318, 18678, 338, 13, 383, 36656, 318, 3362, 338, 13, 18678, 257, 1611, 286, 7832, 5044, 198, 464, 6174, 318, 26918, 338, 13, 383, 11575, 318, 22695, 338, 13, 383, 4171, 318, 40349, 338, 13, 26918, 257, 1611, 286, 7832, 2057, 198, 464, 12768, 318, 3899, 338, 13, 383, 21657, 318, 16753, 338, 13, 383, 1097, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 4038, 198]], [[198, 464, 8887, 318, 10443, 338, 13, 383, 20697, 318, 15378, 338, 13, 383, 3072, 318, 3899, 338, 13, 15378, 257, 1611, 286, 7832, 12833, 198, 464, 11223, 538, 318, 5074, 338, 13, 383, 20697, 318, 9953, 338, 13, 383, 10912, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 8234, 198, 464, 2485, 318, 8982, 338, 13, 383, 25286, 318, 36976, 338, 13, 383, 10211, 318, 32464, 338, 13, 36976, 257, 1611, 286, 7832, 8234, 198, 464, 26593, 318, 16348, 338, 13, 383, 18744, 318, 8403, 338, 13, 383, 18607, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 4282, 198, 464, 18607, 318, 23632, 338, 13, 383, 26320, 318, 3700, 338, 13, 383, 8237, 318, 6219, 338, 13, 6219, 257, 1611, 286, 7832, 4144, 198, 464, 2042, 318, 14430, 338, 13, 383, 50085, 318, 29504, 338, 13, 383, 17849, 318, 16738, 338, 13, 14430, 257, 1611, 286, 7832, 3124, 198, 464, 25286, 318, 3271, 338, 13, 383, 36279, 318, 40349, 338, 13, 383, 47565, 318, 14200, 338, 13, 40349, 257, 1611, 286, 7832, 4144, 198, 464, 12967, 318, 8982, 338, 13, 383, 15900, 318, 29504, 338, 13, 383, 35685, 318, 12803, 338, 13, 12803, 257, 1611, 286, 7832, 9528, 198, 464, 38283, 318, 3362, 338, 13, 383, 11575, 318, 19579, 338, 13, 383, 7872, 318, 21776, 338, 13, 3362, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 22802, 318, 7516, 338, 13, 383, 17536, 318, 3271, 338, 13, 383, 26917, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 5044, 198, 464, 11745, 318, 3899, 338, 13, 383, 29219, 318, 10443, 338, 13, 383, 25996, 318, 21776, 338, 13, 3899, 257, 1611, 286, 7832, 17075, 198, 464, 7872, 318, 3271, 338, 13, 383, 13133, 318, 22695, 338, 13, 383, 40968, 318, 18678, 338, 13, 22695, 257, 1611, 286, 7832, 17075, 198, 464, 6891, 318, 10490, 338, 13, 383, 35685, 318, 1757, 338, 13, 383, 22045, 318, 3899, 338, 13, 1757, 257, 1611, 286, 7832, 9528, 198, 464, 37191, 318, 3977, 338, 13, 383, 20584, 318, 9953, 338, 13, 383, 26241, 318, 3271, 338, 13, 3977, 257, 1611, 286, 7832, 9528, 198, 464, 25996, 318, 5199, 338, 13, 383, 9669, 318, 3977, 338, 13, 383, 35685, 318, 22695, 338, 13, 3977, 257, 1611, 286, 7832, 6332, 198, 464, 18757, 318, 10674, 338, 13, 383, 11745, 318, 22695, 338, 13, 383, 8887, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 4144, 198]], [[198, 464, 3072, 318, 3362, 338, 13, 383, 38283, 318, 5074, 338, 13, 383, 2330, 318, 32464, 338, 13, 5074, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 18744, 318, 40349, 338, 13, 383, 25996, 318, 29216, 338, 13, 383, 26170, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 9528, 198, 464, 41478, 32650, 318, 5502, 338, 13, 383, 26168, 318, 14430, 338, 13, 383, 11398, 318, 12803, 338, 13, 12803, 257, 1611, 286, 7832, 3124, 198, 464, 3072, 318, 30223, 338, 13, 383, 10047, 318, 7516, 338, 13, 383, 29219, 318, 14200, 338, 13, 14200, 257, 1611, 286, 7832, 4144, 198, 464, 22365, 666, 318, 18678, 338, 13, 383, 4346, 318, 4502, 338, 13, 383, 10147, 318, 7939, 338, 13, 4502, 257, 1611, 286, 7832, 6332, 198, 464, 16790, 318, 30223, 338, 13, 383, 11745, 318, 7516, 338, 13, 383, 4346, 318, 29504, 338, 13, 30223, 257, 1611, 286, 7832, 4282, 198, 464, 21202, 318, 30223, 338, 13, 383, 13224, 318, 16738, 338, 13, 383, 22045, 318, 8239, 338, 13, 16738, 257, 1611, 286, 7832, 17075, 198, 464, 16790, 318, 30223, 338, 13, 383, 36656, 318, 5658, 338, 13, 383, 33039, 318, 2940, 338, 13, 30223, 257, 1611, 286, 7832, 4282, 198, 464, 6174, 318, 48685, 338, 13, 383, 16790, 318, 29504, 338, 13, 383, 26593, 318, 23632, 338, 13, 29504, 257, 1611, 286, 7832, 4282, 198, 464, 13133, 318, 21776, 338, 13, 383, 17180, 318, 48685, 338, 13, 383, 12581, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 9528, 198, 464, 4346, 318, 23632, 338, 13, 383, 29219, 318, 14919, 338, 13, 383, 22802, 318, 22695, 338, 13, 23632, 257, 1611, 286, 7832, 6332, 198, 464, 15224, 318, 5074, 338, 13, 383, 12768, 318, 10443, 338, 13, 383, 1097, 318, 8403, 338, 13, 8403, 257, 1611, 286, 7832, 4038, 198, 464, 8509, 318, 8982, 338, 13, 383, 21382, 1678, 318, 29216, 338, 13, 383, 6099, 318, 22132, 338, 13, 22132, 257, 1611, 286, 7832, 4144, 198, 464, 22045, 318, 1757, 338, 13, 383, 48241, 318, 14200, 338, 13, 383, 2330, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 3124, 198, 464, 11575, 318, 23632, 338, 13, 383, 45489, 318, 14200, 338, 13, 383, 24554, 318, 16685, 338, 13, 14200, 257, 1611, 286, 7832, 12833, 198, 464, 4346, 318, 40349, 338, 13, 383, 1323, 318, 3700, 338, 13, 383, 16569, 318, 3977, 338, 13, 40349, 257, 1611, 286, 7832, 6332, 198]], [[198, 464, 8887, 318, 29216, 338, 13, 383, 11398, 318, 16738, 338, 13, 383, 11575, 318, 3271, 338, 13, 3271, 257, 1611, 286, 7832, 4282, 198, 464, 35446, 318, 22132, 338, 13, 383, 37191, 318, 8239, 338, 13, 383, 47565, 318, 16685, 338, 13, 16685, 257, 1611, 286, 7832, 8234, 198, 464, 29219, 318, 10674, 338, 13, 383, 26241, 318, 1757, 338, 13, 383, 1323, 318, 12803, 338, 13, 10674, 257, 1611, 286, 7832, 4144, 198, 464, 2266, 318, 15378, 338, 13, 383, 4346, 318, 32464, 338, 13, 383, 22045, 318, 3977, 338, 13, 32464, 257, 1611, 286, 7832, 6332, 198, 464, 13135, 318, 10443, 338, 13, 383, 41478, 32650, 318, 48685, 338, 13, 383, 21202, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 4282, 198, 464, 18757, 318, 21776, 338, 13, 383, 20584, 318, 8982, 338, 13, 383, 9283, 318, 23632, 338, 13, 23632, 257, 1611, 286, 7832, 6332, 198, 464, 47565, 318, 21776, 338, 13, 383, 18607, 318, 14919, 338, 13, 383, 12187, 318, 3700, 338, 13, 3700, 257, 1611, 286, 7832, 2057, 198, 464, 18757, 318, 3362, 338, 13, 383, 35685, 318, 10490, 338, 13, 383, 4171, 318, 7806, 338, 13, 10490, 257, 1611, 286, 7832, 9528, 198, 464, 26170, 318, 22695, 338, 13, 383, 2266, 318, 7212, 338, 13, 383, 8187, 318, 3362, 338, 13, 7212, 257, 1611, 286, 7832, 3124, 198, 464, 14032, 318, 16738, 338, 13, 383, 10047, 318, 3362, 338, 13, 383, 33039, 318, 18496, 338, 13, 3362, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 2266, 318, 3700, 338, 13, 383, 19132, 318, 3899, 338, 13, 383, 13224, 318, 7212, 338, 13, 3700, 257, 1611, 286, 7832, 3124, 198, 464, 20461, 11729, 318, 14919, 338, 13, 383, 9283, 318, 3759, 338, 13, 383, 3797, 318, 18496, 338, 13, 3759, 257, 1611, 286, 7832, 6332, 198, 464, 9875, 318, 3271, 338, 13, 383, 13133, 318, 40349, 338, 13, 383, 4171, 318, 18496, 338, 13, 40349, 257, 1611, 286, 7832, 17075, 198, 464, 21202, 318, 7939, 338, 13, 383, 18757, 318, 8403, 338, 13, 383, 12967, 318, 5074, 338, 13, 8403, 257, 1611, 286, 7832, 4038, 198, 464, 14032, 318, 48685, 338, 13, 383, 11223, 538, 318, 29504, 338, 13, 383, 25996, 318, 10490, 338, 13, 29504, 257, 1611, 286, 7832, 4038, 198, 464, 41478, 32650, 318, 7939, 338, 13, 383, 10912, 318, 14430, 338, 13, 383, 16569, 318, 3899, 338, 13, 7939, 257, 1611, 286, 7832, 2057, 198]], [[198, 464, 3072, 318, 3977, 338, 13, 383, 17849, 318, 26918, 338, 13, 383, 1323, 318, 16738, 338, 13, 3977, 257, 1611, 286, 7832, 17075, 198, 464, 12187, 318, 16348, 338, 13, 383, 28738, 318, 14430, 338, 13, 383, 22383, 318, 1757, 338, 13, 16348, 257, 1611, 286, 7832, 2057, 198, 464, 3290, 318, 5502, 338, 13, 383, 6099, 318, 2940, 338, 13, 383, 20096, 318, 26918, 338, 13, 2940, 257, 1611, 286, 7832, 4144, 198, 464, 18744, 318, 6219, 338, 13, 383, 8223, 318, 16348, 338, 13, 383, 18757, 318, 8239, 338, 13, 8239, 257, 1611, 286, 7832, 4038, 198, 464, 19132, 318, 1757, 338, 13, 383, 1660, 45690, 318, 29504, 338, 13, 383, 6174, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 2057, 198, 464, 22365, 666, 318, 22132, 338, 13, 383, 18757, 318, 3271, 338, 13, 383, 4171, 318, 8403, 338, 13, 3271, 257, 1611, 286, 7832, 4038, 198, 464, 11398, 318, 18678, 338, 13, 383, 18873, 318, 26918, 338, 13, 383, 1097, 318, 19579, 338, 13, 18678, 257, 1611, 286, 7832, 3124, 198, 464, 21029, 318, 16348, 338, 13, 383, 8237, 318, 9953, 338, 13, 383, 1660, 45690, 318, 8982, 338, 13, 16348, 257, 1611, 286, 7832, 9528, 198, 464, 13133, 318, 26918, 338, 13, 383, 4171, 318, 3700, 338, 13, 383, 22045, 318, 8982, 338, 13, 26918, 257, 1611, 286, 7832, 17075, 198, 464, 14256, 318, 5335, 338, 13, 383, 16790, 318, 40349, 338, 13, 383, 3797, 318, 5199, 338, 13, 5335, 257, 1611, 286, 7832, 2057, 198, 464, 20697, 318, 7516, 338, 13, 383, 4346, 318, 14430, 338, 13, 383, 20461, 11729, 318, 16348, 338, 13, 16348, 257, 1611, 286, 7832, 8234, 198, 464, 14256, 318, 14430, 338, 13, 383, 20096, 318, 21776, 338, 13, 383, 49364, 318, 3271, 338, 13, 3271, 257, 1611, 286, 7832, 8234, 198, 464, 20584, 318, 18496, 338, 13, 383, 2042, 318, 7939, 338, 13, 383, 21202, 318, 9953, 338, 13, 9953, 257, 1611, 286, 7832, 4282, 198, 464, 14256, 318, 4502, 338, 13, 383, 37246, 318, 1757, 338, 13, 383, 13135, 318, 16348, 338, 13, 4502, 257, 1611, 286, 7832, 2057, 198, 464, 26170, 318, 3362, 338, 13, 383, 17536, 318, 3899, 338, 13, 383, 46593, 291, 313, 318, 30223, 338, 13, 3899, 257, 1611, 286, 7832, 4038, 198, 464, 2330, 318, 22695, 338, 13, 383, 8187, 318, 7212, 338, 13, 383, 47565, 318, 30223, 338, 13, 22695, 257, 1611, 286, 7832, 3124, 198]], [[198, 464, 18757, 318, 2940, 338, 13, 383, 41478, 32650, 318, 3977, 338, 13, 383, 50085, 318, 5199, 338, 13, 3977, 257, 1611, 286, 7832, 2057, 198, 464, 28738, 318, 1757, 338, 13, 383, 12967, 318, 3899, 338, 13, 383, 38283, 318, 18496, 338, 13, 3899, 257, 1611, 286, 7832, 5044, 198, 464, 26170, 318, 22695, 338, 13, 383, 29219, 318, 16738, 338, 13, 383, 38283, 318, 3977, 338, 13, 3977, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 8237, 318, 10443, 338, 13, 383, 13133, 318, 10674, 338, 13, 383, 7872, 318, 21776, 338, 13, 10674, 257, 1611, 286, 7832, 17075, 198, 464, 15224, 318, 8982, 338, 13, 383, 10047, 318, 16738, 338, 13, 383, 1097, 318, 14430, 338, 13, 14430, 257, 1611, 286, 7832, 4038, 198, 464, 48241, 318, 36976, 338, 13, 383, 33039, 318, 40349, 338, 13, 383, 1097, 318, 3977, 338, 13, 36976, 257, 1611, 286, 7832, 2057, 198, 464, 9875, 318, 16753, 338, 13, 383, 21382, 1678, 318, 22132, 338, 13, 383, 6099, 318, 7806, 338, 13, 7806, 257, 1611, 286, 7832, 4144, 198, 464, 9669, 318, 18496, 338, 13, 383, 15224, 318, 22132, 338, 13, 383, 7872, 318, 12803, 338, 13, 12803, 257, 1611, 286, 7832, 3124, 198, 464, 22365, 666, 318, 4502, 338, 13, 383, 2330, 318, 1757, 338, 13, 383, 12581, 318, 19579, 338, 13, 1757, 257, 1611, 286, 7832, 3124, 198, 464, 6174, 318, 8239, 338, 13, 383, 35446, 318, 6219, 338, 13, 383, 26170, 318, 22695, 338, 13, 8239, 257, 1611, 286, 7832, 2057, 198, 464, 10047, 318, 22695, 338, 13, 383, 14256, 318, 16685, 338, 13, 383, 22746, 318, 14919, 338, 13, 22695, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 12768, 318, 18496, 338, 13, 383, 8887, 318, 22132, 338, 13, 383, 20584, 318, 5199, 338, 13, 18496, 257, 1611, 286, 7832, 3124, 198, 464, 36279, 318, 16753, 338, 13, 383, 8187, 318, 5074, 338, 13, 383, 4171, 20853, 318, 14919, 338, 13, 5074, 257, 1611, 286, 7832, 9528, 198, 464, 22802, 318, 5074, 338, 13, 383, 479, 14246, 72, 318, 10443, 338, 13, 383, 2485, 318, 40349, 338, 13, 40349, 257, 1611, 286, 7832, 4282, 198, 464, 6099, 318, 21776, 338, 13, 383, 12187, 318, 12803, 338, 13, 383, 36973, 318, 6219, 338, 13, 21776, 257, 1611, 286, 7832, 4144, 198, 464, 16569, 318, 7939, 338, 13, 383, 16790, 318, 18678, 338, 13, 383, 11223, 538, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 4038, 198]], [[198, 464, 3072, 318, 8403, 338, 13, 383, 38283, 318, 3759, 338, 13, 383, 22802, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 8234, 198, 464, 33039, 318, 21776, 338, 13, 383, 8187, 318, 29216, 338, 13, 383, 22802, 318, 3977, 338, 13, 29216, 257, 1611, 286, 7832, 9528, 198, 464, 18757, 318, 16348, 338, 13, 383, 2042, 318, 7939, 338, 13, 383, 18607, 318, 8982, 338, 13, 7939, 257, 1611, 286, 7832, 3124, 198, 464, 16790, 318, 10674, 338, 13, 383, 41478, 32650, 318, 23632, 338, 13, 383, 15224, 318, 5335, 338, 13, 5335, 257, 1611, 286, 7832, 9528, 198, 464, 9669, 318, 2940, 338, 13, 383, 36279, 318, 48685, 338, 13, 383, 14256, 318, 5658, 338, 13, 2940, 257, 1611, 286, 7832, 6332, 198, 464, 13133, 318, 5074, 338, 13, 383, 26320, 318, 8982, 338, 13, 383, 50085, 318, 5199, 338, 13, 5074, 257, 1611, 286, 7832, 17075, 198, 464, 13133, 318, 9953, 338, 13, 383, 37246, 318, 26918, 338, 13, 383, 1660, 45690, 318, 7806, 338, 13, 9953, 257, 1611, 286, 7832, 17075, 198, 464, 36973, 318, 5658, 338, 13, 383, 22383, 318, 30223, 338, 13, 383, 4171, 318, 8239, 338, 13, 30223, 257, 1611, 286, 7832, 9528, 198, 464, 14256, 318, 5502, 338, 13, 383, 2042, 318, 5199, 338, 13, 383, 8223, 318, 7212, 338, 13, 5502, 257, 1611, 286, 7832, 2057, 198, 464, 11745, 318, 3271, 338, 13, 383, 26320, 318, 29504, 338, 13, 383, 11398, 318, 6219, 338, 13, 29504, 257, 1611, 286, 7832, 2057, 198, 464, 4171, 318, 30223, 338, 13, 383, 6891, 318, 29216, 338, 13, 383, 14256, 318, 7516, 338, 13, 7516, 257, 1611, 286, 7832, 2057, 198, 464, 1323, 318, 16685, 338, 13, 383, 15900, 318, 3759, 338, 13, 383, 12581, 318, 22132, 338, 13, 22132, 257, 1611, 286, 7832, 9528, 198, 464, 2330, 318, 3759, 338, 13, 383, 15224, 318, 16348, 338, 13, 383, 38283, 318, 7939, 338, 13, 7939, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 20697, 318, 5658, 338, 13, 383, 8509, 318, 15378, 338, 13, 383, 18757, 318, 10490, 338, 13, 15378, 257, 1611, 286, 7832, 2057, 198, 464, 37191, 318, 29504, 338, 13, 383, 17481, 318, 18678, 338, 13, 383, 479, 14246, 72, 318, 15378, 338, 13, 15378, 257, 1611, 286, 7832, 8234, 198, 464, 8237, 318, 26918, 338, 13, 383, 22746, 318, 16348, 338, 13, 383, 20096, 318, 8982, 338, 13, 26918, 257, 1611, 286, 7832, 4144, 198]], [[198, 464, 10211, 318, 5074, 338, 13, 383, 4171, 318, 16348, 338, 13, 383, 13133, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 17075, 198, 464, 6891, 318, 8239, 338, 13, 383, 38283, 318, 32464, 338, 13, 383, 9669, 318, 18678, 338, 13, 8239, 257, 1611, 286, 7832, 4144, 198, 464, 13133, 318, 7516, 338, 13, 383, 28738, 318, 3977, 338, 13, 383, 22746, 318, 16738, 338, 13, 3977, 257, 1611, 286, 7832, 8234, 198, 464, 4346, 318, 1757, 338, 13, 383, 48241, 318, 9953, 338, 13, 383, 2266, 318, 5074, 338, 13, 1757, 257, 1611, 286, 7832, 6332, 198, 464, 12967, 318, 5658, 338, 13, 383, 8237, 318, 48685, 338, 13, 383, 20697, 318, 3362, 338, 13, 3362, 257, 1611, 286, 7832, 12833, 198, 464, 49364, 318, 4502, 338, 13, 383, 18744, 318, 14919, 338, 13, 383, 41478, 32650, 318, 14430, 338, 13, 4502, 257, 1611, 286, 7832, 8234, 198, 464, 4346, 318, 10674, 338, 13, 383, 21831, 318, 5502, 338, 13, 383, 18607, 318, 5335, 338, 13, 10674, 257, 1611, 286, 7832, 6332, 198, 464, 45314, 318, 22132, 338, 13, 383, 18757, 318, 23632, 338, 13, 383, 17180, 318, 9953, 338, 13, 9953, 257, 1611, 286, 7832, 8234, 198, 464, 4171, 318, 10674, 338, 13, 383, 18757, 318, 19579, 338, 13, 383, 14256, 318, 16738, 338, 13, 19579, 257, 1611, 286, 7832, 4038, 198, 464, 8509, 318, 3700, 338, 13, 383, 22365, 666, 318, 10490, 338, 13, 383, 10047, 318, 7516, 338, 13, 7516, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 2266, 318, 18678, 338, 13, 383, 20461, 11729, 318, 7806, 338, 13, 383, 24554, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 4144, 198, 464, 12768, 318, 16685, 338, 13, 383, 37246, 318, 48685, 338, 13, 383, 18607, 318, 19579, 338, 13, 16685, 257, 1611, 286, 7832, 3124, 198, 464, 36973, 318, 10443, 338, 13, 383, 10047, 318, 16348, 338, 13, 383, 15900, 318, 5199, 338, 13, 16348, 257, 1611, 286, 7832, 10530, 8875, 198, 464, 26168, 318, 10490, 338, 13, 383, 1097, 318, 29504, 338, 13, 383, 20096, 318, 26918, 338, 13, 29504, 257, 1611, 286, 7832, 4038, 198, 464, 8187, 318, 7212, 338, 13, 383, 13133, 318, 10490, 338, 13, 383, 35446, 318, 2940, 338, 13, 10490, 257, 1611, 286, 7832, 17075, 198, 464, 33039, 318, 7516, 338, 13, 383, 21382, 1678, 318, 7212, 338, 13, 383, 13133, 318, 18496, 338, 13, 7212, 257, 1611, 286, 7832, 8234, 198]], [[198, 464, 8223, 318, 22695, 338, 13, 383, 18757, 318, 16685, 338, 13, 383, 3072, 318, 29504, 338, 13, 29504, 257, 1611, 286, 7832, 17075, 198, 464, 24554, 318, 8982, 338, 13, 383, 16569, 318, 14200, 338, 13, 383, 20697, 318, 16738, 338, 13, 16738, 257, 1611, 286, 7832, 12833, 198, 464, 479, 14246, 72, 318, 3700, 338, 13, 383, 21202, 318, 5335, 338, 13, 383, 9283, 318, 16738, 338, 13, 3700, 257, 1611, 286, 7832, 8234, 198, 464, 49364, 318, 7212, 338, 13, 383, 9283, 318, 2940, 338, 13, 383, 16569, 318, 29504, 338, 13, 2940, 257, 1611, 286, 7832, 6332, 198, 464, 22746, 318, 3700, 338, 13, 383, 2042, 318, 48685, 338, 13, 383, 35446, 318, 3977, 338, 13, 3977, 257, 1611, 286, 7832, 12833, 198, 464, 45489, 318, 12803, 338, 13, 383, 17536, 318, 3271, 338, 13, 383, 13133, 318, 7212, 338, 13, 7212, 257, 1611, 286, 7832, 17075, 198, 464, 21202, 318, 5502, 338, 13, 383, 26241, 318, 10674, 338, 13, 383, 26170, 318, 7806, 338, 13, 5502, 257, 1611, 286, 7832, 4282, 198, 464, 36973, 318, 10443, 338, 13, 383, 45489, 318, 7212, 338, 13, 383, 15900, 318, 14430, 338, 13, 7212, 257, 1611, 286, 7832, 12833, 198, 464, 21382, 1678, 318, 14200, 338, 13, 383, 35446, 318, 5335, 338, 13, 383, 10012, 318, 16685, 338, 13, 14200, 257, 1611, 286, 7832, 8234, 198, 464, 17481, 318, 6219, 338, 13, 383, 28738, 318, 14430, 338, 13, 383, 10047, 318, 18678, 338, 13, 6219, 257, 1611, 286, 7832, 5044, 198, 464, 16790, 318, 10674, 338, 13, 383, 8187, 318, 2940, 338, 13, 383, 11575, 318, 3759, 338, 13, 2940, 257, 1611, 286, 7832, 9528, 198, 464, 6891, 318, 3700, 338, 13, 383, 12581, 318, 5502, 338, 13, 383, 3072, 318, 16753, 338, 13, 16753, 257, 1611, 286, 7832, 17075, 198, 464, 24554, 318, 8403, 338, 13, 383, 50085, 318, 1757, 338, 13, 383, 2485, 318, 30223, 338, 13, 8403, 257, 1611, 286, 7832, 4144, 198, 464, 18744, 318, 1757, 338, 13, 383, 8887, 318, 6219, 338, 13, 383, 36656, 318, 18496, 338, 13, 6219, 257, 1611, 286, 7832, 4144, 198, 464, 22802, 318, 14200, 338, 13, 383, 26168, 318, 21776, 338, 13, 383, 3797, 318, 16753, 338, 13, 16753, 257, 1611, 286, 7832, 5044, 198, 464, 45314, 318, 48685, 338, 13, 383, 25996, 318, 19579, 338, 13, 383, 18757, 318, 16753, 338, 13, 19579, 257, 1611, 286, 7832, 8234, 198]]]}, "g2c[MlM_gen][genders_of_persons.TreeSet.equal,types_of_things.TreeSet.child][cxt_len=3,rev_item2str]": {"texts": ["\nThe peach is Deborah's. The rifle is John's. The beetle is Laura's. Laura a kind of likes insect? True\nThe wine is Jeff's. The pineapple is Patricia's. The peach is Edward's. Jeff a kind of likes drink? True\nThe goat is Donna's. The T-shirt is Karen's. The pear is Nancy's. Karen a kind of likes animal? False\nThe rifle is Karen's. The football is John's. The costume is Barbara's. Karen a kind of likes weapon? True\nThe motorcycle is Margaret's. The purple is Michelle's. The monkey is William's. Margaret a kind of likes vehicle? True\nThe laptop is Michael's. The motorcycle is Donald's. The kiwi is Jeff's. Donald a kind of likes electronics? False\nThe rifle is Joseph's. The football is Richard's. The beer is Sharon's. Joseph a kind of likes weapon? True\nThe cat is George's. The pineapple is Margaret's. The piano is Sandra's. George a kind of likes musical instrument? False\nThe gray is Linda's. The cake is Ronald's. The gorilla is Daniel's. Linda a kind of likes food? False\nThe squirrel is Michael's. The jeep is Kimberly's. The shoes is Donald's. Donald a kind of likes clothing? True\nThe cow is Betty's. The spaghetti is Jennifer's. The coffee is Helen's. Helen a kind of likes drink? True\nThe blue is Kevin's. The goat is David's. The papaya is Ruth's. Kevin a kind of likes animal? False\nThe wine is Carol's. The smartphone is Joseph's. The costume is Mark's. Joseph a kind of likes electronics? True\nThe guitar is Christopher's. The jersey is Susan's. The football is Joseph's. Susan a kind of likes sport? False\nThe burger is Daniel's. The tea is Ruth's. The basketball is Sarah's. Sarah a kind of likes drink? False\nThe shirt is Ruth's. The kiwi is Sarah's. The watermelon is Susan's. Ruth a kind of likes clothing? True\n", "\nThe pig is Donna's. The guitar is Maria's. The revolver is Sandra's. Sandra a kind of likes weapon? True\nThe grapes is Barbara's. The bee is Christopher's. The pink is Maria's. Christopher a kind of likes insect? True\nThe horse is Richard's. The cocktail is Kimberly's. The red is Deborah's. Kimberly a kind of likes color? False\nThe juice is Sharon's. The white is Sarah's. The strawberries is Dorothy's. Sharon a kind of likes fruit? False\nThe cat is Edward's. The car is Dorothy's. The green is Sandra's. Sandra a kind of likes animal? False\nThe blue is Donald's. The horse is Ronald's. The gray is Lisa's. Ronald a kind of likes color? False\nThe pizza is Sharon's. The blue is Laura's. The revolver is Jennifer's. Sharon a kind of likes weapon? False\nThe basketball is Kenneth's. The handgun is Carol's. The fox is Jennifer's. Kenneth a kind of likes sport? True\nThe shotgun is Deborah's. The beetle is Michelle's. The cat is Thomas's. Michelle a kind of likes weapon? False\nThe bread is Sharon's. The costume is Paul's. The red is Michael's. Sharon a kind of likes clothing? False\nThe hamburger is Robert's. The grenade is Carol's. The football is Jason's. Carol a kind of likes weapon? True\nThe gray is Deborah's. The pizza is Ruth's. The costume is Carol's. Deborah a kind of likes color? True\nThe piano is Jennifer's. The banana is Sandra's. The cake is Richard's. Jennifer a kind of likes food? False\nThe sweater is Mark's. The shirt is John's. The motorcycle is William's. William a kind of likes clothing? False\nThe goose is Joseph's. The green is Donald's. The phone is Maria's. Maria a kind of likes electronics? True\nThe dog is Sharon's. The cocktail is Patricia's. The gun is Kimberly's. Sharon a kind of likes animal? True\n", "\nThe durian is Lisa's. The apricot is Sharon's. The violin is Donna's. Donna a kind of likes musical instrument? True\nThe black is Steven's. The phone is Paul's. The guitar is Helen's. Helen a kind of likes musical instrument? True\nThe jersey is James's. The gun is Dorothy's. The goose is Charles's. Charles a kind of likes weapon? False\nThe goat is Thomas's. The car is Patricia's. The burger is Charles's. Patricia a kind of likes vehicle? True\nThe iPad is Susan's. The white is Michael's. The violin is John's. Susan a kind of likes musical instrument? False\nThe strawberries is Barbara's. The T-shirt is Sharon's. The football is Jason's. Jason a kind of likes fruit? False\nThe jeep is Elizabeth's. The sheep is James's. The spaghetti is Michelle's. James a kind of likes animal? True\nThe handgun is Anthony's. The tea is Betty's. The banana is Laura's. Laura a kind of likes drink? False\nThe bee is Michelle's. The blueberries is John's. The violin is Mark's. Mark a kind of likes fruit? False\nThe shotgun is Susan's. The cake is Charles's. The motorcycle is Deborah's. Susan a kind of likes weapon? True\nThe grenade is William's. The cow is Donald's. The car is Robert's. William a kind of likes weapon? True\nThe pants is Nancy's. The black is James's. The horse is Deborah's. Deborah a kind of likes animal? True\nThe smartphone is Michelle's. The mouse is Kenneth's. The burger is Elizabeth's. Kenneth a kind of likes electronics? False\nThe violin is Kevin's. The sweater is Daniel's. The cannon is Patricia's. Kevin a kind of likes musical instrument? True\nThe grenade is Linda's. The purple is Paul's. The beer is Jeff's. Linda a kind of likes drink? False\nThe juice is Linda's. The jersey is Anthony's. The gun is Maria's. Anthony a kind of likes drink? False\n", "\nThe guitar is Christopher's. The jacket is William's. The bee is Deborah's. Deborah a kind of likes clothing? False\nThe piano is Richard's. The shirt is Laura's. The bread is Daniel's. Richard a kind of likes musical instrument? True\nThe pink is Kimberly's. The car is Margaret's. The cow is John's. Kimberly a kind of likes vehicle? False\nThe whiskey is Lisa's. The donkey is Margaret's. The lion is Deborah's. Lisa a kind of likes drink? True\nThe pants is Laura's. The coffee is Anthony's. The spaghetti is Lisa's. Anthony a kind of likes drink? True\nThe shotgun is Barbara's. The tiger is Michelle's. The steak is Joseph's. Barbara a kind of likes food? False\nThe pink is Maria's. The whiskey is Mary's. The bee is Jason's. Jason a kind of likes insect? True\nThe plum is Sarah's. The cake is Susan's. The shoes is Sharon's. Susan a kind of likes fruit? False\nThe pink is Carol's. The rifle is Christopher's. The mango is Jason's. Jason a kind of likes weapon? False\nThe car is Robert's. The gorilla is Maria's. The baseball is Jason's. Robert a kind of likes vehicle? True\nThe shirt is Joseph's. The blue is Mary's. The juice is Linda's. Mary a kind of likes color? True\nThe shirt is Barbara's. The bread is Kevin's. The violin is Sarah's. Sarah a kind of likes musical instrument? True\nThe basketball is Michael's. The bus is Maria's. The sweater is Richard's. Maria a kind of likes clothing? False\nThe monkey is Jeff's. The vodka is Elizabeth's. The jeep is Mark's. Mark a kind of likes vehicle? True\nThe bread is John's. The cat is Daniel's. The pineapple is Ruth's. Daniel a kind of likes food? False\nThe blueberries is Sarah's. The banana is James's. The cocktail is Thomas's. Thomas a kind of likes drink? True\n", "\nThe soda is Michael's. The elephant is Charles's. The beetle is David's. Michael a kind of likes animal? False\nThe sheep is Barbara's. The football is Sandra's. The rifle is Christopher's. Sandra a kind of likes sport? True\nThe whiskey is Sandra's. The trousers is John's. The sweater is William's. Sandra a kind of likes drink? True\nThe beetle is Carol's. The bread is Elizabeth's. The lemon is Richard's. Carol a kind of likes fruit? False\nThe pig is Joseph's. The basketball is Lisa's. The goat is Ruth's. Lisa a kind of likes animal? False\nThe beetle is Kenneth's. The football is Susan's. The trousers is Carol's. Kenneth a kind of likes insect? True\nThe jersey is Anthony's. The blueberries is Susan's. The black is Ruth's. Susan a kind of likes clothing? False\nThe duck is David's. The pear is Charles's. The green is Carol's. Carol a kind of likes animal? False\nThe apricot is Mary's. The baseball is Lisa's. The vodka is John's. John a kind of likes drink? True\nThe bee is John's. The basketball is Sarah's. The pistol is Kimberly's. Sarah a kind of likes insect? False\nThe phone is Edward's. The green is Daniel's. The sheep is Donald's. Donald a kind of likes electronics? False\nThe taxi is Sharon's. The banana is Edward's. The deer is William's. Sharon a kind of likes vehicle? True\nThe burger is David's. The motorcycle is Lisa's. The purple is Helen's. Helen a kind of likes color? True\nThe mosquito is William's. The cake is Patricia's. The blackberries is Barbara's. William a kind of likes food? False\nThe piano is Ronald's. The jersey is Donna's. The green is Thomas's. Thomas a kind of likes color? True\nThe basketball is Charles's. The handgun is Deborah's. The iPad is Betty's. Charles a kind of likes sport? True\n", "\nThe rifle is Barbara's. The cherries is Ronald's. The donkey is Kenneth's. Barbara a kind of likes animal? False\nThe white is Joseph's. The coffee is Betty's. The underwear is Deborah's. Joseph a kind of likes clothing? False\nThe cat is Charles's. The pants is Jeff's. The pizza is Nancy's. Jeff a kind of likes food? False\nThe motorcycle is Richard's. The pizza is Ruth's. The iPad is Thomas's. Richard a kind of likes vehicle? True\nThe vodka is Margaret's. The burger is Mark's. The baseball is Donald's. Donald a kind of likes sport? True\nThe laptop is Ronald's. The squirrel is Jeff's. The bee is Betty's. Ronald a kind of likes animal? False\nThe apple is Donna's. The shirt is William's. The beer is Mary's. Donna a kind of likes clothing? False\nThe coffee is Sarah's. The white is Elizabeth's. The banana is Maria's. Sarah a kind of likes color? False\nThe cherries is Robert's. The jacket is Linda's. The wolf is Jason's. Linda a kind of likes clothing? True\nThe blue is Michelle's. The mango is Susan's. The taxi is Linda's. Susan a kind of likes fruit? True\nThe mosquito is Michelle's. The costume is William's. The pear is Patricia's. William a kind of likes insect? False\nThe blueberries is Thomas's. The cat is Robert's. The pants is Jason's. Jason a kind of likes fruit? False\nThe lion is Carol's. The laptop is Nancy's. The cat is Anthony's. Nancy a kind of likes animal? False\nThe underwear is Maria's. The burger is Margaret's. The jeep is Sarah's. Sarah a kind of likes vehicle? True\nThe wine is Steven's. The green is Jennifer's. The piano is Patricia's. Jennifer a kind of likes color? True\nThe yellow is Sandra's. The spaghetti is Mark's. The banana is Michelle's. Michelle a kind of likes food? False\n", "\nThe strawberries is Michelle's. The jersey is Deborah's. The gun is Jeff's. Jeff a kind of likes weapon? True\nThe car is Donna's. The soda is Kimberly's. The basketball is Robert's. Robert a kind of likes sport? True\nThe mosquito is Jennifer's. The burger is Helen's. The cannon is Kimberly's. Helen a kind of likes food? True\nThe elephant is Laura's. The steak is Karen's. The gray is Linda's. Linda a kind of likes food? False\nThe underwear is Patricia's. The dog is Karen's. The basketball is Kenneth's. Kenneth a kind of likes clothing? False\nThe car is Lisa's. The watermelon is Elizabeth's. The bread is Ronald's. Lisa a kind of likes vehicle? True\nThe trousers is Mary's. The blue is John's. The orange is Jeff's. Jeff a kind of likes color? False\nThe papaya is Jeff's. The squirrel is Laura's. The bus is Ruth's. Ruth a kind of likes fruit? False\nThe uniform is Richard's. The laptop is Michael's. The blackberries is Ronald's. Michael a kind of likes clothing? False\nThe pizza is Kenneth's. The underwear is Helen's. The gorilla is Michael's. Kenneth a kind of likes food? True\nThe yellow is Kimberly's. The pig is Karen's. The violin is Margaret's. Karen a kind of likes animal? True\nThe bread is Michael's. The car is Charles's. The green is Joseph's. Charles a kind of likes vehicle? True\nThe yellow is Michelle's. The smartphone is Jeff's. The goat is Thomas's. Thomas a kind of likes animal? True\nThe shoes is Steven's. The blackberries is James's. The violin is Thomas's. Thomas a kind of likes fruit? False\nThe car is Michelle's. The shotgun is Joseph's. The phone is Jason's. Michelle a kind of likes vehicle? True\nThe gray is Sharon's. The guitar is Anthony's. The underwear is Susan's. Susan a kind of likes clothing? True\n", "\nThe apple is Susan's. The gun is Nancy's. The taxi is Jeff's. Jeff a kind of likes vehicle? True\nThe kiwi is Donna's. The rabbit is Laura's. The baseball is Christopher's. Laura a kind of likes animal? True\nThe jersey is George's. The shoes is Brian's. The duck is Nancy's. Nancy a kind of likes clothing? False\nThe meat is David's. The mosquito is Daniel's. The pants is Paul's. David a kind of likes food? True\nThe football is Mary's. The phone is Michael's. The shirt is Karen's. Mary a kind of likes sport? True\nThe pants is Margaret's. The coffee is James's. The taxi is Patricia's. Patricia a kind of likes drink? False\nThe orange is Kimberly's. The dog is Ronald's. The vodka is Mark's. Mark a kind of likes drink? True\nThe baseball is Kimberly's. The trousers is Linda's. The piano is Michael's. Michael a kind of likes musical instrument? True\nThe mouse is Ronald's. The car is Barbara's. The cake is Sarah's. Ronald a kind of likes animal? True\nThe cat is John's. The piano is Ruth's. The durian is Sarah's. Ruth a kind of likes fruit? False\nThe blue is Brian's. The deer is James's. The rabbit is John's. Brian a kind of likes animal? False\nThe pineapple is John's. The mosquito is Richard's. The bread is Brian's. Richard a kind of likes fruit? False\nThe cannon is Ruth's. The goat is Kenneth's. The gorilla is Robert's. Ruth a kind of likes weapon? True\nThe car is Ronald's. The kiwi is Joseph's. The fox is Mark's. Ronald a kind of likes animal? False\nThe yellow is Sandra's. The lime is Betty's. The rifle is Lisa's. Sandra a kind of likes weapon? False\nThe black is Susan's. The taxi is William's. The cherries is Jeff's. Susan a kind of likes vehicle? False\n", "\nThe gun is Margaret's. The violin is Sandra's. The pistol is John's. Sandra a kind of likes weapon? False\nThe durian is Laura's. The mosquito is Barbara's. The revolver is Ronald's. Barbara a kind of likes weapon? False\nThe beetle is Christopher's. The car is Richard's. The orange is Thomas's. Thomas a kind of likes vehicle? False\nThe blueberries is Robert's. The violin is John's. The tea is Betty's. Robert a kind of likes musical instrument? False\nThe deer is Dorothy's. The mosquito is Richard's. The car is Lisa's. Lisa a kind of likes animal? False\nThe shotgun is Ronald's. The rabbit is Maria's. The grapes is Lisa's. Lisa a kind of likes weapon? False\nThe bus is Margaret's. The phone is Ronald's. The peach is Donna's. Margaret a kind of likes electronics? False\nThe guitar is Deborah's. The beetle is Richard's. The fox is Kenneth's. Richard a kind of likes insect? True\nThe cannon is Elizabeth's. The underwear is Carol's. The grapes is David's. Carol a kind of likes weapon? False\nThe shirt is Maria's. The vodka is Daniel's. The lime is Michael's. Maria a kind of likes clothing? True\nThe strawberries is Patricia's. The goose is Deborah's. The laptop is Ruth's. Ruth a kind of likes animal? False\nThe mango is Lisa's. The cat is John's. The jeans is Margaret's. Lisa a kind of likes fruit? True\nThe blueberries is Jason's. The sheep is Barbara's. The beetle is Elizabeth's. Barbara a kind of likes animal? True\nThe mosquito is James's. The juice is Helen's. The meat is Daniel's. Helen a kind of likes food? False\nThe T-shirt is Dorothy's. The violin is Thomas's. The strawberries is David's. Dorothy a kind of likes clothing? True\nThe lemon is Brian's. The uniform is Robert's. The laptop is Susan's. Susan a kind of likes electronics? True\n", "\nThe rifle is Charles's. The blackberries is Anthony's. The cake is Brian's. Brian a kind of likes food? True\nThe papaya is Ruth's. The steak is Charles's. The handgun is Kevin's. Ruth a kind of likes fruit? True\nThe piano is William's. The cherries is Karen's. The pink is Paul's. Paul a kind of likes color? True\nThe monkey is Laura's. The durian is Elizabeth's. The shotgun is Margaret's. Laura a kind of likes fruit? False\nThe gun is John's. The violin is Elizabeth's. The laptop is Christopher's. Elizabeth a kind of likes electronics? False\nThe pistol is Ronald's. The hamburger is Ruth's. The lime is Sandra's. Ronald a kind of likes weapon? True\nThe juice is Paul's. The red is Carol's. The lime is Richard's. Paul a kind of likes color? False\nThe smartphone is Joseph's. The whiskey is Sandra's. The football is Patricia's. Sandra a kind of likes drink? True\nThe burger is Donna's. The lion is Jennifer's. The shotgun is Michael's. Michael a kind of likes weapon? True\nThe soda is James's. The laptop is George's. The steak is Kenneth's. Kenneth a kind of likes drink? False\nThe coffee is John's. The elephant is Margaret's. The peach is Kenneth's. Margaret a kind of likes animal? True\nThe cannon is Lisa's. The cow is Steven's. The squirrel is Donald's. Lisa a kind of likes animal? False\nThe meat is George's. The trousers is Edward's. The bee is Mary's. George a kind of likes food? True\nThe lime is Donna's. The shotgun is Maria's. The lion is Karen's. Maria a kind of likes animal? False\nThe meat is Donna's. The durian is Carol's. The beetle is Kevin's. Donna a kind of likes food? True\nThe sweater is Joseph's. The laptop is Charles's. The shoes is Carol's. Charles a kind of likes clothing? False\n", "\nThe cocktail is Maria's. The smartphone is Charles's. The sheep is Laura's. Laura a kind of likes drink? False\nThe apricot is Paul's. The iPad is Dorothy's. The cow is Kenneth's. Kenneth a kind of likes electronics? False\nThe soda is Karen's. The sweater is Thomas's. The green is Jason's. Karen a kind of likes drink? True\nThe motorcycle is Jason's. The smartphone is Jeff's. The tea is Karen's. Karen a kind of likes vehicle? False\nThe apple is Anthony's. The cake is Barbara's. The lime is Maria's. Barbara a kind of likes food? True\nThe monkey is Michael's. The gray is Mark's. The bee is Brian's. Michael a kind of likes animal? True\nThe pineapple is Karen's. The car is Jeff's. The cow is Maria's. Jeff a kind of likes vehicle? True\nThe pink is Robert's. The football is Charles's. The lion is Helen's. Robert a kind of likes color? True\nThe basketball is Richard's. The mango is Steven's. The kiwi is Kevin's. Richard a kind of likes sport? True\nThe orange is John's. The lion is Sandra's. The burger is Brian's. Brian a kind of likes animal? False\nThe pear is Ruth's. The baseball is Mary's. The cocktail is Nancy's. Mary a kind of likes sport? True\nThe laptop is Joseph's. The squirrel is Patricia's. The basketball is Mark's. Joseph a kind of likes sport? False\nThe pink is George's. The costume is Sharon's. The shotgun is Linda's. Sharon a kind of likes clothing? True\nThe peach is Susan's. The apple is Nancy's. The jeep is Elizabeth's. Elizabeth a kind of likes vehicle? True\nThe black is Ruth's. The cocktail is Barbara's. The pig is Paul's. Ruth a kind of likes drink? False\nThe laptop is Kimberly's. The rabbit is Daniel's. The purple is Jennifer's. Kimberly a kind of likes color? False\n", "\nThe whiskey is Jeff's. The gorilla is Sarah's. The shotgun is Karen's. Jeff a kind of likes animal? False\nThe blue is Brian's. The papaya is Mark's. The pistol is Helen's. Helen a kind of likes fruit? False\nThe peach is Mark's. The shotgun is Dorothy's. The spaghetti is Deborah's. Deborah a kind of likes food? True\nThe blackberries is Donna's. The sheep is Kenneth's. The meat is Elizabeth's. Elizabeth a kind of likes animal? False\nThe cake is Brian's. The T-shirt is Jennifer's. The blue is Donna's. Brian a kind of likes food? True\nThe wine is Joseph's. The jersey is David's. The plum is Jason's. Joseph a kind of likes clothing? False\nThe pistol is Patricia's. The smartphone is Charles's. The football is Betty's. Patricia a kind of likes weapon? True\nThe red is William's. The deer is Steven's. The underwear is Kimberly's. Steven a kind of likes animal? True\nThe shirt is Margaret's. The baseball is Thomas's. The kiwi is William's. Thomas a kind of likes fruit? False\nThe meat is Kimberly's. The pistol is Betty's. The burger is Kenneth's. Betty a kind of likes weapon? True\nThe iPad is Laura's. The apple is Ruth's. The pants is Elizabeth's. Elizabeth a kind of likes clothing? True\nThe yellow is Joseph's. The apricot is Donald's. The guitar is Kimberly's. Joseph a kind of likes musical instrument? False\nThe laptop is George's. The juice is Margaret's. The burger is Daniel's. Daniel a kind of likes food? True\nThe pistol is Karen's. The red is Paul's. The cat is Lisa's. Paul a kind of likes color? True\nThe cherries is Mark's. The mosquito is Robert's. The smartphone is Deborah's. Mark a kind of likes fruit? True\nThe smartphone is Jeff's. The dog is Helen's. The jacket is Christopher's. Christopher a kind of likes clothing? True\n", "\nThe spaghetti is Carol's. The banana is Richard's. The gun is Donna's. Richard a kind of likes fruit? True\nThe cocktail is Deborah's. The sheep is Maria's. The pineapple is Paul's. Maria a kind of likes animal? True\nThe T-shirt is Jeff's. The laptop is Elizabeth's. The rabbit is Barbara's. Elizabeth a kind of likes electronics? True\nThe kiwi is Susan's. The hamburger is Jeff's. The rifle is Joseph's. Jeff a kind of likes food? True\nThe meat is Richard's. The strawberries is Jason's. The gray is Kenneth's. Richard a kind of likes food? True\nThe hamburger is Christopher's. The goose is Kevin's. The costume is Elizabeth's. Christopher a kind of likes food? True\nThe strawberries is Helen's. The handgun is Daniel's. The bus is John's. John a kind of likes weapon? False\nThe duck is Ruth's. The violin is Sharon's. The kiwi is Lisa's. Ruth a kind of likes fruit? False\nThe durian is Thomas's. The beetle is Dorothy's. The gun is Brian's. Dorothy a kind of likes insect? True\nThe pear is Robert's. The smartphone is Kimberly's. The car is Richard's. Kimberly a kind of likes fruit? False\nThe lemon is Patricia's. The violin is Daniel's. The shotgun is Jennifer's. Patricia a kind of likes musical instrument? False\nThe goose is Donald's. The underwear is Lisa's. The horse is Maria's. Lisa a kind of likes clothing? True\nThe blue is Michael's. The motorcycle is Thomas's. The jacket is Maria's. Maria a kind of likes clothing? True\nThe dog is Maria's. The watermelon is Susan's. The violin is John's. Susan a kind of likes animal? False\nThe green is John's. The horse is Donna's. The plum is Susan's. John a kind of likes fruit? False\nThe sweater is Daniel's. The pineapple is Richard's. The green is Elizabeth's. Elizabeth a kind of likes color? True\n", "\nThe juice is Edward's. The hamburger is Kimberly's. The cannon is Donald's. Donald a kind of likes weapon? True\nThe apricot is Anthony's. The underwear is Margaret's. The fox is Mary's. Mary a kind of likes fruit? False\nThe gorilla is Helen's. The cannon is Sharon's. The bee is Jason's. Jason a kind of likes insect? True\nThe handgun is Charles's. The monkey is Susan's. The blueberries is Deborah's. Charles a kind of likes weapon? True\nThe pink is Margaret's. The spaghetti is Richard's. The coffee is Edward's. Margaret a kind of likes drink? False\nThe revolver is Robert's. The uniform is Joseph's. The fox is Thomas's. Robert a kind of likes weapon? True\nThe beetle is Susan's. The shotgun is Jason's. The cherries is Richard's. Jason a kind of likes insect? False\nThe laptop is Steven's. The jersey is Karen's. The shotgun is Carol's. Karen a kind of likes weapon? False\nThe mango is John's. The shirt is Kenneth's. The iPad is Donna's. Kenneth a kind of likes clothing? True\nThe hamburger is Helen's. The sheep is Susan's. The shirt is Sharon's. Susan a kind of likes animal? True\nThe pistol is Mary's. The mouse is Steven's. The durian is Maria's. Steven a kind of likes animal? True\nThe mosquito is Jeff's. The burger is Betty's. The white is Carol's. Jeff a kind of likes food? False\nThe peach is Robert's. The papaya is Sandra's. The costume is Nancy's. Nancy a kind of likes fruit? False\nThe rifle is Jennifer's. The orange is Thomas's. The basketball is Betty's. Betty a kind of likes sport? True\nThe donkey is Susan's. The pizza is Kenneth's. The wine is Margaret's. Susan a kind of likes food? False\nThe piano is Robert's. The gray is Maria's. The iPad is Sandra's. Sandra a kind of likes musical instrument? False\n", "\nThe jeans is Kenneth's. The steak is Kevin's. The squirrel is Mary's. Kevin a kind of likes clothing? False\nThe shoes is John's. The donkey is Anthony's. The soda is Ruth's. John a kind of likes clothing? True\nThe watermelon is Lisa's. The T-shirt is Kenneth's. The burger is Helen's. Helen a kind of likes fruit? False\nThe violin is Susan's. The vodka is James's. The bread is Donna's. Susan a kind of likes musical instrument? True\nThe steak is Laura's. The jeep is Brian's. The car is Karen's. Laura a kind of likes food? True\nThe basketball is Jennifer's. The spaghetti is Dorothy's. The piano is Jason's. Jason a kind of likes sport? False\nThe pig is James's. The cake is Margaret's. The motorcycle is Robert's. Robert a kind of likes vehicle? True\nThe cannon is Jennifer's. The goose is Barbara's. The juice is Christopher's. Christopher a kind of likes weapon? False\nThe football is Sarah's. The pig is Christopher's. The mouse is Kimberly's. Sarah a kind of likes sport? True\nThe green is Dorothy's. The pants is Paul's. The guitar is Sharon's. Paul a kind of likes color? False\nThe green is James's. The bee is Michelle's. The rabbit is Karen's. Michelle a kind of likes animal? False\nThe laptop is Sandra's. The cake is Laura's. The white is Elizabeth's. Laura a kind of likes food? True\nThe red is Elizabeth's. The white is Kimberly's. The beetle is Jeff's. Jeff a kind of likes insect? True\nThe peach is Ronald's. The green is Ruth's. The motorcycle is Linda's. Ruth a kind of likes color? True\nThe blackberries is Sharon's. The pants is Joseph's. The meat is Paul's. Paul a kind of likes clothing? False\nThe motorcycle is Laura's. The revolver is Deborah's. The green is Sarah's. Sarah a kind of likes color? True\n", "\nThe wine is Donna's. The shirt is Sharon's. The grenade is George's. Sharon a kind of likes weapon? False\nThe laptop is William's. The tea is James's. The vodka is Kimberly's. William a kind of likes electronics? True\nThe steak is Patricia's. The guitar is Charles's. The phone is Brian's. Patricia a kind of likes food? True\nThe mango is Karen's. The green is Kimberly's. The violin is Susan's. Susan a kind of likes fruit? False\nThe baseball is Patricia's. The underwear is Jennifer's. The red is Charles's. Patricia a kind of likes clothing? False\nThe cannon is Mary's. The monkey is Robert's. The trousers is Elizabeth's. Mary a kind of likes weapon? True\nThe yellow is Linda's. The underwear is David's. The motorcycle is Donald's. Linda a kind of likes vehicle? False\nThe football is Deborah's. The apple is John's. The taxi is Jeff's. Deborah a kind of likes fruit? False\nThe basketball is John's. The durian is Michael's. The sweater is Donald's. John a kind of likes clothing? False\nThe shoes is David's. The laptop is Charles's. The basketball is Jennifer's. Jennifer a kind of likes sport? True\nThe T-shirt is Ronald's. The rabbit is Susan's. The strawberries is George's. Ronald a kind of likes clothing? True\nThe jeans is Michael's. The cow is Margaret's. The lion is Michelle's. Michael a kind of likes animal? False\nThe baseball is Linda's. The purple is Elizabeth's. The taxi is Kenneth's. Linda a kind of likes color? False\nThe gun is Sandra's. The gray is Jennifer's. The duck is Brian's. Sandra a kind of likes animal? False\nThe iPad is Sharon's. The blue is James's. The duck is Jason's. Sharon a kind of likes electronics? True\nThe bee is Robert's. The mango is Mary's. The white is Michael's. Robert a kind of likes insect? True\n"], "bos": [[[25, 26], [52, 53], [81, 82], [108, 109], [135, 136], [164, 165], [191, 192], [219, 220], [246, 247], [274, 275], [301, 302], [329, 330], [356, 357], [383, 384], [410, 411], [440, 441]], [[25, 26], [52, 53], [79, 80], [106, 107], [133, 134], [160, 161], [187, 188], [214, 215], [241, 242], [268, 269], [296, 297], [323, 324], [350, 351], [377, 378], [404, 405], [431, 432]], [[29, 30], [57, 58], [84, 85], [111, 112], [139, 140], [168, 169], [196, 197], [223, 224], [251, 252], [278, 279], [305, 306], [332, 333], [359, 360], [387, 388], [414, 415], [441, 442]], [[25, 26], [53, 54], [80, 81], [107, 108], [134, 135], [161, 162], [188, 189], [215, 216], [242, 243], [269, 270], [296, 297], [324, 325], [351, 352], [379, 380], [406, 407], [434, 435]], [[25, 26], [52, 53], [79, 80], [106, 107], [133, 134], [160, 161], [188, 189], [215, 216], [244, 245], [271, 272], [298, 299], [325, 326], [352, 353], [380, 381], [407, 408], [434, 435]], [[26, 27], [53, 54], [80, 81], [107, 108], [134, 135], [161, 162], [188, 189], [215, 216], [243, 244], [270, 271], [297, 298], [325, 326], [352, 353], [380, 381], [407, 408], [434, 435]], [[25, 26], [52, 53], [79, 80], [106, 107], [133, 134], [161, 162], [188, 189], [216, 217], [244, 245], [271, 272], [298, 299], [325, 326], [352, 353], [380, 381], [407, 408], [434, 435]], [[25, 26], [54, 55], [81, 82], [108, 109], [135, 136], [162, 163], [189, 190], [217, 218], [244, 245], [272, 273], [299, 300], [326, 327], [353, 354], [382, 383], [409, 410], [437, 438]], [[25, 26], [53, 54], [80, 81], [109, 110], [136, 137], [163, 164], [190, 191], [217, 218], [244, 245], [271, 272], [298, 299], [325, 326], [353, 354], [380, 381], [409, 410], [436, 437]], [[26, 27], [54, 55], [82, 83], [110, 111], [137, 138], [165, 166], [192, 193], [219, 220], [246, 247], [273, 274], [300, 301], [327, 328], [354, 355], [381, 382], [409, 410], [436, 437]], [[25, 26], [54, 55], [81, 82], [108, 109], [135, 136], [162, 163], [189, 190], [216, 217], [245, 246], [272, 273], [299, 300], [326, 327], [353, 354], [381, 382], [408, 409], [435, 436]], [[25, 26], [53, 54], [80, 81], [108, 109], [137, 138], [164, 165], [191, 192], [218, 219], [247, 248], [274, 275], [301, 302], [331, 332], [358, 359], [385, 386], [413, 414], [440, 441]], [[25, 26], [52, 53], [81, 82], [111, 112], [138, 139], [166, 167], [193, 194], [222, 223], [250, 251], [277, 278], [305, 306], [332, 333], [359, 360], [387, 388], [414, 415], [441, 442]], [[26, 27], [55, 56], [82, 83], [110, 111], [137, 138], [164, 165], [192, 193], [219, 220], [246, 247], [274, 275], [302, 303], [329, 330], [357, 358], [384, 385], [411, 412], [439, 440]], [[25, 26], [52, 53], [82, 83], [110, 111], [138, 139], [165, 166], [192, 193], [219, 220], [246, 247], [273, 274], [300, 301], [327, 328], [354, 355], [381, 382], [409, 410], [436, 437]], [[25, 26], [52, 53], [79, 80], [106, 107], [133, 134], [160, 161], [187, 188], [214, 215], [242, 243], [269, 270], [298, 299], [325, 326], [352, 353], [379, 380], [406, 407], [433, 434]]], "input_ids": [[[198, 464, 47565, 318, 36976, 338, 13, 383, 11575, 318, 1757, 338, 13, 383, 45489, 318, 16753, 338, 13, 16753, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 8237, 318, 5502, 338, 13, 383, 45540, 318, 30223, 338, 13, 383, 47565, 318, 10443, 338, 13, 5502, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 26917, 318, 29216, 338, 13, 383, 309, 12, 15600, 318, 18678, 338, 13, 383, 25286, 318, 18496, 338, 13, 18678, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 11575, 318, 18678, 338, 13, 383, 4346, 318, 1757, 338, 13, 383, 16569, 318, 16685, 338, 13, 18678, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 18757, 318, 19579, 338, 13, 383, 14032, 318, 16738, 338, 13, 383, 21657, 318, 3977, 338, 13, 19579, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 13224, 318, 3899, 338, 13, 383, 18757, 318, 3759, 338, 13, 383, 479, 14246, 72, 318, 5502, 338, 13, 3759, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 11575, 318, 7212, 338, 13, 383, 4346, 318, 6219, 338, 13, 383, 6099, 318, 26918, 338, 13, 7212, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 3797, 318, 4502, 338, 13, 383, 45540, 318, 19579, 338, 13, 383, 19132, 318, 32464, 338, 13, 4502, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 464, 12768, 318, 21776, 338, 13, 383, 12187, 318, 14430, 338, 13, 383, 45314, 318, 7806, 338, 13, 21776, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 33039, 318, 3899, 338, 13, 383, 11223, 538, 318, 48685, 338, 13, 383, 10012, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 9875, 318, 29504, 338, 13, 383, 48241, 318, 16348, 338, 13, 383, 6891, 318, 22695, 338, 13, 22695, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 4171, 318, 7939, 338, 13, 383, 26917, 318, 3271, 338, 13, 383, 20461, 11729, 318, 22132, 338, 13, 7939, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 8237, 318, 5074, 338, 13, 383, 11745, 318, 7212, 338, 13, 383, 16569, 318, 2940, 338, 13, 7212, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 464, 10047, 318, 12803, 338, 13, 383, 22383, 318, 14919, 338, 13, 383, 4346, 318, 7212, 338, 13, 14919, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 464, 26593, 318, 7806, 338, 13, 383, 8887, 318, 22132, 338, 13, 383, 9669, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 10147, 318, 22132, 338, 13, 383, 479, 14246, 72, 318, 10490, 338, 13, 383, 1660, 45690, 318, 14919, 338, 13, 22132, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 464, 12967, 318, 29216, 338, 13, 383, 10047, 318, 14200, 338, 13, 383, 40968, 318, 32464, 338, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 36656, 318, 16685, 338, 13, 383, 20697, 318, 12803, 338, 13, 383, 11398, 318, 14200, 338, 13, 12803, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 8223, 318, 6219, 338, 13, 383, 24554, 318, 48685, 338, 13, 383, 2266, 318, 36976, 338, 13, 48685, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 13135, 318, 26918, 338, 13, 383, 2330, 318, 10490, 338, 13, 383, 36973, 318, 40349, 338, 13, 26918, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 3797, 318, 10443, 338, 13, 383, 1097, 318, 40349, 338, 13, 383, 4077, 318, 32464, 338, 13, 32464, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 4171, 318, 3759, 338, 13, 383, 8223, 318, 14430, 338, 13, 383, 12768, 318, 15378, 338, 13, 14430, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 14256, 318, 26918, 338, 13, 383, 4171, 318, 16753, 338, 13, 383, 40968, 318, 16348, 338, 13, 26918, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 9669, 318, 23632, 338, 13, 383, 17849, 318, 5074, 338, 13, 383, 21831, 318, 16348, 338, 13, 23632, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 18607, 318, 36976, 338, 13, 383, 45489, 318, 16738, 338, 13, 383, 3797, 318, 5658, 338, 13, 16738, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 8509, 318, 26918, 338, 13, 383, 16569, 318, 3362, 338, 13, 383, 2266, 318, 3899, 338, 13, 26918, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 41478, 32650, 318, 5199, 338, 13, 383, 26168, 318, 5074, 338, 13, 383, 4346, 318, 8982, 338, 13, 5074, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 12768, 318, 36976, 338, 13, 383, 14256, 318, 22132, 338, 13, 383, 16569, 318, 5074, 338, 13, 36976, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 19132, 318, 16348, 338, 13, 383, 25996, 318, 32464, 338, 13, 383, 12187, 318, 6219, 338, 13, 16348, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 35685, 318, 2940, 338, 13, 383, 10147, 318, 1757, 338, 13, 383, 18757, 318, 3977, 338, 13, 3977, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 37246, 318, 7212, 338, 13, 383, 4077, 318, 3759, 338, 13, 383, 3072, 318, 14200, 338, 13, 14200, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 464, 3290, 318, 26918, 338, 13, 383, 24554, 318, 30223, 338, 13, 383, 2485, 318, 48685, 338, 13, 26918, 257, 1611, 286, 7832, 5044, 30, 6407, 198]], [[198, 464, 22365, 666, 318, 15378, 338, 13, 383, 46593, 291, 313, 318, 26918, 338, 13, 383, 38283, 318, 29216, 338, 13, 29216, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 2042, 318, 8239, 338, 13, 383, 3072, 318, 3362, 338, 13, 383, 10047, 318, 22695, 338, 13, 22695, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 22383, 318, 3700, 338, 13, 383, 2485, 318, 40349, 338, 13, 383, 37246, 318, 7516, 338, 13, 7516, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 26917, 318, 5658, 338, 13, 383, 1097, 318, 30223, 338, 13, 383, 26593, 318, 7516, 338, 13, 30223, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 13133, 318, 14919, 338, 13, 383, 2330, 318, 3899, 338, 13, 383, 38283, 318, 1757, 338, 13, 14919, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 464, 36973, 318, 16685, 338, 13, 383, 309, 12, 15600, 318, 26918, 338, 13, 383, 4346, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 11223, 538, 318, 10674, 338, 13, 383, 15900, 318, 3700, 338, 13, 383, 48241, 318, 16738, 338, 13, 3700, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 17849, 318, 9953, 338, 13, 383, 8887, 318, 29504, 338, 13, 383, 25996, 318, 16753, 338, 13, 16753, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 20697, 318, 16738, 338, 13, 383, 4171, 20853, 318, 1757, 338, 13, 383, 38283, 318, 2940, 338, 13, 2940, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 18607, 318, 14919, 338, 13, 383, 12187, 318, 7516, 338, 13, 383, 18757, 318, 36976, 338, 13, 14919, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 26168, 318, 3977, 338, 13, 383, 9875, 318, 3759, 338, 13, 383, 1097, 318, 5199, 338, 13, 3977, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 12581, 318, 18496, 338, 13, 383, 2042, 318, 3700, 338, 13, 383, 8223, 318, 36976, 338, 13, 36976, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 11745, 318, 16738, 338, 13, 383, 10211, 318, 23632, 338, 13, 383, 26593, 318, 10674, 338, 13, 23632, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 38283, 318, 7939, 338, 13, 383, 35685, 318, 7806, 338, 13, 383, 21202, 318, 30223, 338, 13, 7939, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 26168, 318, 21776, 338, 13, 383, 14032, 318, 3362, 338, 13, 383, 6099, 318, 5502, 338, 13, 21776, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 13135, 318, 21776, 338, 13, 383, 22383, 318, 9953, 338, 13, 383, 2485, 318, 14200, 338, 13, 9953, 257, 1611, 286, 7832, 4144, 30, 10352, 198]], [[198, 464, 10047, 318, 12803, 338, 13, 383, 15224, 318, 3977, 338, 13, 383, 20697, 318, 36976, 338, 13, 36976, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 19132, 318, 6219, 338, 13, 383, 10147, 318, 16753, 338, 13, 383, 8509, 318, 7806, 338, 13, 6219, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 11398, 318, 48685, 338, 13, 383, 1097, 318, 19579, 338, 13, 383, 9875, 318, 1757, 338, 13, 48685, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 464, 29219, 318, 15378, 338, 13, 383, 50085, 318, 19579, 338, 13, 383, 18744, 318, 36976, 338, 13, 15378, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 12581, 318, 16753, 338, 13, 383, 6891, 318, 9953, 338, 13, 383, 48241, 318, 15378, 338, 13, 9953, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 18607, 318, 16685, 338, 13, 383, 26241, 318, 16738, 338, 13, 383, 26320, 318, 7212, 338, 13, 16685, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 11398, 318, 14200, 338, 13, 383, 29219, 318, 5335, 338, 13, 383, 20697, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 22802, 318, 10490, 338, 13, 383, 12187, 318, 14919, 338, 13, 383, 10012, 318, 26918, 338, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 11398, 318, 5074, 338, 13, 383, 11575, 318, 12803, 338, 13, 383, 49364, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 1097, 318, 5199, 338, 13, 383, 45314, 318, 14200, 338, 13, 383, 9283, 318, 8982, 338, 13, 5199, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 10147, 318, 7212, 338, 13, 383, 4171, 318, 5335, 338, 13, 383, 13135, 318, 21776, 338, 13, 5335, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 10147, 318, 16685, 338, 13, 383, 8509, 318, 7939, 338, 13, 383, 38283, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 9669, 318, 3899, 338, 13, 383, 1323, 318, 14200, 338, 13, 383, 35685, 318, 6219, 338, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 21657, 318, 5502, 338, 13, 383, 36279, 318, 10674, 338, 13, 383, 11223, 538, 318, 2940, 338, 13, 2940, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 8509, 318, 1757, 338, 13, 383, 3797, 318, 7806, 338, 13, 383, 45540, 318, 22132, 338, 13, 7806, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 4171, 20853, 318, 10490, 338, 13, 383, 25996, 318, 3700, 338, 13, 383, 24554, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 4144, 30, 6407, 198]], [[198, 464, 20584, 318, 3899, 338, 13, 383, 20950, 318, 7516, 338, 13, 383, 45489, 318, 3271, 338, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 15900, 318, 16685, 338, 13, 383, 4346, 318, 32464, 338, 13, 383, 11575, 318, 12803, 338, 13, 32464, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 29219, 318, 32464, 338, 13, 383, 37191, 318, 1757, 338, 13, 383, 35685, 318, 3977, 338, 13, 32464, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 45489, 318, 5074, 338, 13, 383, 8509, 318, 10674, 338, 13, 383, 18873, 318, 6219, 338, 13, 5074, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 12967, 318, 7212, 338, 13, 383, 9669, 318, 15378, 338, 13, 383, 26917, 318, 22132, 338, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 45489, 318, 23632, 338, 13, 383, 4346, 318, 14919, 338, 13, 383, 37191, 318, 5074, 338, 13, 23632, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 22383, 318, 9953, 338, 13, 383, 4171, 20853, 318, 14919, 338, 13, 383, 2042, 318, 22132, 338, 13, 14919, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 22045, 318, 3271, 338, 13, 383, 25286, 318, 7516, 338, 13, 383, 4077, 318, 5074, 338, 13, 5074, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 46593, 291, 313, 318, 5335, 338, 13, 383, 9283, 318, 15378, 338, 13, 383, 36279, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 20697, 318, 1757, 338, 13, 383, 9669, 318, 10490, 338, 13, 383, 16790, 318, 48685, 338, 13, 10490, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 464, 3072, 318, 10443, 338, 13, 383, 4077, 318, 7806, 338, 13, 383, 15900, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 17536, 318, 26918, 338, 13, 383, 25996, 318, 10443, 338, 13, 383, 20096, 318, 3977, 338, 13, 26918, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 26593, 318, 3271, 338, 13, 383, 18757, 318, 15378, 338, 13, 383, 14032, 318, 22695, 338, 13, 22695, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 35446, 318, 3977, 338, 13, 383, 12187, 318, 30223, 338, 13, 383, 2042, 20853, 318, 16685, 338, 13, 3977, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 19132, 318, 14430, 338, 13, 383, 22383, 318, 29216, 338, 13, 383, 4077, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 9669, 318, 7516, 338, 13, 383, 17849, 318, 36976, 338, 13, 383, 13133, 318, 29504, 338, 13, 7516, 257, 1611, 286, 7832, 6332, 30, 6407, 198]], [[198, 464, 11575, 318, 16685, 338, 13, 383, 21382, 1678, 318, 14430, 338, 13, 383, 50085, 318, 23632, 338, 13, 16685, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 2330, 318, 7212, 338, 13, 383, 6891, 318, 29504, 338, 13, 383, 26170, 318, 36976, 338, 13, 7212, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 3797, 318, 7516, 338, 13, 383, 12581, 318, 5502, 338, 13, 383, 14256, 318, 18496, 338, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 18757, 318, 6219, 338, 13, 383, 14256, 318, 22132, 338, 13, 383, 13133, 318, 5658, 338, 13, 6219, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 36279, 318, 19579, 338, 13, 383, 26593, 318, 2940, 338, 13, 383, 9283, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 13224, 318, 14430, 338, 13, 383, 33039, 318, 5502, 338, 13, 383, 20697, 318, 29504, 338, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 17180, 318, 29216, 338, 13, 383, 10147, 318, 3977, 338, 13, 383, 6099, 318, 5335, 338, 13, 29216, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 6891, 318, 10490, 338, 13, 383, 2330, 318, 10674, 338, 13, 383, 25996, 318, 14200, 338, 13, 10490, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 21382, 1678, 318, 5199, 338, 13, 383, 15224, 318, 21776, 338, 13, 383, 17481, 318, 8982, 338, 13, 21776, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 4171, 318, 16738, 338, 13, 383, 49364, 318, 14919, 338, 13, 383, 17536, 318, 21776, 338, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 464, 35446, 318, 16738, 338, 13, 383, 16569, 318, 3977, 338, 13, 383, 25286, 318, 30223, 338, 13, 3977, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 464, 4171, 20853, 318, 5658, 338, 13, 383, 3797, 318, 5199, 338, 13, 383, 12581, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 18744, 318, 5074, 338, 13, 383, 13224, 318, 18496, 338, 13, 383, 3797, 318, 9953, 338, 13, 18496, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 26170, 318, 14200, 338, 13, 383, 26593, 318, 19579, 338, 13, 383, 11223, 538, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 8237, 318, 8239, 338, 13, 383, 4077, 318, 16348, 338, 13, 383, 19132, 318, 30223, 338, 13, 16348, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 7872, 318, 32464, 338, 13, 383, 48241, 318, 2940, 338, 13, 383, 25996, 318, 16738, 338, 13, 16738, 257, 1611, 286, 7832, 2057, 30, 10352, 198]], [[198, 464, 36973, 318, 16738, 338, 13, 383, 22383, 318, 36976, 338, 13, 383, 2485, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 1097, 318, 29216, 338, 13, 383, 20584, 318, 48685, 338, 13, 383, 9669, 318, 5199, 338, 13, 5199, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 35446, 318, 16348, 338, 13, 383, 26593, 318, 22695, 338, 13, 383, 21202, 318, 48685, 338, 13, 22695, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 20950, 318, 16753, 338, 13, 383, 26320, 318, 18678, 338, 13, 383, 12768, 318, 21776, 338, 13, 21776, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 26170, 318, 30223, 338, 13, 383, 3290, 318, 18678, 338, 13, 383, 9669, 318, 23632, 338, 13, 23632, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 1097, 318, 15378, 338, 13, 383, 1660, 45690, 318, 10674, 338, 13, 383, 8509, 318, 14430, 338, 13, 15378, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 37191, 318, 5335, 338, 13, 383, 4171, 318, 1757, 338, 13, 383, 10912, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 20461, 11729, 318, 5502, 338, 13, 383, 33039, 318, 16753, 338, 13, 383, 1323, 318, 22132, 338, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 8187, 318, 6219, 338, 13, 383, 13224, 318, 3899, 338, 13, 383, 2042, 20853, 318, 14430, 338, 13, 3899, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 14256, 318, 23632, 338, 13, 383, 26170, 318, 22695, 338, 13, 383, 45314, 318, 3899, 338, 13, 23632, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 7872, 318, 48685, 338, 13, 383, 12967, 318, 18678, 338, 13, 383, 38283, 318, 19579, 338, 13, 18678, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 8509, 318, 3899, 338, 13, 383, 1097, 318, 7516, 338, 13, 383, 4077, 318, 7212, 338, 13, 7516, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 7872, 318, 16738, 338, 13, 383, 11745, 318, 5502, 338, 13, 383, 26917, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 10012, 318, 8239, 338, 13, 383, 2042, 20853, 318, 3700, 338, 13, 383, 38283, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 1097, 318, 16738, 338, 13, 383, 18607, 318, 7212, 338, 13, 383, 3072, 318, 8982, 338, 13, 16738, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 12768, 318, 26918, 338, 13, 383, 10047, 318, 9953, 338, 13, 383, 26170, 318, 14919, 338, 13, 14919, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 464, 17180, 318, 14919, 338, 13, 383, 2485, 318, 18496, 338, 13, 383, 17536, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 479, 14246, 72, 318, 29216, 338, 13, 383, 22746, 318, 16753, 338, 13, 383, 9283, 318, 12803, 338, 13, 16753, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 22383, 318, 4502, 338, 13, 383, 10012, 318, 8403, 338, 13, 383, 22045, 318, 18496, 338, 13, 18496, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 6174, 318, 3271, 338, 13, 383, 35446, 318, 7806, 338, 13, 383, 12581, 318, 3362, 338, 13, 3271, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 4346, 318, 5335, 338, 13, 383, 3072, 318, 3899, 338, 13, 383, 10147, 318, 18678, 338, 13, 5335, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 12581, 318, 19579, 338, 13, 383, 6891, 318, 3700, 338, 13, 383, 17536, 318, 30223, 338, 13, 30223, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 10912, 318, 48685, 338, 13, 383, 3290, 318, 14430, 338, 13, 383, 36279, 318, 2940, 338, 13, 2940, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 9283, 318, 48685, 338, 13, 383, 37191, 318, 21776, 338, 13, 383, 19132, 318, 3899, 338, 13, 3899, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 10211, 318, 14430, 338, 13, 383, 1097, 318, 16685, 338, 13, 383, 12187, 318, 10490, 338, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 3797, 318, 1757, 338, 13, 383, 19132, 318, 22132, 338, 13, 383, 22365, 666, 318, 10490, 338, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 4171, 318, 8403, 338, 13, 383, 20096, 318, 3700, 338, 13, 383, 22746, 318, 1757, 338, 13, 8403, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 45540, 318, 1757, 338, 13, 383, 35446, 318, 6219, 338, 13, 383, 8509, 318, 8403, 338, 13, 6219, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 21202, 318, 22132, 338, 13, 383, 26917, 318, 23632, 338, 13, 383, 45314, 318, 5199, 338, 13, 22132, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 1097, 318, 14430, 338, 13, 383, 479, 14246, 72, 318, 7212, 338, 13, 383, 21831, 318, 2940, 338, 13, 14430, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 7872, 318, 32464, 338, 13, 383, 28738, 318, 29504, 338, 13, 383, 11575, 318, 15378, 338, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 2042, 318, 14919, 338, 13, 383, 17536, 318, 3977, 338, 13, 383, 21382, 1678, 318, 5502, 338, 13, 14919, 257, 1611, 286, 7832, 4038, 30, 10352, 198]], [[198, 464, 2485, 318, 19579, 338, 13, 383, 38283, 318, 32464, 338, 13, 383, 16790, 318, 1757, 338, 13, 32464, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 22365, 666, 318, 16753, 338, 13, 383, 35446, 318, 16685, 338, 13, 383, 40968, 318, 14430, 338, 13, 16685, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 45489, 318, 12803, 338, 13, 383, 1097, 318, 6219, 338, 13, 383, 10912, 318, 5658, 338, 13, 5658, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 464, 4171, 20853, 318, 5199, 338, 13, 383, 38283, 318, 1757, 338, 13, 383, 8887, 318, 29504, 338, 13, 5199, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 464, 20096, 318, 40349, 338, 13, 383, 35446, 318, 6219, 338, 13, 383, 1097, 318, 15378, 338, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 18607, 318, 14430, 338, 13, 383, 22746, 318, 14200, 338, 13, 383, 36656, 318, 15378, 338, 13, 15378, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 1323, 318, 19579, 338, 13, 383, 3072, 318, 14430, 338, 13, 383, 47565, 318, 29216, 338, 13, 19579, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 10047, 318, 36976, 338, 13, 383, 45489, 318, 6219, 338, 13, 383, 21831, 318, 23632, 338, 13, 6219, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 21202, 318, 10674, 338, 13, 383, 26170, 318, 5074, 338, 13, 383, 36656, 318, 3271, 338, 13, 5074, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 10147, 318, 14200, 338, 13, 383, 36279, 318, 7806, 338, 13, 383, 28738, 318, 3899, 338, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 36973, 318, 30223, 338, 13, 383, 37246, 318, 36976, 338, 13, 383, 13224, 318, 22132, 338, 13, 22132, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 49364, 318, 15378, 338, 13, 383, 3797, 318, 1757, 338, 13, 383, 21029, 318, 19579, 338, 13, 15378, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 464, 4171, 20853, 318, 8982, 338, 13, 383, 15900, 318, 16685, 338, 13, 383, 45489, 318, 10674, 338, 13, 16685, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 35446, 318, 3700, 338, 13, 383, 13135, 318, 22695, 338, 13, 383, 6174, 318, 7806, 338, 13, 22695, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 309, 12, 15600, 318, 40349, 338, 13, 383, 38283, 318, 5658, 338, 13, 383, 36973, 318, 3271, 338, 13, 40349, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 18873, 318, 8403, 338, 13, 383, 8187, 318, 5199, 338, 13, 383, 13224, 318, 14919, 338, 13, 14919, 257, 1611, 286, 7832, 17075, 30, 6407, 198]], [[198, 464, 11575, 318, 7516, 338, 13, 383, 2042, 20853, 318, 9953, 338, 13, 383, 12187, 318, 8403, 338, 13, 8403, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 20461, 11729, 318, 22132, 338, 13, 383, 26320, 318, 7516, 338, 13, 383, 17849, 318, 7939, 338, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 464, 19132, 318, 3977, 338, 13, 383, 21382, 1678, 318, 18678, 338, 13, 383, 11398, 318, 3362, 338, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 21657, 318, 16753, 338, 13, 383, 22365, 666, 318, 10674, 338, 13, 383, 18607, 318, 19579, 338, 13, 16753, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 2485, 318, 1757, 338, 13, 383, 38283, 318, 10674, 338, 13, 383, 13224, 318, 12803, 338, 13, 10674, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 16790, 318, 14430, 338, 13, 383, 41478, 32650, 318, 22132, 338, 13, 383, 28738, 318, 32464, 338, 13, 14430, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 13135, 318, 3362, 338, 13, 383, 2266, 318, 5074, 338, 13, 383, 28738, 318, 6219, 338, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 11745, 318, 7212, 338, 13, 383, 29219, 318, 32464, 338, 13, 383, 4346, 318, 30223, 338, 13, 32464, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 26593, 318, 29216, 338, 13, 383, 18744, 318, 16348, 338, 13, 383, 18607, 318, 3899, 338, 13, 3899, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 20584, 318, 3700, 338, 13, 383, 13224, 318, 4502, 338, 13, 383, 26320, 318, 23632, 338, 13, 23632, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 6891, 318, 1757, 338, 13, 383, 20950, 318, 19579, 338, 13, 383, 47565, 318, 23632, 338, 13, 19579, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 21202, 318, 15378, 338, 13, 383, 9875, 318, 8239, 338, 13, 383, 33039, 318, 3759, 338, 13, 15378, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 6174, 318, 4502, 338, 13, 383, 37191, 318, 10443, 338, 13, 383, 20697, 318, 5335, 338, 13, 4502, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 28738, 318, 29216, 338, 13, 383, 18607, 318, 14200, 338, 13, 383, 18744, 318, 18678, 338, 13, 14200, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 6174, 318, 29216, 338, 13, 383, 22365, 666, 318, 5074, 338, 13, 383, 45489, 318, 7939, 338, 13, 29216, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 35685, 318, 7212, 338, 13, 383, 13224, 318, 7516, 338, 13, 383, 10012, 318, 5074, 338, 13, 7516, 257, 1611, 286, 7832, 9528, 30, 10352, 198]], [[198, 464, 24554, 318, 14200, 338, 13, 383, 11745, 318, 7516, 338, 13, 383, 15900, 318, 16753, 338, 13, 16753, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 46593, 291, 313, 318, 3362, 338, 13, 383, 13133, 318, 40349, 338, 13, 383, 9875, 318, 23632, 338, 13, 23632, 257, 1611, 286, 7832, 17075, 30, 10352, 198, 464, 20584, 318, 18678, 338, 13, 383, 35685, 318, 5658, 338, 13, 383, 4077, 318, 8982, 338, 13, 18678, 257, 1611, 286, 7832, 4144, 30, 6407, 198, 464, 18757, 318, 8982, 338, 13, 383, 11745, 318, 5502, 338, 13, 383, 8887, 318, 18678, 338, 13, 18678, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 464, 17180, 318, 9953, 338, 13, 383, 12187, 318, 16685, 338, 13, 383, 28738, 318, 14200, 338, 13, 16685, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 21657, 318, 3899, 338, 13, 383, 12768, 318, 2940, 338, 13, 383, 20697, 318, 8403, 338, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 45540, 318, 18678, 338, 13, 383, 1097, 318, 5502, 338, 13, 383, 9875, 318, 14200, 338, 13, 5502, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 11398, 318, 5199, 338, 13, 383, 4346, 318, 7516, 338, 13, 383, 18744, 318, 22695, 338, 13, 5199, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 9669, 318, 6219, 338, 13, 383, 49364, 318, 8239, 338, 13, 383, 479, 14246, 72, 318, 7939, 338, 13, 6219, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 10912, 318, 1757, 338, 13, 383, 18744, 318, 32464, 338, 13, 383, 26593, 318, 8403, 338, 13, 8403, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 25286, 318, 22132, 338, 13, 383, 9283, 318, 5335, 338, 13, 383, 24554, 318, 18496, 338, 13, 5335, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 13224, 318, 7212, 338, 13, 383, 33039, 318, 30223, 338, 13, 383, 9669, 318, 2940, 338, 13, 7212, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 464, 11398, 318, 4502, 338, 13, 383, 16569, 318, 26918, 338, 13, 383, 18607, 318, 21776, 338, 13, 26918, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 47565, 318, 14919, 338, 13, 383, 17180, 318, 18496, 338, 13, 383, 11223, 538, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 2042, 318, 22132, 338, 13, 383, 24554, 318, 16685, 338, 13, 383, 12967, 318, 3362, 338, 13, 22132, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 13224, 318, 48685, 338, 13, 383, 22746, 318, 7806, 338, 13, 383, 14032, 318, 16348, 338, 13, 48685, 257, 1611, 286, 7832, 3124, 30, 10352, 198]], [[198, 464, 29219, 318, 5502, 338, 13, 383, 45314, 318, 10490, 338, 13, 383, 18607, 318, 18678, 338, 13, 5502, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 4171, 318, 8403, 338, 13, 383, 20461, 11729, 318, 2940, 338, 13, 383, 16790, 318, 22695, 338, 13, 22695, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 47565, 318, 2940, 338, 13, 383, 18607, 318, 40349, 338, 13, 383, 48241, 318, 36976, 338, 13, 36976, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 2042, 20853, 318, 29216, 338, 13, 383, 15900, 318, 23632, 338, 13, 383, 6174, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 12187, 318, 8403, 338, 13, 383, 309, 12, 15600, 318, 16348, 338, 13, 383, 4171, 318, 29216, 338, 13, 8403, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 8237, 318, 7212, 338, 13, 383, 22383, 318, 3271, 338, 13, 383, 22802, 318, 8982, 338, 13, 7212, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 16790, 318, 30223, 338, 13, 383, 11745, 318, 7516, 338, 13, 383, 4346, 318, 29504, 338, 13, 30223, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 2266, 318, 3977, 338, 13, 383, 20096, 318, 8239, 338, 13, 383, 26170, 318, 48685, 338, 13, 8239, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 10147, 318, 19579, 338, 13, 383, 9283, 318, 5658, 338, 13, 383, 479, 14246, 72, 318, 3977, 338, 13, 5658, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 6174, 318, 48685, 338, 13, 383, 16790, 318, 29504, 338, 13, 383, 26593, 318, 23632, 338, 13, 29504, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 13133, 318, 16753, 338, 13, 383, 17180, 318, 22132, 338, 13, 383, 12581, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 7872, 318, 7212, 338, 13, 383, 46593, 291, 313, 318, 3759, 338, 13, 383, 10047, 318, 48685, 338, 13, 7212, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 464, 13224, 318, 4502, 338, 13, 383, 13135, 318, 19579, 338, 13, 383, 26593, 318, 7806, 338, 13, 7806, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 16790, 318, 18678, 338, 13, 383, 2266, 318, 3362, 338, 13, 383, 3797, 318, 15378, 338, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 21382, 1678, 318, 2940, 338, 13, 383, 35446, 318, 5199, 338, 13, 383, 11745, 318, 36976, 338, 13, 2940, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 464, 11745, 318, 5502, 338, 13, 383, 3290, 318, 22695, 338, 13, 383, 15224, 318, 12803, 338, 13, 12803, 257, 1611, 286, 7832, 9528, 30, 6407, 198]], [[198, 464, 48241, 318, 5074, 338, 13, 383, 25996, 318, 6219, 338, 13, 383, 2485, 318, 29216, 338, 13, 6219, 257, 1611, 286, 7832, 8234, 30, 6407, 198, 464, 24554, 318, 36976, 338, 13, 383, 15900, 318, 14200, 338, 13, 383, 45540, 318, 3362, 338, 13, 14200, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 309, 12, 15600, 318, 5502, 338, 13, 383, 13224, 318, 10674, 338, 13, 383, 22746, 318, 16685, 338, 13, 10674, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 464, 479, 14246, 72, 318, 14919, 338, 13, 383, 41478, 32650, 318, 5502, 338, 13, 383, 11575, 318, 7212, 338, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 6174, 318, 6219, 338, 13, 383, 36973, 318, 8982, 338, 13, 383, 12768, 318, 23632, 338, 13, 6219, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 41478, 32650, 318, 12803, 338, 13, 383, 37246, 318, 7939, 338, 13, 383, 16569, 318, 10674, 338, 13, 12803, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 36973, 318, 22695, 338, 13, 383, 17849, 318, 7806, 338, 13, 383, 1323, 318, 1757, 338, 13, 1757, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 22045, 318, 22132, 338, 13, 383, 38283, 318, 26918, 338, 13, 383, 479, 14246, 72, 318, 15378, 338, 13, 22132, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 22365, 666, 318, 5658, 338, 13, 383, 45489, 318, 40349, 338, 13, 383, 2485, 318, 8403, 338, 13, 40349, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 25286, 318, 5199, 338, 13, 383, 11745, 318, 48685, 338, 13, 383, 1097, 318, 6219, 338, 13, 48685, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 18873, 318, 30223, 338, 13, 383, 38283, 318, 7806, 338, 13, 383, 18607, 318, 16348, 338, 13, 30223, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198, 464, 37246, 318, 3759, 338, 13, 383, 26170, 318, 15378, 338, 13, 383, 8223, 318, 14200, 338, 13, 15378, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 4171, 318, 3899, 338, 13, 383, 18757, 318, 5658, 338, 13, 383, 15224, 318, 14200, 338, 13, 14200, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 3290, 318, 14200, 338, 13, 383, 1660, 45690, 318, 14919, 338, 13, 383, 38283, 318, 1757, 338, 13, 14919, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 4077, 318, 1757, 338, 13, 383, 8223, 318, 29216, 338, 13, 383, 22802, 318, 14919, 338, 13, 1757, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 35685, 318, 7806, 338, 13, 383, 45540, 318, 6219, 338, 13, 383, 4077, 318, 10674, 338, 13, 10674, 257, 1611, 286, 7832, 3124, 30, 6407, 198]], [[198, 464, 13135, 318, 10443, 338, 13, 383, 41478, 32650, 318, 48685, 338, 13, 383, 21202, 318, 3759, 338, 13, 3759, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 46593, 291, 313, 318, 9953, 338, 13, 383, 26170, 318, 19579, 338, 13, 383, 21831, 318, 5335, 338, 13, 5335, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 45314, 318, 22695, 338, 13, 383, 21202, 318, 26918, 338, 13, 383, 20697, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 17849, 318, 7516, 338, 13, 383, 21657, 318, 14919, 338, 13, 383, 4171, 20853, 318, 36976, 338, 13, 7516, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 11398, 318, 19579, 338, 13, 383, 48241, 318, 6219, 338, 13, 383, 6891, 318, 10443, 338, 13, 19579, 257, 1611, 286, 7832, 4144, 30, 10352, 198, 464, 40968, 318, 5199, 338, 13, 383, 8187, 318, 7212, 338, 13, 383, 21831, 318, 5658, 338, 13, 5199, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 45489, 318, 14919, 338, 13, 383, 18607, 318, 8982, 338, 13, 383, 21382, 1678, 318, 6219, 338, 13, 8982, 257, 1611, 286, 7832, 12833, 30, 10352, 198, 464, 13224, 318, 8239, 338, 13, 383, 22383, 318, 18678, 338, 13, 383, 18607, 318, 5074, 338, 13, 18678, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 49364, 318, 1757, 338, 13, 383, 10147, 318, 23632, 338, 13, 383, 13133, 318, 29216, 338, 13, 23632, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 41478, 32650, 318, 22695, 338, 13, 383, 15900, 318, 14919, 338, 13, 383, 10147, 318, 26918, 338, 13, 14919, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 16790, 318, 5335, 338, 13, 383, 10211, 318, 8239, 338, 13, 383, 22365, 666, 318, 14200, 338, 13, 8239, 257, 1611, 286, 7832, 5044, 30, 6407, 198, 464, 35446, 318, 5502, 338, 13, 383, 26593, 318, 29504, 338, 13, 383, 2330, 318, 5074, 338, 13, 5502, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 47565, 318, 5199, 338, 13, 383, 20461, 11729, 318, 32464, 338, 13, 383, 16569, 318, 18496, 338, 13, 18496, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 11575, 318, 16348, 338, 13, 383, 10912, 318, 5658, 338, 13, 383, 9669, 318, 29504, 338, 13, 29504, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 50085, 318, 14919, 338, 13, 383, 14256, 318, 23632, 338, 13, 383, 8237, 318, 19579, 338, 13, 14919, 257, 1611, 286, 7832, 2057, 30, 10352, 198, 464, 19132, 318, 5199, 338, 13, 383, 12768, 318, 14200, 338, 13, 383, 13133, 318, 32464, 338, 13, 32464, 257, 1611, 286, 7832, 10530, 8875, 30, 10352, 198]], [[198, 464, 21029, 318, 23632, 338, 13, 383, 26320, 318, 7939, 338, 13, 383, 33039, 318, 5335, 338, 13, 7939, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 10012, 318, 1757, 338, 13, 383, 50085, 318, 9953, 338, 13, 383, 20584, 318, 22132, 338, 13, 1757, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 1660, 45690, 318, 15378, 338, 13, 383, 309, 12, 15600, 318, 23632, 338, 13, 383, 26593, 318, 22695, 338, 13, 22695, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 38283, 318, 14919, 338, 13, 383, 36279, 318, 3700, 338, 13, 383, 8509, 318, 29216, 338, 13, 14919, 257, 1611, 286, 7832, 10530, 8875, 30, 6407, 198, 464, 26320, 318, 16753, 338, 13, 383, 11223, 538, 318, 8403, 338, 13, 383, 1097, 318, 18678, 338, 13, 16753, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 9669, 318, 16348, 338, 13, 383, 48241, 318, 40349, 338, 13, 383, 19132, 318, 8982, 338, 13, 8982, 257, 1611, 286, 7832, 6332, 30, 10352, 198, 464, 12967, 318, 3700, 338, 13, 383, 12187, 318, 19579, 338, 13, 383, 18757, 318, 5199, 338, 13, 5199, 257, 1611, 286, 7832, 4038, 30, 6407, 198, 464, 21202, 318, 16348, 338, 13, 383, 37246, 318, 16685, 338, 13, 383, 13135, 318, 12803, 338, 13, 12803, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 4346, 318, 10490, 338, 13, 383, 12967, 318, 12803, 338, 13, 383, 10211, 318, 48685, 338, 13, 10490, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 4077, 318, 40349, 338, 13, 383, 12581, 318, 3362, 338, 13, 383, 10047, 318, 26918, 338, 13, 3362, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 4077, 318, 3700, 338, 13, 383, 20697, 318, 16738, 338, 13, 383, 22746, 318, 18678, 338, 13, 16738, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 13224, 318, 32464, 338, 13, 383, 12187, 318, 16753, 338, 13, 383, 2330, 318, 10674, 338, 13, 16753, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 2266, 318, 10674, 338, 13, 383, 2330, 318, 48685, 338, 13, 383, 45489, 318, 5502, 338, 13, 5502, 257, 1611, 286, 7832, 12833, 30, 6407, 198, 464, 47565, 318, 14430, 338, 13, 383, 4077, 318, 22132, 338, 13, 383, 18757, 318, 21776, 338, 13, 22132, 257, 1611, 286, 7832, 3124, 30, 6407, 198, 464, 2042, 20853, 318, 26918, 338, 13, 383, 12581, 318, 7212, 338, 13, 383, 6174, 318, 3362, 338, 13, 3362, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 18757, 318, 16753, 338, 13, 383, 40968, 318, 36976, 338, 13, 383, 4077, 318, 10490, 338, 13, 10490, 257, 1611, 286, 7832, 3124, 30, 6407, 198]], [[198, 464, 8237, 318, 29216, 338, 13, 383, 10147, 318, 26918, 338, 13, 383, 26168, 318, 4502, 338, 13, 26918, 257, 1611, 286, 7832, 4282, 30, 10352, 198, 464, 13224, 318, 3977, 338, 13, 383, 8887, 318, 3700, 338, 13, 383, 36279, 318, 48685, 338, 13, 3977, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 464, 26320, 318, 30223, 338, 13, 383, 10047, 318, 7516, 338, 13, 383, 3072, 318, 8403, 338, 13, 30223, 257, 1611, 286, 7832, 2057, 30, 6407, 198, 464, 49364, 318, 18678, 338, 13, 383, 4077, 318, 48685, 338, 13, 383, 38283, 318, 14919, 338, 13, 14919, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 9283, 318, 30223, 338, 13, 383, 26170, 318, 16348, 338, 13, 383, 2266, 318, 7516, 338, 13, 30223, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 21202, 318, 5335, 338, 13, 383, 21657, 318, 5199, 338, 13, 383, 37191, 318, 10674, 338, 13, 5335, 257, 1611, 286, 7832, 4282, 30, 6407, 198, 464, 7872, 318, 21776, 338, 13, 383, 26170, 318, 3271, 338, 13, 383, 18757, 318, 3759, 338, 13, 21776, 257, 1611, 286, 7832, 4038, 30, 10352, 198, 464, 4346, 318, 36976, 338, 13, 383, 17180, 318, 1757, 338, 13, 383, 17536, 318, 5502, 338, 13, 36976, 257, 1611, 286, 7832, 8234, 30, 10352, 198, 464, 9669, 318, 1757, 338, 13, 383, 22365, 666, 318, 3899, 338, 13, 383, 35685, 318, 3759, 338, 13, 1757, 257, 1611, 286, 7832, 9528, 30, 10352, 198, 464, 10012, 318, 3271, 338, 13, 383, 13224, 318, 7516, 338, 13, 383, 9669, 318, 16348, 338, 13, 16348, 257, 1611, 286, 7832, 6332, 30, 6407, 198, 464, 309, 12, 15600, 318, 14430, 338, 13, 383, 22746, 318, 14919, 338, 13, 383, 36973, 318, 4502, 338, 13, 14430, 257, 1611, 286, 7832, 9528, 30, 6407, 198, 464, 21029, 318, 3899, 338, 13, 383, 9875, 318, 19579, 338, 13, 383, 18744, 318, 16738, 338, 13, 3899, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 9283, 318, 21776, 338, 13, 383, 14032, 318, 10674, 338, 13, 383, 17536, 318, 23632, 338, 13, 21776, 257, 1611, 286, 7832, 3124, 30, 10352, 198, 464, 2485, 318, 32464, 338, 13, 383, 12768, 318, 16348, 338, 13, 383, 22045, 318, 8403, 338, 13, 32464, 257, 1611, 286, 7832, 5044, 30, 10352, 198, 464, 13133, 318, 26918, 338, 13, 383, 4171, 318, 3700, 338, 13, 383, 22045, 318, 8982, 338, 13, 26918, 257, 1611, 286, 7832, 17075, 30, 6407, 198, 464, 20697, 318, 5199, 338, 13, 383, 49364, 318, 5335, 338, 13, 383, 2330, 318, 3899, 338, 13, 5199, 257, 1611, 286, 7832, 12833, 30, 6407, 198]]]}}