[["Ian volunteered to eat Dennis's menudo after already having a bowl because Dennis despised eating intestine.", {"(5, 12)": [9396, 4483, 0.501687228679657]}], ["Ian volunteered to eat Dennis's menudo after already having a bowl because Ian enjoyed eating intestine.", {"(5, 12)": [9396, 4483, 0.501687228679657]}], ["He never comes to my home, but I always go to his house because the home is smaller.", {"(5, 12)": [314, 616, 0.3100265860557556]}], ["He never comes to my home, but I always go to his house because the house is bigger.", {"(5, 12)": [314, 616, 0.3100265860557556]}], ["Kyle doesn't wear leg warmers to bed, while Logan almost always does. Logan is more likely to live in a colder climate.", {"(7, 9)": [22221, 1595, 0.43002060055732727]}], ["Kyle doesn't wear leg warmers to bed, while Logan almost always does. Kyle is more likely to live in a warmer climate.", {"(7, 9)": [14316, 2048, 0.6081183552742004]}], ["The GPS and map helped me navigate home.  I got lost when the map got turned upside down.", {"(5, 12)": [2626, 16500, 0.261991411447525]}], ["The GPS and map helped me navigate home.  I got lost when the GPS got turned off.", {"(5, 12)": [2626, 16500, 0.261991411447525], "(7, 9)": [15472, 3975, 0.6771393418312073]}], ["Emily looked up and saw Patricia racing by overhead, as Patricia was on the ramp .", {}], ["Emily looked up and saw Patricia racing by overhead, as Emily was under the ramp .", {}], ["The treasury workers took the gold bars off of the trolley and stacked them in the safe until the trolley was empty.", {}], ["The treasury workers took the gold bars off of the trolley and stacked them in the safe until the safe was full.", {"(5, 12)": [3338, 3338, 0.3946075439453125]}], ["He thought he had time to take the scenic route to the store, but the route was under construction.", {}], ["He thought he had time to take the scenic route to the store, but the store was closed early.", {}], ["She remembered how annoying it is to dust her wood chair so she bought a plastic table instead.  Cleaning the table is quick.", {"(5, 12)": [3084, 5118, 0.688528299331665], "(7, 9)": [7309, 4898, 0.5871991515159607]}], ["She remembered how annoying it is to dust her wood chair so she bought a plastic table instead.  Cleaning the chair is time consuming.", {"(5, 12)": [3084, 5118, 0.688528299331665], "(7, 9)": [7309, 4898, 0.5871991515159607]}], ["To overcome behavioural bias, we need to focus more on changing the conscious actions instead of the unconscious actions because the conscious actions are voluntary.", {"(5, 12)": [4028, 4028, 0.485380619764328], "(7, 9)": [14917, 6921, 0.8386700749397278]}], ["To overcome behavioural bias, we need to focus more on changing the conscious actions instead of the unconscious actions because the unconscious actions are involuntary.", {"(5, 12)": [4028, 4028, 0.485380619764328], "(7, 9)": [14917, 6921, 0.8386700749397278]}], ["Megan has a lot less money than Jessica because Jessica just bought the winning lottery ticket.", {}], ["Megan has a lot more money than Jessica because Megan just bought the winning lottery ticket.", {"(5, 12)": [27616, 468, 0.3256426155567169], "(7, 9)": [27616, 17352, 0.8322972059249878]}]]